[
  {
    "id": 408636,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-12-30T13:53:28",
    "content": "<p>My USCG pension showed up 2-days early.</p>\n",
    "parent": 0
  },
  {
    "id": 408621,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-12-29T16:03:42",
    "content": "<p>Coast Guard members will get one-time paycheck on New Year&#8217;s Eve amid government shutdown<br />\nLegal analysis &#8220;determined the Coast Guard has the authority to execute the remainder of pay and allowances for December,&#8221; according a blog for the Coast Guard.<br />\n<a href=\"http://www.nbcnews.com/news/us-news/coast-guard-members-will-get-one-time-paycheck-new-year-n952866\" rel=\"nofollow ugc\">http://www.nbcnews.com/news/us-news/coast-guard-members-will-get-one-time-paycheck-new-year-n952866</a></p>\n",
    "parent": 0
  },
  {
    "id": 408612,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-12-28T18:11:32",
    "content": "<p>Despite the lies told by Trump, illegal immigration is at a 50 year low. And regardless a wall would nothing to address the problem. Most undocumented immigrants enter this country legally and overstay their visas. </p>\n<p>Coast Guardsmen do not deserve to be screwed over because a clown in the Oval Office can&#8217;t get his vanity project funded.</p>\n",
    "parent": 408611
  },
  {
    "id": 408611,
    "author": "glenwood weather",
    "authorUrl": "",
    "date": "2018-12-28T17:39:06",
    "content": "<p>I wish the previous fools on the hill would have taken care of the illegal alien problem like they said they were going to.  Then President Trump wouldn&#8217;t have to be the one with the guts to try and get something done.<br />\nHasn&#8217;t President Trump&#8217;s budget asked for $11.65 billion  for the Coast Guard?<br />\n<a href=\"https://www.uscg.mil/Portals/0/documents/budget/FY2019BudgetFactSheet_FINAL.PDF\" rel=\"nofollow ugc\">https://www.uscg.mil/Portals/0/documents/budget/FY2019BudgetFactSheet_FINAL.PDF</a></p>\n",
    "parent": 0
  },
  {
    "id": 408610,
    "author": "phil",
    "authorUrl": "",
    "date": "2018-12-28T15:12:44",
    "content": "<p>From the last shutdown.<br />\nDated Jan 2018, but should still apply, pay is from a different account.</p>\n<p>UPDATED: How a Government Shutdown Impacts Pay, Benefits<br />\n<a href=\"https://www.military.com/daily-news/2018/01/18/how-government-shutdown-would-impact-pay-benefits.html\" rel=\"nofollow ugc\">https://www.military.com/daily-news/2018/01/18/how-government-shutdown-would-impact-pay-benefits.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 408609,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-12-28T15:07:46",
    "content": "<p>Noon news said no pay, which we already know, but what about the retirees and those on USCG disability and pension?</p>\n<p>Willy, that fool on the hill is loved by people with lots of stock to worry about, plus more jobs than there has been in years.</p>\n",
    "parent": 0
  },
  {
    "id": 408607,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-12-28T11:31:15",
    "content": "<p>Congress supposedly passed a bill 7 days ago that federal employees are to get back pay that is currently being with held because of the &#8220;fool on the hill&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 408604,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-12-28T08:24:53",
    "content": "<p>Looking at this from the outside, IF the wall is built the Coastguard are going to be the ones fishing all the migrants trying to get around the ends out of the sea: therefore it would be folly to upset them now with short change.<br />\nIn the UK we also have a problem, unless the illegal migrants crossing the Dover straits in small inflatable boats are already in distress the French authorities just watch them until they are in UK waters before they fish them out and hand them over to the UK border guards for processing.</p>\n",
    "parent": 0
  },
  {
    "id": 408601,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-12-28T04:48:52",
    "content": "<p>One of those rare situations where it&#8217;s truly impossible to keep politics out of the wardroom because it&#8217;s oozing in like a toxic gas. </p>\n<p>2+2=4 vs 2+2=5 does not average out to a correct answer of 4.5. There is no &#8220;center&#8221; to this matter. Let alone all the other debatable points of &#8220;the wall,&#8221; the $5 billion ransom fee for paying these people and so many others would cover but a tiny fraction of the cost of a wall as described by Agent Orange during his campaign, the wall that we were told we would not be paying for. To finish the job would require extended tiresome and stupid repetitions of the current fiasco. There&#8217;s no functional compromise in this situation that does not laugh in the face of reality. </p>\n<p>This hostage incident is purely theatrical gratification of some weird kind for the ignoramus squatting in the WH, a histrionic tantrum of historical proportions. Most of us knew better, thankfully and as a small ray of hope for improvement.</p>\n",
    "parent": 0
  }
]