[
  {
    "id": 413475,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-02-08T05:25:56",
    "content": "<p>Phil, your advice is sound but it wouldn&#8217;t have stopped these poor souls being infected with this NEW illness for which vaccinations are yet to be developed. Were you wearing a full bio-hazard suit on your travels or were you just lucky?<br />\nPassengers are now confined to cabins like prisoners, those having inboard cabins being allowed a few minutes on deck each day.</p>\n",
    "parent": 0
  },
  {
    "id": 413417,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-02-02T16:05:43",
    "content": "<p>Idiot people who don&#8217;t get proper education AND vaccinations BEFORE traveling abroad! You can&#8217;t drink the water, trust the ice and don&#8217;t even attempt to eat from shady street vendors or places with few locals.</p>\n<p>I traveled to 18+ countries, S. Africa, Angola Africa, Nicaragua, Mexico, Indonesia, Japan, Afghanistan, Azerbaijan, UK, Paris a etc. and never once got sick!</p>\n<p>Example: Cured (?) Pork leg sitting out, flys all around and the tourist ate slices. Why?</p>\n<p>And drinking glasses may look clean, don&#8217;t trust them.</p>\n",
    "parent": 0
  },
  {
    "id": 413408,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-01-31T20:14:12",
    "content": "<p>At some point the cruise industry bubble is going to burst as there is unsustainable growth due to corporate greed. I was expecting the tipping point to be due to a stock markets crash and financial downturn or even just cruising going out of fashion but we now have a new possible cause.<br />\nI wont be sorry, trying to pick out the navigation lights of cruise ships is nearly impossible because of all their other lights.</p>\n",
    "parent": 0
  },
  {
    "id": 413404,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-01-31T13:38:35",
    "content": "<p>Meanwhile other passengers could develop flu like symptoms and a witch hunt mentallity can occur.  Sigh</p>\n",
    "parent": 0
  }
]