[
  {
    "id": 428264,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-08-08T13:36:46",
    "content": "<p>The performance and handling advantages of a fin keel are simply irresistible. But fin keels involve engineering that axiomatically reduces failure margins. We can make this work yet it needs a change in habits against simply depending on pure high mass and high modulus.</p>\n<p>Short of having any specific reason for suspicion, frequent inspection as a matter of routine helps. There&#8217;s enough overhead in the typical design that the keel will hang on despite a bit of working, and working leaves plain evidence&#8211; if somebody bothers to look.</p>\n<p>Any insult to the fin demands immediate inspection, close attention to condition of fairing at the joint between hull and keel, checking attachment bolts for mysterious increase of tolerances, rhythmic deflection of the keel while the hull is up on blocks. This doesn&#8217;t cost much unless it interrupts a monetarily or psychologically expensive schedule.</p>\n<p>The investigation into <i>Cheeki Rafiki</i><i> is a helpful case study of the general picture. Allisions and other insults involving fin keels have crept into the province of &#8220;routine&#8221; and hence are shrugged off, despite the low margins necessarily involved in a fin keel.</p>\n<p>Highly engineered artifacts require high attention. Lack of brute strength purchased by high mass requires payment via attention. When boats begin to resemble aircraft or the most efficient bridges, we have to upgrade maintenance philosophies. If an aircraft&#8217;s wing comes in contact with another object, we don&#8217;t ignore that and carry on as though nothing happened. The design doesn&#8217;t support such cases&#8211; the wing is built to only touch air.</p>\n<p>And of course, short of recipe-book engineering solutions for hanging a keel from a hull,  a marine architect needs the humility to call in a consulting engineer for a second set of eyes and caculations, surely. Errors won&#8217;t be covered up by extra mass and margin.</p>\n<p>A full keel comes without these burdens but of course carries its own set of trades. Awkward at the dock, etc. Arguably much  better suited for activities including gunkholing and the like, anything</i></p>\n",
    "parent": 0
  }
]