[
  {
    "id": 408772,
    "author": "James A. Adamson",
    "authorUrl": "",
    "date": "2019-01-04T21:07:13",
    "content": "<p>Who would allow their 16 year old to drive from coast to coast of the U.S. alone, much less sail around the world? Been around the world on 400+ foot freighters; to quote the advise to Kevin in Home Alone, &#8216;it can get scary out there kid&#8217;.</p>\n",
    "parent": 0
  },
  {
    "id": 408771,
    "author": "Michael",
    "authorUrl": "",
    "date": "2019-01-04T20:45:27",
    "content": "<p>As the owner for 5 years prior to the Sunderlands (renamed Velocity to Wildeyes ), I can say without any hesitation that Abby Sunderland  was fortunate to have been in THAT  boat. She was designed with intent and after careful thought in collaboration with the designer, the builder and the owner.She survived a savage Southern Ocean storm in the 2001  Around Alone .She met a predictable end after an I&#8217;ll advised decision to continue the voyage. Fortunately the Sunderland team had enough sense to attempt this caper in the Paris 40 by Jutson and Sayre. Life saved 1 ,Darwin Principal 0</p>\n",
    "parent": 0
  },
  {
    "id": 408766,
    "author": "Mike Kingdom-Hockings",
    "authorUrl": "",
    "date": "2019-01-04T15:17:56",
    "content": "<p>Does anyone remember  the video footage of Abby&#8217;s departure from Cape Town? I was puzzled by the fact that she hadn&#8217;t set and trimmed her sails properly even by the time she was well out to sea. A bit worrying, and dudn&#8217;t give the image of the competence and confidence she had shown up to that point&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 408758,
    "author": "Pat Byrnes",
    "authorUrl": "",
    "date": "2019-01-03T22:21:29",
    "content": "<p>It appears that Abby Sunderland disappeared from the sailing scene, but her older brother Zac was still doing lots of sailing stuff fairly recently. It would be fascinating to see if she ever had much to say after becoming an adult.</p>\n",
    "parent": 0
  },
  {
    "id": 408756,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-03T18:57:19",
    "content": "<p>I&#8217;ve just been looking at generalised GZ curves and that boat was probably more stable upside down than the right way up by design. The price of speed. As a knock down in a southern ocean storm is an odds on cert who would let their daughter try and sail around the world in a boat like that?</p>\n<p>I was also mildly amused when reading her wikipedia article that someone in France was so incensed by the cost of her rescue that they wanted to propose a law that any visitors to France should pay for rescues from doing stupid things. They obviously hadn&#8217;t thought it through as the French are one of the great ocean sailing organisers and what goes around comes around.</p>\n",
    "parent": 0
  },
  {
    "id": 408751,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-03T17:51:18",
    "content": "<p>A google search on images.<br />\n<a href=\"https://www.google.com/search?q=wild+eyes+boat&#038;num=100&#038;newwindow=1&#038;client=firefox-b-1&#038;source=lnms&#038;tbm=isch&#038;sa=X&#038;ved=0ahUKEwiQw53Ry9LfAhUEZd8KHYY6DkQQ_AUIDygC&#038;biw=1408&#038;bih=648\" rel=\"nofollow ugc\">https://www.google.com/search?q=wild+eyes+boat&#038;num=100&#038;newwindow=1&#038;client=firefox-b-1&#038;source=lnms&#038;tbm=isch&#038;sa=X&#038;ved=0ahUKEwiQw53Ry9LfAhUEZd8KHYY6DkQQ_AUIDygC&#038;biw=1408&#038;bih=648</a><br />\nLooks like the boat cant right itself from muscle growth on the hull.  It must make for one hull of a reef!  pun intended</p>\n",
    "parent": 0
  },
  {
    "id": 408748,
    "author": "Marty",
    "authorUrl": "",
    "date": "2019-01-03T17:40:08",
    "content": "<p>I said right from the start of this nonsense that there was nothing wrong with the boat, only the person driving it. The very fact that the boat is still afloat after all this time is testament to the fact that, had Sunderland had the skills to do it, the boat could have been jury rigged and sailed to Australia. I reckon she just had the life scared out of her and panicked. As a young, inexperienced girl might be expected to do. Which is why she should never have been out there in the first place.</p>\n",
    "parent": 0
  },
  {
    "id": 408743,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-03T15:20:17",
    "content": "<p>Maybe the keel was intact, just not attached to the boat?<br />\nWith no rig surely the hull would have self-righted in the next storm if the keel was waving about in the air?<br />\nIt was obviously slightly better built than a certain Oyster 825 <a href=\"http://oysterstory.info/\" rel=\"nofollow ugc\">http://oysterstory.info/</a></p>\n",
    "parent": 0
  },
  {
    "id": 408740,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-03T14:17:19",
    "content": "<p>I would suppose that the keel wasnt as well attached as the designer had hoped.  Maybe the designer needs to look at the hull to understand why it failed.  Just my thoughts</p>\n",
    "parent": 0
  }
]