[
  {
    "id": 426388,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2022-03-20T18:14:29",
    "content": "<p>That&#8217;s what happens when it is bought by a hedge fund.</p>\n",
    "parent": 0
  },
  {
    "id": 426387,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-03-20T12:11:51",
    "content": "<p>Once again now that cruises have resumed something goes wrong on occasions.  This results from poor or even bad planning. </p>\n<p>Firstly the vessel is far too big to have Puerto Plata, DR as a port call. Secondly when something does go wrong the Company concerned, in this case Norwegian, does not respond well. </p>\n<p>For those not familiar with maritime management vessel Operating Companies have Agents who specialise in dealing with vessels in all ports of call to handle their affairs locally.  So these Agents are the people who should be looking after the passengers from ship to airport or wherever.  Of course there should be a &#8220;first responder team&#8221; from Norwegian to supervise and see that this is done as best as possible particularly when you are dealing with people disappointed, tired, confused by language differences and many no doubt hung over !!</p>\n<p>Thirdly it must have been quite difficult to arrange for planes to transport the 2090 passengers.  This where Jean-Pierre comes in with an astute observation; that  could well be where the planes had to come from !!</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 426386,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-03-20T08:26:28",
    "content": "<p>&#8220;Yes sir we have ten planes ready for you to charter at short notice&#8221;<br />\nAside to colleague: &#8220;Don&#8217;t tell them they are in Russia &#8211; well, where else are they going to find &#8217;em at such short notice. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 426385,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2022-03-20T04:15:29",
    "content": "<p>Norwegian Escapade?</p>\n",
    "parent": 0
  }
]