[
  {
    "id": 406767,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2018-08-03T06:18:18",
    "content": "<p>Hi I was on the same Atlantic crossing out of Senegal and Cape Verde as Paul, I had long wanted to sail a Baltimore clipper but was unable to get a berth until this invitation came along and I was flown into Senegal. I concur with what Pauls says raked masts equal go faster stripes, although she sailed well nothing remarkable was achieved, a Baltimore clipper without her tops`l yards is just another schooner, here in the UK the tops`l yards have been removed from the  3 mast tops`l schooner Kathleen and May on the grounds they say of insurance, a wholly wrong move in my estimation </p>\n<p>best regards to shipmate Paul</p>\n<p>Chris</p>\n",
    "parent": 0
  },
  {
    "id": 406756,
    "author": "Paul Bryant-Smith",
    "authorUrl": "",
    "date": "2018-08-01T08:58:11",
    "content": "<p>As a former crew member on Amistad, I feel uniquely qualified to tell you that’s the raked mast serve exactly the same purpose as the tail fins on a 1959 Cadillac Eldorado. Even if they don’t actually improve performance, they certainly make her LOOK fast. </p>\n<p>I’m glad to see that the new nonprofit, Discovering Amistad, is running good programs this year. I hope that they’ll be able to get Amistad’s square foretopsail and t’gallant back on her in the near future.</p>\n",
    "parent": 0
  },
  {
    "id": 406753,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-07-31T22:16:45",
    "content": "<p>There are all sorts of reasons given for raked masts on &#8220;sharp-built&#8221; schooners. One claim is that the raked masts help keep the headstays tight to improve windward performance. A related claim is that the rake creates a longer luff which also improves lift to windward. These reasons are a bit doubtful.</p>\n<p>There is a good structural rationale for the raked mast in that they decrease the need for running backstays in light to moderate airs. On the other hand, lots of rake can complicate handling the boom in light air downwind.</p>\n<p>Another argument is that the hull form and the fore and aft rig made for a very weatherly design. The structural advantages of the raked masts may not have improved the performance but came to be associated with good windward sailing. Essentially, raked masts became a fashion. They looked fast or were associated with fast sailing.</p>\n<p>I think the best argument that raked masts didn&#8217;t really increase performance can be seen in later schooners with only moderately raked masts.</p>\n",
    "parent": 0
  },
  {
    "id": 406751,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2018-07-31T17:56:24",
    "content": "<p>Yes Rick beautiful looking.  Just a technical question.  She&#8217;s not the only one by any means but why are her masts &#8216;raked&#8217; backwards?</p>\n",
    "parent": 0
  }
]