[
  {
    "id": 411815,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-08-14T16:45:28",
    "content": "<p>An underwater train turn-table bridge.</p>\n",
    "parent": 0
  },
  {
    "id": 411813,
    "author": "Willie",
    "authorUrl": "",
    "date": "2019-08-14T14:53:34",
    "content": "<p>“The Roboats will autonomously respond to and learn from the dynamics of this Amsterdam waterway.&#8221;</p>\n<p>On the surface, at first glance, this project sounds amazing, credible and perhaps worthy of the time and money that will go into the research, development and implementation.  Perhaps the greater focus should be; &#8220;Why&#8221;. What is the objective of this system and service being performed by &#8220;Autonomous Roboats&#8221;?  What is the importance and end value/effect of artificial intelligence development? At the end of the day does &#8220;AI&#8221; enhance or diminish human value/worth?  It seems, at times, that today&#8217;s technological advancements have an underlying ability (whether intentional or not) to allow us to look at humanity as nothing more than a cause and effect existence, with little importance given to the aspects of; compassion, brotherly love, kindness, consideration, understanding, sympathy, tolerance, goodness, generosity, charity and mercy.  Acting in accordance with one&#8217;s moral duty rather than one&#8217;s desires or artificially designed ethos must be part of the equation.  Yes, yes, I know. No one want&#8217;s to hear about personal accountability.  If only we could eradicate that part of the human experience.</p>\n<p>The 16th through 18th century Dutch Shipping Empire seems to have done quite well, even without our self edifying intelligence.</p>\n<p>Cheers</p>\n",
    "parent": 0
  },
  {
    "id": 411812,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-08-14T11:39:04",
    "content": "<p>The headache is that robotics only removes the human factor.  This is great for some place where humans cant exist for toxic reasons.  Yet we havent killed the earth to justify removing the human element.</p>\n",
    "parent": 0
  },
  {
    "id": 411808,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-08-13T16:59:20",
    "content": "<p>It will be hidden, but find the death count!</p>\n",
    "parent": 0
  }
]