[
  {
    "id": 410384,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-05-02T16:19:30",
    "content": "<p>On a work assignment back in 1997, we took a weekend day to visit the site, but they don&#8217;t let you close enough to actually touch them, for tourist anyway.</p>\n<p>6 of the World’s Most Mysterious Standing Stones<br />\nBY Claire Cock-Starkey<br />\nJanuary 30, 2017</p>\n<p>Standing stones, stone circles, and megaliths have been discovered across the world, but scientists and historians continue to debate their purpose, construction, and meaning. Many theories have been put forward for these creations, from astronomical sites to places of ritual and worship. But perhaps even more puzzling than the meaning of their creation is how they were built with enormously heavy stones long before the creation of the wheel, let alone other modern technology. Below are seven of the world’s most mysterious stones.<br />\n<a href=\"http://mentalfloss.com/article/91669/6-worlds-most-mysterious-standing-stones\" rel=\"nofollow ugc\">http://mentalfloss.com/article/91669/6-worlds-most-mysterious-standing-stones</a></p>\n",
    "parent": 0
  },
  {
    "id": 410378,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2019-05-02T05:59:00",
    "content": "<p>Of course all cromlechs  and megaliths are not costal we have returned from a trip through Portugal and Spain over a 3 month period and have been to quite out the way places where such are found, rather like Tor Heyerdahl&#8217;s theory that because it was difficult to insert a piece of card between the stones on Easter Island the walls must have been built by descendants of the ancients in south America there is always another theory, it is logical that the inscriptions on  stones would relate to what the people were doing in that area. One of the worlds oldest known seagoing boats and the most intact although only 9.5 meters of an estimated 14 meters was brought up for conservation is currently the Dover boat found during excavations for a new underpass  1992 in Dover England it is in the museum there, the Dover Bronze Age boat is one of fewer than 20 Bronze Age boats so far found and the only truly sea going vessel yet found in the country. It dates to 1575–1520 BC, which may make it the oldest substantially intact boat in the world It was made using oak planks sewn together with yew withy lashings, for more information and photographs see: <a href=\"https://www.archaeology.co.uk/articles/specials/timeline/the-dover-bronze-age-boat.htm\" rel=\"nofollow ugc\">https://www.archaeology.co.uk/articles/specials/timeline/the-dover-bronze-age-boat.htm</a></p>\n",
    "parent": 0
  },
  {
    "id": 410376,
    "author": "Dominic",
    "authorUrl": "",
    "date": "2019-05-01T15:43:51",
    "content": "<p>Years ago I had my patrilineal and matrilineal DNA tested. Apparently, my patrilineal DNA had a mutation in my haplogroup that a group was interested in. Upon further research of the mutated subgroup known as the Sardinian Man because the mutation was found predominantly on the Island of Sardinia, I found that someone claimed that the ancient ancestors of that group traveled a lot by sea and might have had influence on establishing megaliths. Interesting</p>\n",
    "parent": 0
  },
  {
    "id": 410363,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-04-30T16:51:27",
    "content": "<p>I dont remember what episode it was of Time Team.  Yet in it the narrator Tony described much of what is now the British Isles as being more of a group of islands.  Todays England isnt like it is now some 200 years ago.  There were alot more rivers and marshes that covered much of England.</p>\n<p>I tried to find the episode.  Alas I couldnt find it.  Just stating this in support for what is posted above.</p>\n",
    "parent": 0
  }
]