[
  {
    "id": 408379,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-12-17T15:58:33",
    "content": "<p>Speaking of which, they are now offering a barrel of whisky to anyone who fetches it back to land&#8230; <a href=\"https://twitter.com/ggr2018official/status/1074717159610306560\" rel=\"nofollow ugc\">https://twitter.com/ggr2018official/status/1074717159610306560</a></p>\n",
    "parent": 0
  },
  {
    "id": 408359,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-12-16T01:56:15",
    "content": "<p>I don&#8217;t think it&#8217;s written down Jean-Pierre but as a matter of tacit consensus the path of dollar accountancy for SAR seems a course nobody seems to want to set out.  The price of an error or pinch-penny myopia is so very high.</p>\n<p>It is indeed amazing how the inanimate boat so often continues to survive long after the crew has given up. A boat with no planks working turns out to be very hard to sink. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 408352,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-12-15T12:20:14",
    "content": "<p>Very interesting and thoughtful analysis Doug. Do you know if the participants of the race have insurance that covers the cost of shipowners sending ships to pick up random yachties. I know we are all morally obliged to save human life if we are in a position to do so and that the understanding is reciprocal.<br />\nThe ship owners may gain benefit from the PR and also in the crew training of the exercise.<br />\nThe interesting case is the Irish chap who&#8217;s boat is still sending out AIS signals as it wanders the Indian Ocean, if he had stayed aboard he would probably have reached Australia under jury rig by now.</p>\n",
    "parent": 0
  },
  {
    "id": 408346,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-12-15T05:55:47",
    "content": "<p>The more I think about it, the more interested I am in the ethical quandaries posed by a race such as this one, or only slightly by extension any activity pursued by people with an extremophile bent frequently leading to harrowing extraction activities. </p>\n<p>I can&#8217;t see into Skipper Sinclair&#8217;s thinking but I&#8217;m fairly sure most of us would include in our calculus whether a member of an all-volunteer recreational navy sailing in a vessel carefully and intentionally made less safe than possible has the right to tap into the ethical obligation of other mariners to assist in rescue.</p>\n<p>The race rules in this case add to the intrigue. The vessels are specified such that as a statistical matter rescue will be more likely necessary, and at the same time the race organizers insist that participants selectively carry the ultimate safety tool, one that materializes a team of other people to help. This tool is intended to be used in the case of complete failure and only after every means of self-rescue has been exhausted and found wanting. Meanwhile the methods standing between an average good day and the rescue tool&#8217;s employment are stripped bare, making disaster and a plea to  &#8220;come and get me&#8221; delivered by state-of-the-art technology more probable. Operation of this tool immediately and implacably demands that others suddenly become participants in the race, they having been dragged into consequences of the weird artificial defects dictated by the race rules. </p>\n<p>It could be argued that letting the rest of us vicariously live the limits of the human spirit is actually needful work, so that mariners participating in such an artfully crafted set of defects as those imposed in this race are shoulder-shoulder with people doing more useful work on the water.  </p>\n<p>One could also argue (and it&#8217;s quite possible Mark Sinclair might, if he were free of race rules he did not make) that one should be free to participate in such a race without the psychological and ethical burden of carrying an EPIRB or satellite phone. </p>\n<p>Given what seem to be increasing numbers of people taking on ever more extreme and stringent voyages that are frequently shaped by highly arbitrary rules  ignoring or subordinating the safety and welfare not only of direct participants but also those within steaming range of an upset, perhaps all this should be worked out as portable policy? </p>\n<p>Heading out into the ocean and sinking without a trace could well be a legitimate lifestyle choice but as it stands now we seem to trying to have our cake and eat it as well.</p>\n",
    "parent": 0
  },
  {
    "id": 408331,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-12-14T12:59:26",
    "content": "<p>It&#8217;s of course going to be a matter of rough calculation but one of the many variables Sinclair must account for is &#8220;what&#8217;s the probability I&#8217;m going to become an SAR target and hence put others at risk, for a race?&#8221;</p>\n<p>&#8220;Lack of heart&#8221; was left standing at the dock when Sinclair departed. This decision isn&#8217;t lack of heart, it&#8217;s presence of brains. </p>\n<p>We can be quite certain that if Sinclair <i>did</i> end up in trouble and needing help, fingers would be flying across keyboards to criticize him for being so foolish as to get himself into that position.</p>\n",
    "parent": 0
  },
  {
    "id": 408329,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2018-12-14T11:02:57",
    "content": "<p>Something of a cop out it is not the season there is no season down there consider Nereida and Jeanne Socrates  battling it out through the southern oceans you can take on the Horn at any time of year, I suppose Mark thought I have made it to my home port a good time to call it a day.</p>\n<p>Great pity but if the heart is not in it better to give quit.</p>\n",
    "parent": 0
  }
]