[
  {
    "id": 414927,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-06-22T13:04:55",
    "content": "<p>The US Forest Service has been blowing up large animals (but not as big as whales) this for years.  The linked document shows they use lots of explosives, much more per unit mass than was attempted with the whales.</p>\n<p><a href=\"https://lemurking.files.wordpress.com/2009/05/obliterating-animals-with-explosives.pdf\" rel=\"nofollow ugc\">https://lemurking.files.wordpress.com/2009/05/obliterating-animals-with-explosives.pdf</a></p>\n",
    "parent": 0
  },
  {
    "id": 414926,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-06-22T08:32:21",
    "content": "<p>I am surprised they didnt call on the Japanese whaling industry and have them come out and carve up the whale.</p>\n",
    "parent": 0
  },
  {
    "id": 414922,
    "author": "R",
    "authorUrl": "",
    "date": "2020-06-21T18:43:44",
    "content": "<p>The exploding whale was one of the videos in a pre-streaming video era that one only saw if they had a cool teacher that somehow had a film of it squirreled away. There was a good reason to show video of the Tacoma Narrows Bridge collapsing in physics class, exploding whale was the scholastic equivalent of &#8220;hold my beer and watch this&#8221;.</p>\n<p>I have friends that were part of an effort to remove a dead whale from a Seattle area beach in reactant times so the skeleton could be preserved for display.  It was quite a process, the West Seattle Blog has a relatively <a href=\"https://westseattleblog.com/2012/02/next-chapter-in-the-arroyos-whales-tale-after-almost-2-years/\" rel=\"nofollow ugc\">comprehensive story on the process. </a></p>\n",
    "parent": 0
  },
  {
    "id": 414921,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-06-21T16:33:11",
    "content": "<p>This brings back a whole pile of memories. In the 60s we had a whale wash up on our local beach in Scotland and the army blew it up spreading the dead whale over a square kilometre of land with the smell lasting for weeks.</p>\n<p>Those who ignore the lessons of the past are destined to repeat them.</p>\n",
    "parent": 0
  }
]