[
  {
    "id": 412182,
    "author": "Bruce White",
    "authorUrl": "",
    "date": "2019-09-16T19:46:14",
    "content": "<p>I don&#8217;t understand Mr. Bostrom&#8217;s assertion that &#8221; diligent watch-keeping is unlikely&#8221;. Standing the watch is a time-honored task that should be approached always with &#8220;diligence,&#8221; especially on the water and especially with the public in your charge. The whole thing is tragic,  but there is no substitute for an alert sentry, if that, indeed, figured into the equation.</p>\n",
    "parent": 0
  },
  {
    "id": 412180,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-09-16T14:08:05",
    "content": "<p>At first glance the two situations seem quite different; <i>Conception</i> had a ridiculously implausible emergency exit arrangement while egress for <i>Delta Queen</i> passengers is provided on an almost individual basis. But after the exit, whither to? A dark Mississippi at night, maybe in a PFD? </p>\n<p>It seems individual odds of survival on the steam boat would be better but I suppose the total fatalities in a worst-case scenario could still easily exceed those on the dive boat.  </p>\n<p>As a practical matter, diligent watch-keeping might allow the <i>Delta Queen</i> to safely support 150 sleepers. Unfortunately human nature makes that unlikely (actually impossible as a matter of reality), as we&#8217;ve seen time and again&#8211; sadly very recently on  <i>Conception</i>.</p>\n",
    "parent": 0
  },
  {
    "id": 412179,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-09-15T19:13:36",
    "content": "<p>The problem with charging the electronic devices is that they need a flame proof area so they dont ignite the surrounding wood.  </p>\n<p>The delta queen has true cabins that dont require passengers to climb out of a tiny hatch.  As long as the delta queen has sprinklers for fire suppression, there shouldnt be an issue.</p>\n",
    "parent": 0
  },
  {
    "id": 412178,
    "author": "Ginny Jones",
    "authorUrl": "",
    "date": "2019-09-15T18:57:04",
    "content": "<p>Did the CONCEPTION have any lithium ion batteries on board &#8212; either in the engine room or as part of the outfitting, or perhaps in a passenger&#8217;s baggage?</p>\n",
    "parent": 0
  }
]