[
  {
    "id": 410345,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-04-29T13:41:50",
    "content": "<p>A &#8220;vessel,&#8221; containing and protecting souls on board. A mother and perhaps more than metaphorically. </p>\n<p>Sure, &#8220;she&#8221; is old-fashioned and somewhat superstitious but anybody who has been protected by a boat in challenging conditions gets it. Scum who&#8217;d vandalize a museum for any reason likely cannot as an axiomatic condition.</p>\n",
    "parent": 0
  },
  {
    "id": 410337,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2019-04-28T17:10:04",
    "content": "<p>I have over the years kept away from this argument that is until now. A ship is she just as is my Vincent motorcycle or my cousins steam engines. Of course she is the right term have you ever heard the helm saying come on IT, of course not its  &#8211; `come on old girl come round&#8217; &#8211; in my world of sailing ships and sea shanties the references are always to SHE for she has a fine run abaft and a pointed bow, she has topsl`s and at the very least a fine turn of the bilge, you always sail in not on  a ship just as man is born of womankind. There are words I could use to describe the somewhat ridiculous PC crowd but they are unprintable here.</p>\n<p>Victor Hugo wrote s fine poem often used for our dear departed ladies one of the lines refers to a lady as a ship that passed.</p>\n<p>`you see her topsails pass over the horizon do not mind her going for here she comes seen by new eyes as she goes on her way&#8217;</p>\n",
    "parent": 0
  },
  {
    "id": 410328,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-04-27T15:24:25",
    "content": "<p>As for ship gender?<br />\nThat depends on how much trouble or problems you have during your voyage!<br />\nSome may say it was a &#8220;heck&#8221; of a trip and the ship was a real Bi___ to handle during the voyage</p>\n",
    "parent": 0
  },
  {
    "id": 410327,
    "author": "Richard W. JACKS",
    "authorUrl": "",
    "date": "2019-04-27T14:09:36",
    "content": "<p>How could a powerful tugboat named THOR be anything but a masculine &#8220;HE&#8221; or a beautiful Clipper Ship named SEA WITCH be anything but a feminine &#8220;SHE&#8221; ? To call either &#8220;IT&#8221; is disheartening. Political correctness needs common sense limits.</p>\n",
    "parent": 0
  },
  {
    "id": 410326,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-04-27T13:49:28",
    "content": "<p>From what I have observed it depends on the owner.  If the owner is male, the boat / vehicle takes  on a female persona and vise a versa.</p>\n<p>As the locals to the museum stated, it was done in history and should not be changed for history.  Yet I have met people whom have it in their noggin that no matter what is said, because it wasnt gender neutral, everyone is wrong.  This day and age we can only try to do what we have been told is right.  Yet as the song Garden Party by Rick Nelson so eloquently points out.</p>\n<p>&#8220;But it&#8217;s all right now, I learned my lesson well.<br />\nYou see, ya can&#8217;t please everyone, so ya got to please yourself&#8221;</p>\n<p>Still true after all these years</p>\n",
    "parent": 0
  },
  {
    "id": 410325,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2019-04-27T13:07:08",
    "content": "<p>From Robert Lawrence ex Royal Navy:<br />\nWhy is a ship a &#8220;she&#8221;? We always call a ship a &#8220;she&#8221; and not without a reason.<br />\nFor she displays a well-shaped knee regardless of the season.<br />\nShe scorns the man whose heart is faint and doesn&#8217;t show him pity.<br />\nAnd like a girl she needs the paint to keep her looking pretty.<br />\nFor love she&#8217;ll brace the ocean vast, be she a gig or cruiser.<br />\nBut if you fail to tie her fast you&#8217;re almost sure to lose her.<br />\nOn ships and dames we pin our hopes, we fondle them and dandle them.<br />\nAnd every man must know his ropes or else he cannot handle them.<br />\nBe firm with her and she&#8217;ll behave when skies are dark above you.<br />\nAnd let her take a water wave &#8211; praise her, and she&#8217;ll love you.<br />\nThat&#8217;s why a ship must have a mate; she needs a good provider.<br />\nA good strong arm to keep her straight, to comfort her and guide her.<br />\nFor such she&#8217;ll brace the roughest gales and angry seas that crowd her.<br />\nAnd in a brand new suit of sails no dame looks any prouder.<br />\nThe ship is like a dame in that she&#8217;s feminine and swanky;<br />\nYou&#8217;ll find the one that&#8217;s broad and fat is never mean and cranky.<br />\nYes ships are ladylike indeed, for take them altogether<br />\nthe ones that show a lot of speed can&#8217;t stand the roughest weather.</p>\n",
    "parent": 0
  }
]