[
  {
    "id": 427101,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-05-02T08:23:48",
    "content": "<p>Thanks for your comments and perspective.</p>\n",
    "parent": 427096
  },
  {
    "id": 427096,
    "author": "Kieran Hosty",
    "authorUrl": "http://www.sea.museum",
    "date": "2022-05-01T21:13:15",
    "content": "<p>As one of the Australian archaeologists involved in the hunt for &#8216;Lord Sandwich&#8217; ex HMB &#8216;Endeavour&#8217; I would like to add a little bit more additional information to the story. The Australian National Maritime Museum has been actively involved in the search in Newport, RI since 1999, have sent diving archaeologists and underwater conservators across on least 8 occasions, have conducted hundreds of dives on the 1778 transports sites and have contributed financially to that search paying for boats, crew and diving equipment. When COVID hit and travel between Australia and the United States was restricted the museum also contracted two American underwater archaeologists to continue the work with Dr Abbass and RIMAP. There was no need for us to conduct &#8216;remote sensing from Australia&#8217; as we have been on the ground in Newport for a long time and have seen those sites first hand. Whilst we commend the work of Dr Abbass and RIMAP we respectfully disagree with her comment that our findings were &#8216;premature&#8217;. Further information on our work in Newport, RI can be found at <a href=\"http://www.sea.museum/explore/maritime-archaeology/deep-dive\" rel=\"nofollow ugc\">http://www.sea.museum/explore/maritime-archaeology/deep-dive</a> and the report of our findings at <a href=\"http://www.sea.museum/about/corporate-information/planning-and-reporting/research\" rel=\"nofollow ugc\">http://www.sea.museum/about/corporate-information/planning-and-reporting/research</a></p>\n",
    "parent": 0
  },
  {
    "id": 427032,
    "author": "Richard Bailey",
    "authorUrl": "",
    "date": "2022-04-28T22:04:07",
    "content": "<p>Yeah, that&#8217;s some kind of remote sensing from Australia. I stand with Dr. Abbass, she&#8217;s been on this project for decades and not looking for headlines, or clicks, or kudos. When (if) she says it&#8217;s Endeavour, I&#8217;ll believe her.</p>\n",
    "parent": 0
  }
]