[
  {
    "id": 408824,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-01-08T16:53:55",
    "content": "<p>Thank you, Kate. Good and well-informed comment.</p>\n<p>I just wanted to add a couple of points. Fires on container ships are easy to start and terribly hard to fight. Of the thousands of boxes onboard, chances that are that sooner or later hazardous cargo will be mislabeled, or dangerous cargo will be improperly stored in one box. Once any fire gets started you can put it out by denying it oxygen, heat, or fuel. When the fire is inside a ventilated steel box you can&#8217;t flood it with CO2 to deny the fire oxygen. You can&#8217;t cool it with water because the steel container retains the heat, and you can&#8217;t get to whatever is burning because it is inside the box. As long as the fire is burning heat from one box can ignite adjacent containers above below, fore and aft and port to starboard. There is not a lot the crew can do from deck. The best bet is for a fire fighting tug to try to cool the fire to keep it from spreading and hope that it burns itself out. Sometimes that works and sometimes it doesn&#8217;t. Here is a post about a burning containership from a few years back.  </p>\n<p><a href=\"http://www.oldsaltblog.com/2012/07/extinguishing-the-fire-on-msc-flaminia-may-take-weeks/\" rel=\"nofollow ugc\">http://www.oldsaltblog.com/2012/07/extinguishing-the-fire-on-msc-flaminia-may-take-weeks/</a></p>\n",
    "parent": 408806
  },
  {
    "id": 408806,
    "author": "Kate",
    "authorUrl": "",
    "date": "2019-01-07T14:43:33",
    "content": "<p>Yes,Willy your comment is rather fishy. Containers are loaded on ships depending on where they will be unloaded, weight and content. There have been more incidents/fires with batteries and charcoal self igniting. Since the containers are sitting on and very close next to each other the heat can cause the contents of surrounding containers to ignite before there is significant smoke from the original source. Most newer ships also have heat sensors along with cameras. The crews are constantly checking to make sure the tie-downs haven&#8217;t loosened and visually checking but it is an enormous task despite what you seem to think. Seaman have firefighting training but are not professionals who can easily deal with possible chemical fires. Different fueled fires may require non-water extinguishers. To carry enough different extinguisher materials on a ship would take up more space than the cargo. If the fire is below in the hold, there may be toxic fumes and contrary to what you might think it isn&#8217;t worth the lives of the crew. If those who ship their goods were honest at properly packing and declaring what they were shipping it would make it less dangerous. But they tend not to be honest as it cuts profit. </p>\n<p>Part of the crew was taken off when it was safe to do so. They aren&#8217;t in port. They are at sea where it is very dangerous for two ships of any size to get close. The engines need to be watched constantly even with computerization. If there may be a chance of flammable chemicals or fumes in the hold, they may have shut down the engines so there is no chance of explosions that would put a hole in the ship under the water line. You must have watched a you tuber who was showing a bit of the easy working on a shipping vessel video. I&#8217;m too lazy today to track down some of the mariner sites that go into detail about hazards on shipping vessels and ships engines in general but they are out there. Someone even posted a flash fire in the engine room as seen from the engine control room behind glass. (It was auto extinguished in less than a minute. No one was in the engine space. The auto extinguishers for engines remove breathable air.)</p>\n",
    "parent": 0
  },
  {
    "id": 408804,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-07T10:39:13",
    "content": "<p>Rather fishy to me.  Steel doesnt burn.  Yet a boat load of containers catch on fire and the fire spreads?</p>\n<p>Only thing I could speculate is.  An upper container carried a liquid.  That liquid seeped.  Yet using this scenario?  It would have flowed downward and then sideways once it reached the floor.</p>\n<p>There is a youtuber that shows what life is like on a megaship.  In it he claims there are regular drills to fight fires.  As well as regular visual inspections of cargo.</p>\n<p>The only way to have a fire that is large enough to have the ship personel want to vacate the ship?  Is to have ignored the inspections, let the fire get big enough that the crew in the wheel house to see it and say oh well.</p>\n<p>Just my opinion and I realize it stinks.</p>\n",
    "parent": 0
  },
  {
    "id": 408801,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2019-01-07T07:32:09",
    "content": "<p>Seems to me that crews jump ship the instant something goes wrong.  Assuming (I know bad word) the fire was on the container deck, they presumably still had power.  Drive the danged thing as far as you can.  It has to be faster than being towed.  With a tug alongside you can always get off.</p>\n<p>I know that is easy to say sitting in my comfortable office chair and I am sure there are a boatload of union rules concerning crew safety, however more and more of these incidents seem to have no crew response other than leaving the ship at the first chance they get.</p>\n",
    "parent": 0
  },
  {
    "id": 408794,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-06T17:15:03",
    "content": "<p>So many boxes&#8230; which one is Pandora&#8217;s?</p>\n",
    "parent": 0
  }
]