[
  {
    "id": 435648,
    "author": "GW",
    "authorUrl": "",
    "date": "2023-06-13T14:38:19",
    "content": "<p>Unless it was moved, it looks like the incident occurred during the side-transfer of the vessel, before it got to the lift.</p>\n",
    "parent": 0
  },
  {
    "id": 435475,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2023-05-25T14:47:52",
    "content": "<p>Regarding Robert Kennedy links; these are PR statements and while having a place in the organization&#8217;s operation do not address the issue.<br />\nThe safety of a ships crew depends on many things and stability is a very important one of those.  It is essential that the ships officers understand and put into daily practice the calculations necessary to maintain it.  Drydocking stability is one of the more risky operations due to the changes that occur, virtually in an instant, as the vessel goes from blocks to water or the reverse.<br />\nBased on my 50 years of seagoing experience and having done this numerous times in shipyards worldwide it does not appear to me that this was done in this case.</p>\n<p>Best wishes to the recovering crew member and </p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 435466,
    "author": "Robert Kennedy",
    "authorUrl": "",
    "date": "2023-05-24T09:54:16",
    "content": "<p><a href=\"https://www.barkeuropa.com/logbook/detail/update-from-the-ship?fbclid=IwAR2hgEvMBYQXpF4WNTrwNIYMtugFYR7xXx7lb0tKWAQEVYh7MhBjqcBzyUY\" rel=\"nofollow ugc\">https://www.barkeuropa.com/logbook/detail/update-from-the-ship?fbclid=IwAR2hgEvMBYQXpF4WNTrwNIYMtugFYR7xXx7lb0tKWAQEVYh7MhBjqcBzyUY</a></p>\n",
    "parent": 0
  },
  {
    "id": 435449,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2023-05-22T09:06:45",
    "content": "<p>Further to my comment.  The added weight of masts and rigging caused considerable leverage.  This no doubt added to the incident.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 435448,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2023-05-22T09:01:30",
    "content": "<p>There have been several incidents of similar accidents in recent months. Perhaps the knowledge and practice of drydocking stability is not being understood and practiced in some shipyards.<br />\nI remember, some 60 years ago now, that one of the questions of the Stability exam. when sitting my British Master F.G. was on this very subject.<br />\nWhen a ship is drydocked her support has to be transferred from water to keel blocks. As soon as she touches the keel blocks she loses displacement and a weight equal to this lost displacement is transferred to the blocks.  Again when flooding the drydock to refloat her the reverse occurs.  If the vessel&#8217;s ballasting is not correctly calculated things can go wrong quite quickly.  This appears to have happen in these cases.</p>\n",
    "parent": 0
  }
]