[
  {
    "id": 413469,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-02-07T12:36:59",
    "content": "<p>We can agree that the number of rescues was closer to 70 than 300. In the original post, I wrote that &#8220;she is said to have&#8221; made the rescues, which is accurate. No doubt the number has grown in the telling.</p>\n<p>We may disagree on her role in the raid. Contemporary documents describe Tubman as the &#8220;black woman who led the raid and under whose inspiration it was originated and conducted.&#8221; See the <a href=\"http://libertyletters.com/resources/civil-war/campaign-on-combahee.php\" target=\"_blank\" rel=\"noopener noreferrer nofollow ugc\">Commonwealth, Vol 1, No. 45, (Boston, Massachusetts), July 10, 1863.  </a></p>\n",
    "parent": 413468
  },
  {
    "id": 413468,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2020-02-07T12:27:51",
    "content": "<p>You&#8217;re right, I should clarify my comment.  The raid absolutely happened.<br />\nTubman&#8217;s participation is overblown. She provided useful Intelligence that<br />\nenabled the gunboats to bypass Confedrate mines in the river.</p>\n<p>As to standing in the bows, singing songs of freedom and glory, well, no.<br />\nParticipants in the raid failed to note Tubman&#8217;s presence among them.</p>\n<p>There&#8217;s no doubt she made at least eleven trips to lead her people North,<br />\nand it&#8217;s known that most of them were family or kin folk.  Altogether they<br />\nnumber about 70 people.  She did work among the negro refugees and<br />\nsoldiers, did organize a Home for Elderly black folks, and generally was<br />\na thoroughly worthy individual.  </p>\n<p>Her doings were worthy enough. It&#8217;s not necessary to make stuff up to enhance her memory.   She did enough in her own time to earn her place.</p>\n",
    "parent": 0
  },
  {
    "id": 413466,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-02-07T11:28:04",
    "content": "<p>One can quibble over the number of rescues, but the events of the Great Combahee Ferry Raid are well documented. No fairy tale.</p>\n",
    "parent": 413465
  },
  {
    "id": 413465,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2020-02-07T11:21:58",
    "content": "<p>Unfortunately, it&#8217;s not true.</p>\n<p>Tubman was quite the gal, but her story has become a fairy tale.  Her &#8216;rescues&#8217; total about 70 people; and her part in the Combahee raid is<br />\nfictional.  Her &#8216;afterlife&#8217; is remarkable and worthy of all praise, but falsifying<br />\nher story belittles the true greatness of the woman.</p>\n<p>She was heroine enough without all the frippery.</p>\n",
    "parent": 0
  },
  {
    "id": 413464,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2020-02-07T10:56:44",
    "content": "<p>It&#8217;s good to remember this.</p>\n",
    "parent": 0
  }
]