[
  {
    "id": 411680,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-07-30T16:48:36",
    "content": "<p>Tannoy were/are much respected makers of Hi-fi speakers, mine are 16&#8243; diameter. They are also known for fog horns around the coast of Britain and on light-ships.<br />\nAs both of these item lines are obsolete I suppose that PA systems were a natural path for their field of excellence.<br />\nWe also call vacuum cleaners Hoovers in the UK and there are probably other appliances where the manufacturer&#8217;s name has become a generic term for the product but as I have just been tasting the bottle of Talisker Skye single malt that my son bought me for my Birthday my brain is a tad fuzzy.</p>\n",
    "parent": 0
  },
  {
    "id": 411679,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-07-30T16:36:35",
    "content": "<p>You can take the girl out of Essex but you can&#8217;t take Essex out of the girl 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 411678,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-07-30T14:59:52",
    "content": "<p>Why name the manufacturer by name?<br />\n&#8220;Tannoy Ltd is a British manufacturer of loudspeakers and public-address (PA) systems. &#8221;</p>\n<p>A clown costume is not &#8220;fancy dress&#8221;!</p>\n<p>When I&#8217;m out for drinks, I go home before dark, not at 2am starting or getting into fights!</p>\n",
    "parent": 0
  },
  {
    "id": 411675,
    "author": "Kate McGufffin",
    "authorUrl": "",
    "date": "2019-07-30T13:22:23",
    "content": "<p>My, my. Thanks for the update. In the US &#8220;fancy dress&#8221; means formal or black tie. But in the UK it means costume party dress. I have occasionally thought about taking a cruise because the ship or route was interesting. But I&#8217;m over 60 and crutch-bound, it&#8217;s not going to be so much fun. I don&#8217;t have the patience to be around people who feel entitled, they&#8217;ve paid money to do what they want and throw a fit when things don&#8217;t go their way. Like those who sue because weather interferes with vacation plans. As large as the floating apartment block ships are it is still too small an area for the type of people it draws. Wonder if non-anglo passenger lines have the same issues.</p>\n",
    "parent": 0
  },
  {
    "id": 411673,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner.",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG%20no%20longer%20published",
    "date": "2019-07-30T10:49:04",
    "content": "<p>Rick after all my years in cruise ships I am amazed at this level of violence.  We of course had far less people aboard and perhaps this is a reason so many people so packed together fueled by alcohol.  They now build these vessels as floating resorts Disney and other parks are finding that their level of aggressive behavior is also rising. One can always find something to blame things on such as &#8220;The Donald&#8221; and now &#8220;The Boris&#8221; but it is a general problem in current society.  Perhaps education levels against monies available to people to do things is were the trouble lies. Glad I am retired !!</p>\n<p>Good Watch</p>\n",
    "parent": 0
  }
]