[
  {
    "id": 423741,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-10-23T13:08:40",
    "content": "<p>I bet the flags officer was confused &#8220;Skipper, do you want code D or F or Y?&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 423738,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-10-23T10:17:20",
    "content": "<p>Thanks to all for the updates and clarifications.</p>\n",
    "parent": 0
  },
  {
    "id": 423736,
    "author": "JJR",
    "authorUrl": "",
    "date": "2021-10-23T08:18:17",
    "content": "<p><a href=\"https://today.in-24.com/News/478743.html\" rel=\"nofollow ugc\">https://today.in-24.com/News/478743.html</a><br />\n&#8220;Danilo Espinoza, captain of the Port of Guayaquil, explained that the Brazilian Navy ship had planned to set sail from Guayaquil at 12:30 on Monday 18 to Cartagena de Indias, Colombia, and it was planned to pass through the bascule bridge at 13:00.<br />\nHowever, he said, at the time of sailing the sailboat had several problems. He indicated that there was supposedly a failure in the control of the machines and he had a first accident with a boat that was docked a few meters away.<br />\n“After this incident, the sailboat anchored but its anchor grabbed, heading towards the pedestrian bridge with Santay Island. In this, they managed to control the maneuver; It is presumed that the failure in the machine control was overcome. They restarted the maneuver and, before going through the pedestrian bridge, they had another failure and collided with the bridge, ”said Espinoza.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 423735,
    "author": "JJR",
    "authorUrl": "",
    "date": "2021-10-23T08:02:01",
    "content": "<p>According to Guayaquil Harbour Headmaster s/v &#8220;Cisne Branco&#8221; had problems with engine during unmooring, resulting collision with another vessel &#8211; aprox. 1 hour before collision with pedestrian brigde.<br />\nAfter this first collision she dropped an anchor, about 1/2h kater reported to solve problems and resumed voyage towards open brigde. Then she lost engine controll again&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 423730,
    "author": "Adolfo Briceno",
    "authorUrl": "",
    "date": "2021-10-22T14:31:42",
    "content": "<p>Sorry Rick for calling you Rich. My bad 🙁</p>\n",
    "parent": 0
  },
  {
    "id": 423729,
    "author": "Adolfo Briceno",
    "authorUrl": "",
    "date": "2021-10-22T14:29:25",
    "content": "<p>Hi Rich. Thanks for this article, however I would not necessarily subscribe to the theory that the Cisne Branco was being towed. The most likely scenario is that the training Brazilian ship was about to cross the pedestrian drawbridge, but had sudden engine failure. The small tugboat was there to assist provided the engine of the Cisne Branco was in full working condition, which apparently it wasn’t the case. The following video shows the ship coming downriver towards the drawbridge opening with no signs that the propeller was working.<br />\nAt one point during the incident the portside anchor was dropped but the ship was already too close to the bridge do any good.<br />\n<a href=\"https://www.instagram.com/p/CVLugOtIWqA/?utm_source=ig_embed&#038;utm_campaign=embed_video_watch_again\" rel=\"nofollow ugc\">https://www.instagram.com/p/CVLugOtIWqA/?utm_source=ig_embed&#038;utm_campaign=embed_video_watch_again</a></p>\n",
    "parent": 0
  },
  {
    "id": 423690,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-10-20T18:12:54",
    "content": "<p>The bridge was opened for the tall ship.  Unfortunately the tugs appear to have released her prior to the spot scene further beyond</p>\n",
    "parent": 0
  },
  {
    "id": 423689,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2021-10-20T15:49:11",
    "content": "<p>just another episode in a litany of poor seamanship no more to be said.</p>\n",
    "parent": 0
  },
  {
    "id": 423682,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-10-20T07:27:20",
    "content": "<p>should have radiod ahead &#8220;open the bridge urgent&#8221;</p>\n",
    "parent": 0
  }
]