[
  {
    "id": 410228,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-04-15T08:02:52",
    "content": "<p>Yes the youtube vid from the Discovery channel did come to the same conclusion.  That the boswains hatch had been removed even tho it had ropes to tie the wing nuts in place.  The rope was still evident on the ships hull.  Tho the teaser (top post) explained that because of the length of the ship and lack of water detectors in the forward hold.  The ship was going down once the first hatchway imploded.  It only took two minutes to go under after the first hatch imploded.</p>\n<p>It was supposed that if they had known the front hold was taking on water, they may have tried to abandon ship earlier and possibly survived.</p>\n",
    "parent": 0
  },
  {
    "id": 410219,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-04-13T09:03:55",
    "content": "<p>The sinking of the Derbyshire has been the subject of more than a few documentaries. The most recent has the benefit of having the most complete set of facts. The final official report from the investigation only came out in 2005, 25 years after the sinking. If I am not mistaken, the video you link to came out the year before the final report was issued.  </p>\n<p>I would love to see the entire older video. Even though it is one hour and 16 minutes long on Youtube, it is missing the end of the documentary so we don&#8217;t get to the conclusions.  It would be interesting to see if they concur with the official report blaming flooding of forward spaces or side more with Douglas Faulkner who argued that the cover design was inadequate.</p>\n",
    "parent": 0
  },
  {
    "id": 410212,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-04-12T19:51:37",
    "content": "<p>Apparently the sinking of the Derbyshire had been visted before by a different group,  The graphics and animations arent there.  Yet the reasons of why are similar.  The vid above being a teaser at 2:24 in length.</p>\n<p>The vid below is made of 10-15 years prior by the series called &#8220;Disaster at Sea&#8221;  one hour fifteen long.  Also to be seen on youtube.<br />\n<a href=\"https://www.youtube.com/watch?v=I0sLo4CCXps\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=I0sLo4CCXps</a></p>\n",
    "parent": 0
  },
  {
    "id": 410209,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-04-12T17:04:08",
    "content": "<p>A youtube blip on the accident<br />\n<a href=\"https://www.youtube.com/watch?v=7P-a3OP6laQ\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=7P-a3OP6laQ</a></p>\n",
    "parent": 0
  }
]