[
  {
    "id": 434985,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2023-04-02T10:45:44",
    "content": "<p>Further to my comment yesterday I have learned that Tokitae was captured in Icelandic waters and that her mom is still alive in those waters.  If this is actually the case one supposes there is a chance she may reform the contact and survive.<br />\nAs to the other comment I was not able to confirm or deny the rotten fish.<br />\nI think it is doubtful that such a mammal so valuable to aquariums would be treated this way ; sadly however it is all too possible.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 434976,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2023-04-01T15:16:30",
    "content": "<p>The Orcas at the many zoos were taken from different parts of the world with very different methods and habits of communication, hunting and tolerance. They are as diverse as loud communicators to a silent breed that hunts off the Eastern Seaboard.</p>\n<p>They were put together to make money at the expense of their wellbeing and shows put on fired up the crowds as if the aquariums were saviours rather than the bullies that they really were. Feeding rotten fish to the Orcas sums up their owner&#8217;s attitudes. They should hang their heads in shame for the only reason they shall be released is to reduce their costs as their once moneymakers head for certain and swift deaths.</p>\n",
    "parent": 0
  },
  {
    "id": 434974,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2023-04-01T10:58:35",
    "content": "<p>First let me say I do not have training in marine science.  However in the 1960&#8217;s I spent three years living in British Columbia.  During that time I worked piloting tugs tows, and local cruise ships along the Inside Passage.<br />\nIn addition I served one year in the newly formed Canadian Coastguard dealing with buoys, supplying lighthouses and as a Watchofficer on the Western Arctic Patrol 1967.<br />\nDuring this time I learned quite a bit about the Region&#8217;s marine life from local scientists.  From this it was my understanding that the captured Orcas would not survive if returned to the regions waters.  The other Orcas would reject them, and attack them when feeding.  So it seems to me ill advised to try and return them.  Finally I am now retired in the Miami area and have visited Lolita/Tokitae many times with my children and grandchildren.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  }
]