[
  {
    "id": 420478,
    "author": "Sam Johnson",
    "authorUrl": "",
    "date": "2021-04-07T14:51:03",
    "content": "<p>Is he a candidate for the treasure on Oak Island?</p>\n",
    "parent": 0
  },
  {
    "id": 420466,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-04-06T15:43:28",
    "content": "<p>If Every did survive to retire and changed his name you would think that there would be records of a person whom was suddenly spending lots of money, buying property and all the other things that the nouveau riche get up to. And was there no record of the trove?<br />\nLet your imagination run free and you have a subject for a new novel.</p>\n",
    "parent": 0
  },
  {
    "id": 420465,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-04-06T10:33:33",
    "content": "<p>Agreed.  Coins do not mean the pirates were there.  Only that some hapless soul wasnt very diligent with how they carried there money.</p>\n<p>While it is a interesting read (thankyou).</p>\n",
    "parent": 0
  },
  {
    "id": 420439,
    "author": "Andy Hall",
    "authorUrl": "",
    "date": "2021-04-05T12:35:27",
    "content": "<p>Connecting the 1693 Yemeni coin to Every&#8217;s capture of GANJ-I-SAWAI (or &#8220;GUNSWAYS,&#8221; as it became Anglicized) seems a bit tenuous to me. Even if we stipulate that that is its origin, it doesn&#8217;t really answer many questions. But. . . .</p>\n<p>THIS is the critical new bit, buried deep int he article:</p>\n<p>&#8220;Obscure records show a ship called the SEA FLOWER, used by the pirates after they ditched the Fancy, sailed along the Eastern seaboard.&#8221;</p>\n<p>If SEAFLOWER really did stop along the eastern seaboard of North America, that is news, because most accounts have her sailing directly from Nassau to Ireland, where Every and his men landed and dispersed. I&#8217;m very interested to know what records place SEA FLOWER on the East Coast, because that&#8217;s far more important, as a matter of the historical record, than a coin that may or may not have come from that hoard.</p>\n",
    "parent": 0
  }
]