[
  {
    "id": 425250,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-06T01:28:33",
    "content": "<p>And&#8230; crickets. The usual. Emotionally spray some adjectives. <i>All</i> emotions, <i>no</i> thinking.</p>\n<p>We don&#8217;t have to be ruled by fear. Failing to engage with facts because we&#8217;re scared of their implications and would rather not deal with reality is to be ruled by fear.</p>\n",
    "parent": 0
  },
  {
    "id": 425233,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-04T23:12:26",
    "content": "<p>Waiting for specific information (with literature cites) demonstrating how CDC advice is in error. </p>\n<p>Specifically, not just adjectives alone.</p>\n",
    "parent": 0
  },
  {
    "id": 425217,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2022-01-04T17:32:43",
    "content": "<p>The reality is we need to avoid an inept and incredible CDC.</p>\n",
    "parent": 0
  },
  {
    "id": 425215,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-04T16:38:09",
    "content": "<p>I&#8217;ll add that the above facts regarding Covid and cruising don&#8217;t address the problem of the results of having to deprive crew of work. That&#8217;s a <i>different</i> problem, a problem that <i>is</i> substantially political in nature. </p>\n<p>Pretending that the first problem doesn&#8217;t exist is a way to avoid confronting the second problem. This denial is a natural recourse when politicians fail us, and quite understandable. It&#8217;s also exactly what politicians seeking to avoid problem solving would like us to do, a mistake on our part preferred by politicians.</p>\n",
    "parent": 0
  },
  {
    "id": 425214,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-04T16:30:22",
    "content": "<p>Actually there&#8217;s extensive research in the medical science department regarding cruise ships. </p>\n<p>CDC&#8217;s role is to distill this information into practical application. Here the distillation leads to &#8220;this is not controllable by practical means and best avoided.&#8221;</p>\n<p>Here are some peer-reviewed scientific publications on the topic. </p>\n<p><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/pmc7739985/\" rel=\"nofollow ugc\">Initial investigation of transmission of COVID-19 among crew members during quarantine of a cruise ship—Yokohama, Japan, February 2020</a></p>\n<p><a href=\"https://academic.oup.com/jtm/article/27/3/taaa030/5766334\" rel=\"nofollow ugc\">COVID-19 outbreak on the Diamond Princess cruise ship: estimating the epidemic potential and effectiveness of public health countermeasures</a></p>\n<p><a>Mechanistic transmission modeling of COVID-19 on the Diamond Princess cruise ship demonstrates the importance of aerosol transmission</a></p>\n<p><a href=\"https://www.jmir.org/2020/5/e19540\" rel=\"nofollow ugc\">Containing COVID-19 among 627,386 persons in contact with the Diamond Princess cruise ship passengers who disembarked in Taiwan: big data analytics</a></p>\n<p>(It&#8217;s the &#8220;675,000 persons in contact&#8221; that CDC is taking into consideration, in part. The cruise isn&#8217;t over at disembarkation.)</p>\n<p><a href=\"https://academic.oup.com/jtm/advance-article-pdf/doi/10.1093/jtm/taaa038/33226379/taaa038.pdf\" rel=\"nofollow ugc\">High population densities catalyse the spread of COVID-19</a></p>\n<p>Etc. Simply use Google Scholar to learn more than you can here.There are thousands of articles on this topic published by medical researchers. CDC isn&#8217;t going to ignore this information. Much of what we needed to learn about this came from <i>Diamond Princess</i>, nearly two years ago. It&#8217;s not new information, or a mystery. Cramming people together shipboard in the presence of a highly transmissible virus with a fairly high proportion of serious outcomes is a foolish choice.</p>\n",
    "parent": 0
  },
  {
    "id": 425207,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2022-01-04T10:52:03",
    "content": "<p>This is a purely U. S. political decision not based on medical science.  If these vessels were under the U.S. flag the U. S. Maritime Unions would no doubt prevent such a decision.</p>\n",
    "parent": 0
  }
]