[
  {
    "id": 412887,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-11-27T08:29:41",
    "content": "<p>Another clipper ship that isn&#8217;t floating <a href=\"https://www.youtube.com/watch?v=xqmkY_qiAC4\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=xqmkY_qiAC4</a><br />\nthe Seute Deern at Bremerhaven.</p>\n",
    "parent": 0
  },
  {
    "id": 412846,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2019-11-23T19:05:30",
    "content": "<p>You are quite correct when she was restored nothing was caulked below the level of the glass roof, no sacrificial felt was placed behind the new coppering, a large iron keel was the base on which she was to sit when raised above the dock bottom, the old door cut into her side when first turned into a visitor attraction has not been properly reinstated it is still possible to see where it was owing to the short planks inserted also the hull was poorly finished given that the vessel was built for speed it should be smooth. The rig however is pretty OK. Right now my friend and noted woodcarver Andy Peters has been commissioned to carve a new figurehead for the ship when Andy got access to the Linton drawings he found that the figure kept aboard the ship could not have been the original since he is the authority he will be right, Andy did the Gothenburg and Hermione carvings among others. Most of the work will be done in his Oxfordshire workshop. Fully restored is not a description that should be used when talking about the clipper Cutty Sark.</p>\n",
    "parent": 0
  },
  {
    "id": 412844,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-11-23T09:09:26",
    "content": "<p>Fully restored would imply that she is ready put to sea but this is far from the truth. She can&#8217;t even float because of what the idiots have done to her.</p>\n",
    "parent": 0
  }
]