[
  {
    "id": 409653,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-02-25T19:02:50",
    "content": "<p>Thank you.</p>\n",
    "parent": 0
  },
  {
    "id": 409642,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-02-24T18:45:23",
    "content": "<p>My apologies if I sounded insencere.  In no way did I intend to sound gratifying of the horrific Vegas incident.  I abhore violence.  I was merely trying to say that the notion of using guns as a way to cause mass death is foolish.  Great injury probably, yet to spray alot of ammo doesnt mean anything is achieved.</p>\n",
    "parent": 0
  },
  {
    "id": 409625,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-02-23T17:39:23",
    "content": "<p>As blog host, I have decided to remove one series of comments which was veering wildly off topic and did not meet minimum standards of civility.</p>\n",
    "parent": 0
  },
  {
    "id": 409588,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-02-22T15:49:59",
    "content": "<p>Minimizing the potential damage that a single individual committed to slaughter could have committed strikes me as completely absurd.</p>\n",
    "parent": 0
  },
  {
    "id": 409587,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-02-22T15:48:07",
    "content": "<p>Willy, the Los Vegas shooting killed 59 and wounded 527. It was the deadliest mass shooting ever committed by an individual in the United States. To suggest that &#8220;the Las Vegas incident had about the same amount of ammo and still didn&#8217;t hit that many people&#8221; is offensive.</p>\n",
    "parent": 409573
  },
  {
    "id": 409583,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-02-22T11:15:17",
    "content": "<p>I do wonder if he is maybe suffering a mental illness and his actions were a cry for help rather than a plan of action. After all, he had all the weapons, why didn&#8217;t he use them already.</p>\n",
    "parent": 0
  },
  {
    "id": 409573,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-02-21T21:55:22",
    "content": "<p>Looking at the image I see 5 boxes of ammo that could hold 1000 rounds per box.  Tho the middle box appears to be some form of grenade type projectile and that box may only hold 200 rounds.</p>\n<p>Tho what I think is even more humorous is how ill informed this chap is.  The white population is now the minority.</p>\n<p>Yup good luck in trying to make lethality with all that ammo.  The Las Vegas incident had about the same amount of ammo and still didnt hit that many people.  Even tho he was firing into a crowd.</p>\n<p>I would like to point out that I have no interest in the mans views and have no weapons.  Nor do I ever plan on owning weapons of anysort.  I just see an absurdity in the mans reasoning.</p>\n",
    "parent": 0
  }
]