[
  {
    "id": 407670,
    "author": "Craig Nicholson",
    "authorUrl": "",
    "date": "2018-10-22T16:50:59",
    "content": "<p>When I was the Coast Guard Group Commander for the Hawaiian Islands in the late 80&#8217;s, I frequently called on the the Coast Guard Auxiliary on Molokai for search and rescue since they were the only resource that could reach those in distress in a timely manner.  They did a superb job, and it cost the American taxpayer nothing!  I&#8217;ve been a ham since the 60&#8217;s and a professional communicator since the 70&#8217;s.</p>\n",
    "parent": 0
  },
  {
    "id": 407635,
    "author": "Donald Moore",
    "authorUrl": "",
    "date": "2018-10-20T09:04:18",
    "content": "<p>Serving 7 years active duty in the US Coast Guard, 2 of which 1972-1974 at Coast Guard Captian of the Port Seattle, I became quite familiar with the Coast Guard Auxiliary.<br />\nDuring the summer, Auxiliary members and their vessels would man 7 location through out  Puget Sound responding to assistance calls as directed by CG Station Seattle or by direct contact with the public.<br />\nThey performed there duties admirably protecting life and property, the Coast Guards mission.<br />\nMy Greatest respect and gratitude go out to the Members of the<br />\nUS Coast Guard Auxiliary.</p>\n<p>I received my ticket in 1968 and joined the Coast Guard in 1970 where I became a Radioman.<br />\nDuring my time, I served with crew members that had been stationed aboard the Lilac.</p>\n",
    "parent": 0
  },
  {
    "id": 407626,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-10-19T15:34:29",
    "content": "<p>Got my ham ticket back in the early 70&#8217;s, gave it up this year, just wasn&#8217;t using it.</p>\n",
    "parent": 0
  },
  {
    "id": 407613,
    "author": "Doug Faunt",
    "authorUrl": "",
    "date": "2018-10-18T16:52:21",
    "content": "<p>I trust a sked will be set up with K6KPH, the ham radio call of KPH, the historical station that the Marine Radio Historical Society runs at Pt. Reyes.</p>\n",
    "parent": 0
  }
]