[
  {
    "id": 411276,
    "author": "Captain C. Allport",
    "authorUrl": "",
    "date": "2019-07-11T09:16:54",
    "content": "<p>The business reputation of MSC and subsequent commercial damage, as Jean-Pierre Declemy rightly highlights, should not be underestimated. As someone with more than 20 years experience in ship vetting for an oil major I am very conversant with the need to protect reputation and the commercial impact that can result if this fails. As an example, the announcement by Shell (some years ago) that the Brent Spar north sea platform would be scrapped by dumping in the North Atlantic resulted in a 16% fall in their German revenues alone. Shell were subsequently forced to change direction and arrange scrapping in a Norwegian port.<br />\nBoth MSC and possibly JPMorgan must be squirming?</p>\n",
    "parent": 0
  },
  {
    "id": 411248,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-07-10T14:18:18",
    "content": "<p>I foresee that MSC will likely be hemorrhaging revenue as customers switch to other shippers in case their consignments are held up or impounded in customs and excise searches.</p>\n",
    "parent": 0
  },
  {
    "id": 411247,
    "author": "Frederik deCockBuning",
    "authorUrl": "",
    "date": "2019-07-10T12:39:34",
    "content": "<p>interesting story , i guess this will give more concerns.<br />\nIn my view the operator controlls the cargo / containers<br />\nand thus its contents . the ship is just the carrier. the ships command<br />\nis the only part of the crew which have knowledge of relevant containers<br />\n(numbers and weights) &#8211; maybe one should investigate the link between<br />\nships command and origin loadport instructions</p>\n",
    "parent": 0
  },
  {
    "id": 411238,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-07-10T08:41:10",
    "content": "<p>Captain,  </p>\n<p>Very interesting, Fairplay reported that the ship and charter were sold to JP Morgan at about the same time. I just checked and MSC lists the Gayane in its list of owned ships. (That is either new or I missed it the last time I looked.) If MSC does own and manage the ship, that gives the Feds an easier target. On the other hand, even if the ship is not MSC owned the judge could still rule that MSC was the &#8220;beneficial owner&#8221; for legal purposes and therefore liable.</p>\n",
    "parent": 411237
  },
  {
    "id": 411237,
    "author": "Captain C Allport",
    "authorUrl": "",
    "date": "2019-07-10T08:15:38",
    "content": "<p>Rick,</p>\n<p>In your blog you state that MSC does not own the MSC Gayane.  This may not be the case! According to Equasis data the vessel passed into ownership of MERIDIAN 7 Ltd, C/O MSC in Geneva October 2018 and at the same time MSC became the vessel ShipManager. ISM Management passed to MSC in Naples 09/01/2018. It appears from this information, which is considered by the maritime world to be the most reliable, that the MSC GAYANE is not only owned by but also technically and commercially operated by MSC.  Perhaps this is why the Feds have seized her as a lesson to MSC to control their ships in a more responsible way?</p>\n<p>Chris Allport</p>\n",
    "parent": 0
  },
  {
    "id": 411225,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-07-09T21:32:05",
    "content": "<p>It will be interesting to see how this plays out.  I can see the crew having to serve time for their part in the scheme and the ship remaining until the owners get a new crew.  Tho if the US does seize ownership it will either a crowning moment for the POTUS or a disaster that can haunt him for the rest of his life.  The other head ache to this fiasco is whether the coast guard is going to take a closer look into any other ships run by the same company for continued conspiracy.  Or is the company now changing their practice to no longer lose anymore ships?</p>\n",
    "parent": 0
  }
]