[
  {
    "id": 426418,
    "author": "Mike Scull",
    "authorUrl": "",
    "date": "2022-03-23T03:05:48",
    "content": "<p>Wow, hard to imagine how the Ever Forward found itself in such shallow water. With these larger vessels, with limited sight lines, human error is greatly magnified, and a simple misinterpreted rudder command can quickly put a ship out of position, with no chance of correction. As it would be a great expense to further widen the depth of channels, the most sensible solution would be to impose maneuvering speed restrictions on these larger vessels, to allow for corrections in restricted waters. Although it would increase maneuvering times, it would certainly be better then the amount of time and expense involved in refloating this vessel. It would be extremely fortunate, and in my estimation unlikely there is no structural damage sustained by the vessel being so hard aground.<br />\nMike Scull, Retired Chief Engineer MEBA</p>\n",
    "parent": 0
  },
  {
    "id": 426347,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-03-17T16:16:45",
    "content": "<p>It will be interesting to find out whether the grounding was simply human error or a mechanical failure. Missing a well-marked turn in the channel with a pilot aboard seems unlikely, but stranger foul-ups have happened.</p>\n",
    "parent": 0
  },
  {
    "id": 426346,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-03-17T15:20:49",
    "content": "<p>It is interesting that both vessels Ever Given and Ever Forward went aground while under the advice of local Pilots.  Either the Pilots are not giving good and correct advice to the vessel Captains and Watchofficers or the vessels draft is not being allowed for correctly.</p>\n<p>Recently a large cruise ship grounded in the channel while departing Puerto Plata DR.  This is a Port that I entered and departed in a smaller cruise ship weekly for several years.  That was difficult enough how that large cruise ship managed is quite beyond me !!</p>\n<p>Channel depth must be maintained if all these large ships are going to be able to enter and depart Ports safely.  That should also help the Port Pilots, whom are generally outstanding, keep their jobs.</p>\n<p>Good Watch (and Piloting).</p>\n",
    "parent": 0
  }
]