[
  {
    "id": 414258,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-04-19T10:55:42",
    "content": "<p>Thanks. No need for defense. I will continue to express my views on all topics, political or otherwise.</p>\n",
    "parent": 414250
  },
  {
    "id": 414250,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-04-17T18:12:15",
    "content": "<p>In Rick&#8217;s defense, I just read his OP again and I fail to see anything but facts detailed therein. </p>\n<p>I myself stand guilty of connecting some other facts about the impacts of failure to establish a testing regimen with excuses offered to explain that failure. This creates a &#8220;political&#8221; atmosphere as an inevitability, as the connection between failing to test and failure to be able to restart the economy is the outcome of political choices made by a politician.</p>\n",
    "parent": 0
  },
  {
    "id": 414248,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-04-17T12:44:22",
    "content": "<p>I have no interest in starting any type of political hash.  i am a one size fits all with politicians type guy, don&#8217;t like any of them.  I just thought it really is unnecessary to drag politics into any discussion here.</p>\n",
    "parent": 0
  },
  {
    "id": 414245,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-04-17T08:58:43",
    "content": "<p>If you consider any criticism of the current administration to be &#8220;blathering and hatred&#8221; then I suspect that you will not be happy reading this blog.</p>\n",
    "parent": 414244
  },
  {
    "id": 414244,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-04-17T07:16:50",
    "content": "<p>Is it really necessary to post your political ideology here?  There is enough of that in the rest of the world.  I come here to get away from all the blathering and hatred.</p>\n",
    "parent": 0
  },
  {
    "id": 414243,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-04-16T18:45:28",
    "content": "<p><a href=\"https://www.cnn.com/2020/04/16/politics/esper-open-minded-crozier/index.html\" rel=\"nofollow ugc\">https://www.cnn.com/2020/04/16/politics/esper-open-minded-crozier/index.html</a></p>\n<p>Navy might rehire the dismissed captain</p>\n",
    "parent": 0
  },
  {
    "id": 414241,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-04-16T16:49:22",
    "content": "<p>I might add, those idle boats are having a catastrophic effect on payroll. We&#8217;re going to have a capacity loss that takes years to repair.</p>\n<p>Where&#8217;s the testing stand, after the press conference is over? Same as yesterday? Yes. </p>\n<p>But tests need to be fluidly, quickly available. Time to stop throwing blame from the podium, get this sorted. The faster, the better.</p>\n",
    "parent": 0
  },
  {
    "id": 414240,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-04-16T16:46:25",
    "content": "<p>I&#8217;m involved with an outfit with some 50 boats currently sitting at the dock, because it&#8217;s a) impossible to plausibly assemble a safe crew from a diversity of circumstances particular to each crew member and b) once on a boat, containing transmission is effectively impossible. And surprisingly enough, once all of the abstractions are stripped away, getting sick and dying turns out to be a downer for most normal people. </p>\n<p>With adequate testing, &#8220;a)&#8221; can be solved. As with so many other situations.</p>\n<p>Solution? Cut off funding to WHO. Wait, no, that won&#8217;t work. OK, try blaming Chinese for something that happened months ago and doesn&#8217;t really pertain to &#8220;now.&#8221;  Oops, no. Doubt the data&#8211; maybe that&#8217;s the solution!? No, people keep on dying so that&#8217;s not on.</p>\n<p>Perhaps after all the blame-deflection chaff falls out of the air we&#8217;ll get around to doing the obvious.</p>\n",
    "parent": 0
  }
]