[
  {
    "id": 407900,
    "author": "al por",
    "authorUrl": "http://hotmail.com",
    "date": "2018-11-09T17:37:08",
    "content": "<p>I think the real problem is there is no longer any competition for these ships.Please correct me if I am wrong but as of now there is only one company that has the ability to turn out aircraft carriers and two builders of frigat type ships. And with the mega mergers on the aircraft industry all we have is Lockheed/ Martin and Boeing. Boeing bought out Douglass. I do not know where Northrup?Grumman fit into this mess. So is there any wonder why these prices are so high?</p>\n",
    "parent": 0
  },
  {
    "id": 407896,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-11-09T16:36:23",
    "content": "<p>If a person puts in a request for a new desk for his office costing $10k it will be immediately rejected because the accountants can visualize the desk and know the price is ridiculous, but when he asks for money for a multi-million dollar warship project the cost/value ratio is beyond human comprehension so the funds are allotted.</p>\n",
    "parent": 0
  },
  {
    "id": 407869,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-11-07T20:07:35",
    "content": "<p>sadly, the US taxpayer too often gets stuck with poor design and procurement.</p>\n",
    "parent": 407868
  },
  {
    "id": 407868,
    "author": "Robert E. Frick",
    "authorUrl": "",
    "date": "2018-11-07T19:33:51",
    "content": "<p>It seems so easy to citicise without real knowledge and make comments about facts that have no facts. The U.S. Naval Ship Deisgn, Acquisition and ship building programs are more cost efficient and provide the most advanced capability obtainable. Some high risk elements require additional work. Yet no Nation can compete with the U.S. Navy Carriers, Cruisers, Frigates and especially submarines.</p>\n",
    "parent": 0
  },
  {
    "id": 407854,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-11-06T21:32:19",
    "content": "<p>Our tax dollars at work.  There is already a second zumwalt class ship in production.  Supposedly 4 in all.</p>\n",
    "parent": 0
  },
  {
    "id": 407852,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-11-06T19:25:21",
    "content": "<p><i>&#8230; requisition the megayachts owned by the navy’s suppliers.</i></p>\n<p>+++ 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 407851,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-11-06T17:07:16",
    "content": "<p>Yeah well&#8230; if reliable navy ships are needed the government can always requisition the megayachts owned by the navy&#8217;s suppliers 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 407850,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-11-06T16:14:05",
    "content": "<p>It&#8217;s currently ideologically unsound to say so, but when armories, naval shipyard etc. were in much tighter embrace by the customer (the government) we seemed to be able to crank out weapons systems that were reasonably effective, apparently affordable based on number of copies produced, produced from back-of-a-napkin to scaled production in very little time.</p>\n<p>These days the embrace is more along the lines of vendors suing their only customer, and the product we&#8217;re buying is excuses for failure on an industrial scale.</p>\n",
    "parent": 0
  },
  {
    "id": 407849,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-11-06T15:58:10",
    "content": "<p>Designed under one president, built under the next, and put into service by yet another. All with different priorities and backbiting agendas.</p>\n<p>A recipe for disaster.</p>\n<p>Here in the UK we have the largest warship, an aircraft carrier, ever built for the Royal Navy without enough escorts to defend it and untried experimental aircraft delivered two years after it was commissioned. It is like the Home Guard in WW2 who used brooms instead of guns until their WW1 models were delivered. You have to ask yourself what the politicians should have asked themsleves 15 years and two legislations back. &#8220;Why?&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 407846,
    "author": "JohnCchristopher",
    "authorUrl": "",
    "date": "2018-11-06T15:01:01",
    "content": "<p>Ur tax dollars at work&#8230;Had heard of the Zumwalts problem last year&#8230;way to go NAVSEA ON BOTH ACCOUNTS.  Is someone getting fired?  My understanding Zumwalts could not fire gun on Bravo trials..</p>\n",
    "parent": 0
  },
  {
    "id": 407841,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2018-11-06T10:10:19",
    "content": "<p>Love the line about the pacifist designer!</p>\n",
    "parent": 0
  },
  {
    "id": 407835,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-11-05T16:59:31",
    "content": "<p>Ford &#8220;does&#8221; have elevators, 11 of them.</p>\n<p>May 16, 2018</p>\n<p>Repairs on the USS<br />\nGerald R. Ford<br />\nengines and<br />\nelevators to cost<br />\nanother $120<br />\nmillion<br />\n<a href=\"https://thenewsrep.com/103256/repairs-on-the-uss-gerald-r-ford-engines-and-elevators-to-cost-another-120-million/\" rel=\"nofollow ugc\">https://thenewsrep.com/103256/repairs-on-the-uss-gerald-r-ford-engines-and-elevators-to-cost-another-120-million/</a></p>\n",
    "parent": 0
  }
]