[
  {
    "id": 415942,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-09-09T06:27:44",
    "content": "<p>Seems like the owners of the ship should be trying to reconcile this.  The ship has a cargo.  That cargo needs to be delivered.  Put the refugees to work.  Give them honest pay.  At least get the boat moving again.</p>\n<p>It is like trucking.  One doesnt buy a class 8 truck to park it.  It makes money when it is moving.</p>\n",
    "parent": 0
  },
  {
    "id": 415932,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-08T18:20:52",
    "content": "<p>Many years ago I was sailing a yacht eastwards across the Mediterranean from southern Spain, helping a friend. The skipper of a cargo ship called us on the radio and suggested it would be wise for us to turn south for about ten miles as there was a boat load of refugees directly in our path and it was possible that they would sink their boat so we would be forced to take them on board. We took his advice and presumably the refugees carried on to Spain.</p>\n",
    "parent": 0
  },
  {
    "id": 415931,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-08T18:12:14",
    "content": "<p>Why doesn&#8217;t the Captain of the ship take it to a country that will take the refugees, maybe Marseille in France? The French will then let them pass through France to the UK like all their other refugees.</p>\n",
    "parent": 0
  },
  {
    "id": 415930,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-09-08T15:45:46",
    "content": "<p>We&#8217;re creating broken geography at scale and hence creating refugees. </p>\n<p>Systems thinking can&#8217;t be avoided here. The ultimate remedy lies in slowing and then zeroing out the rate at which we&#8217;re manufacturing uninhabitable conditions. </p>\n<p>Best figure it out&#8211; this is only the trickle before the flood. </p>\n<p>Meanwhile captains and crews continue do the only right thing.</p>\n",
    "parent": 0
  }
]