[
  {
    "id": 418841,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-01-03T12:44:40",
    "content": "<p>No cruise line could afford to fund their ships with cash. Cruise ships are the most expensive commercial ships to build and are financed through a mix of debt and equity. </p>\n<p>Given the long led time necessary to build a cruise ship, I am sure all the new deliveries were ordered well before the onset of the pandemic.</p>\n<p>For more than you may wish to know about cruise ship financing:</p>\n<p><a href=\"https://www.researchgate.net/publication/318395676_Methods_of_Raising_Funds_for_Purchasing_of_New_Cruise_Ships_by_International_Corporations\" rel=\"nofollow ugc\">https://www.researchgate.net/publication/318395676_Methods_of_Raising_Funds_for_Purchasing_of_New_Cruise_Ships_by_International_Corporations</a></p>\n",
    "parent": 418833
  },
  {
    "id": 418833,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-01-02T23:15:04",
    "content": "<p>Judt a hunch.  These new ships were paid in cash.  Companies would not be so wreckless as to buy with a loan.  With the smaller companies having folded.  These mega owners are probably taking the gamble that they will be in higher demand whne covid is not what it is now.  Mind you I am only speculating that the mega owners pockets are still very deep with resources.</p>\n",
    "parent": 0
  },
  {
    "id": 418830,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2021-01-02T20:01:40",
    "content": "<p>If a price war is started in order to try and boost passenger numbers it is not going to help the profits needed to pay for all the new ships. There is going to have to be some creative marketing. What haven&#8217;t they already tried?</p>\n",
    "parent": 0
  },
  {
    "id": 418829,
    "author": "William Allan Sheppard Smith",
    "authorUrl": "",
    "date": "2021-01-02T19:40:59",
    "content": "<p>There was enough disease on these cruise ships before this pandemic that stopped the wife and I from ever boarding. Doubly so with the present situation.</p>\n<p>People who love them, really love them though. A co-worker has taken his family of 5 on trips three years in a row, Not last year thank gawd, and three years in a row they get some big that lays them low for another week</p>\n",
    "parent": 0
  }
]