[
  {
    "id": 409960,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-03-24T14:24:37",
    "content": "<p>What is confusing is that the ship is diesel-electric. It has four engines, probably two engine rooms, two electric motors, and two propellers. The four diesel engines all drive generators which create electricity to drive electric motors, one each connected to the two propellers. </p>\n<p>It is possible, but not likely, that the diesel engines all failed. It is much more probable that the control system which distributes power to the motors failed. Cruise ships built at Fincantieri have had more than their share of propulsion failures due to electrical problems.</p>\n",
    "parent": 0
  },
  {
    "id": 409958,
    "author": "curt bovee",
    "authorUrl": "",
    "date": "2019-03-24T12:27:38",
    "content": "<p>Will you, Never would Never leave dock on a single engine.<br />\nManeuvering in that are needs to be A#1.<br />\nLife boats would perhaps capsize in that steep sea.  Not worth risk.<br />\nThe owners and rescuers are all performing A#1.  Study the subject with<br />\nthis blogger&#8217;s experiences at Sea.  Thanks, Rick.</p>\n",
    "parent": 0
  },
  {
    "id": 409957,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-24T09:59:46",
    "content": "<p>Even more intersting is all four engines failed.  Wondering if a check on the maintenance will show they left port with only one functioning engine</p>\n",
    "parent": 0
  },
  {
    "id": 409956,
    "author": "Liza Czopyk",
    "authorUrl": "https://www.proz.com/profile/122736",
    "date": "2019-03-24T07:31:09",
    "content": "<p>Because the lifeboats cannot be used in such storm!</p>\n",
    "parent": 0
  },
  {
    "id": 409955,
    "author": "Billy",
    "authorUrl": "",
    "date": "2019-03-24T06:43:59",
    "content": "<p>Willy, are you drunk?</p>\n",
    "parent": 0
  },
  {
    "id": 409952,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-24T00:41:52",
    "content": "<p>Interesting that they didnt want to use the life boats that are designed to be used for this.</p>\n",
    "parent": 0
  }
]