[
  {
    "id": 405487,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-02-15T19:32:24",
    "content": "<p>GE&#8217;s LM-2500 combustion turbine is fully shock qualified, Mil-S-901C and is utilized on several classes of US Navy surface combatants:</p>\n<p>file:///C:/Users/Internet/Downloads/V001T01A087-73-GT-88.pdf</p>\n",
    "parent": 0
  },
  {
    "id": 405485,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG",
    "date": "2018-02-15T12:59:55",
    "content": "<p>One really feels that this nautical blog is not the venue for political discussions.  Generally at sea politics and religion are not discussed and that works out quite well particularly with multi-national crews.<br />\nHowever this is not my blog &#8211; just my opinion.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 405478,
    "author": "dar",
    "authorUrl": "",
    "date": "2018-02-14T23:26:54",
    "content": "<p>FYI: <a href=\"https://geopolitics.co/2018/02/13/multiple-us-govt-shutdowns-didnt-deter-highest-ever-budget-for-pentagon/\" rel=\"nofollow ugc\">https://geopolitics.co/2018/02/13/multiple-us-govt-shutdowns-didnt-deter-highest-ever-budget-for-pentagon/</a></p>\n<p>Multiple US Gov’t ShutDowns Didn’t Deter Highest Ever Budget for Pentagon<br />\nThe United States, Inc. just survived two shutdowns in two months yet this did not deter the approval of a $716 billion military budget for the year 2018-2019, the highest military budget ever, and still is among the G7 countries’ military spending combined&#8230;<br />\nThis is probably the number one irreconcilable aspect of the American democracy and as a society at large, which gravely contradicts their own perceived moral high ground in all geopolitical interventions and military misadventures abroad.<br />\nIn what many consider to be a nod toward the dictum of ‘peace through superior firepower,’ the US government has approved the largest one-year military budget in its – or anybody else’s – history.<br />\nWith the adoption<br />\nof a $700 billion one-year military budget — the largest the Pentagon has yet received and far beyond the military spending of Russia and China combined — the Trump White House has granted itself the ability to add thousands of troops, buy flashy new military hardware including aircraft and combat ships, and an opportunity to step up the weaponization of US democracy around the globe&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 405476,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-02-14T11:44:28",
    "content": "<p>Gas Turbines run nicely on land based applications, Jets, and<br />\ncruise ships..</p>\n<p>Shock and vibration, endemic to ice-breaking operations??</p>\n<p>They had issues with combustion turbines on locomotives</p>\n",
    "parent": 0
  },
  {
    "id": 405475,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-02-13T23:10:30",
    "content": "<p>If only all countries had a food chain like ours wherein voracious contractors consume more and more money to produce fewer and fewer weapons, we might indeed achieve &#8220;peace in our time.&#8221;  </p>\n<p>&#8220;Thank your for your $12 billion and here is your bullet. Shoot it wisely. Oh, and remember: even though you&#8217;re our only customer, we&#8217;ll sue you if you try to promote too much competition within our oligopoly.&#8221;</p>\n",
    "parent": 0
  }
]