[
  {
    "id": 413837,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-03-18T10:14:55",
    "content": "<p>Based on media reports and press releases, ships with cases of the virus have generally quarantined the crews either on shipboard or at shore-based facilities. Once the quarantine period was over they were flown home. In the case of the Diamond Princess, they appear to have been moved ashore in groups. The last 130 were off the ship by the beginning of March. Princess Cruises hired Australia-based company Aspen Medical to provide care to crew members quarantined in Japan.</p>\n<p>In the case of the Grand Princess, the crew appears to have been kept aboard the ship for the quarantine period. All the crew were screened but not tested before being disembarked to fly home. (The passengers on the Grand Princess were also screened but not tested before being sent to quarantine.)</p>\n<p>Ships taken out of service without any cases of the coronavirus aboard had their crews sent home usually on chartered flights. Skeleton crews remain aboard to look after the ships.</p>\n",
    "parent": 413828
  },
  {
    "id": 413828,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-03-17T13:11:32",
    "content": "<p>Thanks for this post but I still have questions maybe someone can answer.<br />\nAre the workers that left ships being quarantined as a group? Are they being added to local communities where they&#8217;ve anchored and also told to shelter in place? Or are they each individually trying to head to their home countries by ship or plane?<br />\nAnd, before disembarking were they screened and tested?</p>\n",
    "parent": 0
  },
  {
    "id": 413826,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd)",
    "authorUrl": "http://Formerly%20Nautical%20Log%20(no%20longer%20published)",
    "date": "2020-03-17T09:51:21",
    "content": "<p>No Willy its not that simple.<br />\nRick thank you for this Post, from the beginning I have been very concerned for the crews.  For 50 years of which about 30 was in passenger ships these ladies and gentlemen have been my shipmates.  One met persons from dozens and dozens of countries, and if one paid attention it was a university education of the nations of the World language and culture.<br />\nLooking out from the now closed City of Miami Beach beaches there are several cruise ships at anchor and it is sad to think of their crews trapped on board.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 413824,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-03-17T06:20:24",
    "content": "<p>Yet the hiatus is only temporary.  Once everyone contracts it, it will be business as usual.</p>\n",
    "parent": 0
  }
]