[
  {
    "id": 435773,
    "author": "John D Broadwater",
    "authorUrl": "",
    "date": "2023-06-24T11:05:43",
    "content": "<p>Regardless of circumstances leading up to the loss of the Titan last week, we should all reserve our barbs for a later time, after we&#8217;ve allowed time for grieving and reflection. I knew PH Nargeolet, and I have lost a colleague and friend. He was a naval officer, a scientist, an explorer, and a delightful person. I feel sad for the families and friends of the other occupants and I hope they all find some comfort in the days ahead.</p>\n",
    "parent": 0
  },
  {
    "id": 435764,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2023-06-23T13:47:02",
    "content": "<p>I find a mother and daughter grieving for a father and son very sad indeed. The others were not super rich, rather they were explorers doing what they saw as important for the earth and for science. I hate to think of all the things I spent money on as a younger man with associated risks and, due at times just to good luck, I am still here.</p>\n<p>I even flew on a 737-800 (MAX) recently and was never so glad as to be able to walk away from the aircraft. A couple of hundred of my previous fellow travellers were not so lucky yet they spent their money on their flight.</p>\n<p>One day there shall be an inquiry with time for ranting, finger pointing, blame and being downright supercilious, but now is not that time.</p>\n",
    "parent": 0
  },
  {
    "id": 435754,
    "author": "Yvonne Póo",
    "authorUrl": "",
    "date": "2023-06-23T01:02:45",
    "content": "<p>The only thing sad about this story is the innocent teen that didn&#8217;t even want to go! The rest are greedy pretentious people that risk their lives doing something stupid to show off. They got what they pay for; the real experience of dying like the Titanic victims. The difference is that we know they didn&#8217;t suffer because it is an instant death.</p>\n",
    "parent": 0
  },
  {
    "id": 435751,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2023-06-22T23:05:21",
    "content": "<p>How very sad.</p>\n<p>I could not understand why the acoustic locator beacon did not give a position but now realise that the shockwave created by the violent implosion would have destroyed it too. </p>\n<p>It is also sad that the recovery of human remains will be almost impossible, not just because of the depth but the fact that everything will have been imploded to a single mass. I was involved in the recovery of more than 50 bodies during my career in the North Sea, mostly from helicopter crashes and it was a major driver in very difficult circumstances to recover bodies for loved ones to grieve. Alas I do not think this will be possible here. </p>\n<p>RIP+ gentlemen.</p>\n",
    "parent": 0
  }
]