[
  {
    "id": 439663,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2024-08-23T11:23:35",
    "content": "<p>The only good news in this tragedy is that it appears likely that the yacht will be raised. There should be solid evidence as to what sequence of events led to the sinking.</p>\n",
    "parent": 0
  },
  {
    "id": 439662,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2024-08-23T10:30:02",
    "content": "<p>Further to this tragic event and the loss of lives the blame game has started with the builders setting an atmosphere.  Their vicious harshly worded remarks quite frankly shocked me.  Having spent 50 years as a professional mariner from Cadet to Master one is appalled by Perini Nav. making such remarks before any investigation has been completed. Perhaps the builders are feeling a sense of guilt and thoughtlessly lashing out.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 439661,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2024-08-23T10:14:57",
    "content": "<p>Well you must have stretched your mind to think this one up.  Unkind, ill informed comments when persons have been lost at sea is not the way we should live together on this Ocean Planet.</p>\n<p>Oh! and bye the bye the Chef who died was a friend of our family from the West Indies.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 439652,
    "author": "Ian McColgin",
    "authorUrl": "",
    "date": "2024-08-22T07:37:08",
    "content": "<p>&#8221; . . . James Catfield, the captain of the Bayesian has released a four-word statement — “We didn’t see it coming.”  That&#8217;s five words. Mistakes like this in navigation make for poor landfalls.</p>\n",
    "parent": 0
  },
  {
    "id": 439645,
    "author": "D. Peter Boucher. Kt. SMOM. International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2024-08-21T09:37:13",
    "content": "<p>CAPT. Catfield is a wise man to keep quiet.  Once he is professionally represented then statements may be made.<br />\nAlready conspiracy theories are developing particularly in view of a business partner of Mr. Lynch being killed the same weekend.<br />\nThe press generally can create stories to boost ratings and the British press are very quick to do so.</p>\n<p>Good Watch and safe sailing</p>\n",
    "parent": 0
  }
]