[
  {
    "id": 412366,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-10-02T15:20:35",
    "content": "<p>A very good friend of mine, Peter Wilson, has bought and restored a Silvers Motor Yacht with quite a history.</p>\n<p>In WWII she was requisitioned by the Royal Navy to monitor German bombers dropping mines into the lower Clyde shipping channel. One night she observed a mine landing near Langbank and moved in to drop a Dhan Buoy to mark it for the RN bomb disposal squad to deal with. </p>\n<p>Unfortunately, as they departed the area the mine detonated and she was blown 12 feet out of the water. When she landed her caulking was blown and she was taking on water. The crew ran her up into shallow water and, shell shocked, the crew abandoned ship and waded ashore, up a beach, over a bund (levy) where they found a farm. The Farmer and his wife plied them with succour and relief, (whisky), and one of the crew required to &#8220;powder his nose&#8221; and went to the outside toilet which was a small dunny (shed) on top of the bund. At this point a German bomber dropped another mine which exploded close-by and blew the dunny from around him exposing him to the world.</p>\n<p>He remains the only man to have been mined twice in a few hours.</p>\n",
    "parent": 0
  },
  {
    "id": 412365,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-10-02T14:52:08",
    "content": "<p>I meant to suggest that it is an interesting coincidence that a ship that spontaneously exploded in 1665 happened to become the resting place of a large bomb 280 years later given the expanse of the Thames Estuary.</p>\n",
    "parent": 0
  },
  {
    "id": 412364,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-10-02T14:31:41",
    "content": "<p>&#8220;Exactly how the World War II bomb came to rest in the 17th-century wreck is unclear.&#8221;</p>\n<p>You are joking? Right?</p>\n",
    "parent": 0
  },
  {
    "id": 412361,
    "author": "Total",
    "authorUrl": "",
    "date": "2019-10-02T08:31:54",
    "content": "<p>&#8220;Well, heck, Frank, we found wot sunk her.&#8221;</p>\n<p>&#8220;I dunno, Mort, they have para bombs in the 17th century?&#8221;</p>\n<p>&#8220;Looks like, Frank, looks like.&#8221;</p>\n",
    "parent": 0
  }
]