[
  {
    "id": 412061,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-09-05T01:15:37",
    "content": "<p>It&#8217;s puzzling that the first notice the crew of the boat had of a problem (according to an account by the first to awaken) was a popping sound, not smoke/fire alarms. This crew member was confronted by flames and smoke after opening the door of his compartment, thereby suggesting that the vessel should already have been blaring with alarms&#8211; assuming such equipment was functional. </p>\n<p>It&#8217;ll be interesting to see if there&#8217;s any firm evidence that alarm equipment was operable at the time of the fire. </p>\n<p>Exigencies of budgets and time available for maintenance figure time and again in situations such as this.</p>\n",
    "parent": 0
  },
  {
    "id": 412054,
    "author": "ws",
    "authorUrl": "",
    "date": "2019-09-04T17:11:32",
    "content": "<p>Like Morro Castle, Joan La Rie III, &#8230;<br />\nAfter this investigation is completed the USCG will tighten the noose</p>\n",
    "parent": 0
  },
  {
    "id": 412052,
    "author": "Alex",
    "authorUrl": "",
    "date": "2019-09-04T16:02:55",
    "content": "<p>Looks like the crew just jumped ship leaving passengers behind</p>\n",
    "parent": 0
  },
  {
    "id": 412051,
    "author": "capt.carl (Norfolk / Willoughby Spit / on the Bay)",
    "authorUrl": "",
    "date": "2019-09-04T11:43:49",
    "content": "<p>After so many years without a &#8216;major&#8217; incident &#8211; to have one so Catastrophic I just cannot phantom &#8211; there appear no bread crumbs leading to a cause &#8211; May all find peace forever more &#8211;</p>\n",
    "parent": 0
  },
  {
    "id": 412050,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-09-04T10:44:34",
    "content": "<p>When I asked a salesman at a boatshow why there was no escape hatch in the aft cabin of their production line boats leaving the only exit past the galley and the engine (the two most likely sources of fire) I was told it wasn&#8217;t required because there was a smoke alarm&#8230; yeah, right.</p>\n",
    "parent": 0
  },
  {
    "id": 412049,
    "author": "Bill Nyden",
    "authorUrl": "",
    "date": "2019-09-04T02:26:43",
    "content": "<p>There was only one ladder (narrow, steep stairs) from the sleeping compartment to the main deck salon/galley. The other ladder led to the shower compartment, which was not otherwise accessible from the sleeping compartment. The emergency exit hatch was in the overhead at the aft end of the compartment, and was probably engulfed by flames from the main deck. A fire in the salon would trap everyone below decks. I have been a diver-passenger aboard the Conception a few times.</p>\n",
    "parent": 0
  },
  {
    "id": 412045,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-09-03T14:57:20",
    "content": "<p>ABC NEWS, 3-hpirs ago, California time/ with video</p>\n<p>25 bodies located after boat fire near Santa Cruz Island, 9 still missing, Coast Guard says<br />\n<a href=\"https://abc7.com/25-bodies-found-after-boat-erupts-in-flames-off-santa-cruz-island/5508025/\" rel=\"nofollow ugc\">https://abc7.com/25-bodies-found-after-boat-erupts-in-flames-off-santa-cruz-island/5508025/</a></p>\n",
    "parent": 0
  }
]