[
  {
    "id": 411662,
    "author": "Peter Wright",
    "authorUrl": "http://LARGS%20YACHT%20HAVEN%20Peter%20Wright",
    "date": "2019-07-29T11:42:53",
    "content": "<p>Peter, as they say, I work &#8220;forcunard&#8221; but not for a cruise line. I merely downloaded it to show that Caribbean Cruises have a policy but do not enforce it and they appear to have been supported by the judiciary in doing their utmost to create profits and avoid bad publicity by not enforcing it.</p>\n<p>There was a heinous crime committed here aided and abetted by corporate interests.</p>\n<p>I cannot even begin to imagine the effect that this will have on the young girl and her family and the perpetrators will walk free and possibly commit the same crime again.</p>\n",
    "parent": 0
  },
  {
    "id": 411658,
    "author": "D.Peter Boucher, Kt. SMOM, International Master Mariner.",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG%20no%20longer%20published",
    "date": "2019-07-28T09:28:06",
    "content": "<p>Thank you Mr. Wright for stating your cruise lines policy.  From Peter to Peter we both known this is only effective when enforced. This as we further both know is the actual problem. Since you have stated your written policy here it is clear to all commenters that it was not followed in this case.  There is no excuse for the behavior of the Bar Staff and as you must well know it places the Master and the Deck Officers who represent him/her in a most difficult position.  Enforce your policy or it is just words.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 411655,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-07-28T07:27:57",
    "content": "<p>Royal Caribbean Cruises Alcohol Policy</p>\n<p>Onboard Alcohol Policy</p>\n<p>Guests are not allowed to bring beer, hard liquor or non-alcoholic beverages onboard for consumption or any other use. Guests may bring personal wine and champagne onboard only on boarding day, limited to two (2) 750 ml bottles per stateroom. When consumed in any public area, each bottle shall be subject to a corkage fee. Additional bottles of wine beyond two (2) bottles that are brought onboard or any alcoholic beverages purchased in ports-of-call or from Shops On Board will be stored by the ship and delivered to your stateroom on the last day of the sailing. Alcoholic beverages seized on embarkation day will not be returned.</p>\n<p>Security may inspect containers (water bottles, soda bottles, mouthwash, luggage etc.) and will dispose of containers holding alcohol. Guests who violate any alcohol policies, (over consume, provide alcohol to people under age 21, demonstrate irresponsible behavior, or attempt to conceal alcoholic items at security and or luggage check points or any other time), may be disembarked or not allowed to board, at their own expense, in accordance with the Guest Conduct Policy. Guests who are under the permitted drinking age will not have alcohol returned to them.</p>\n<p>Drinking Age Policy</p>\n<p>The minimum drinking age for all alcoholic beverages on Royal Caribbean International ships sailing from North America is 21. The minimum drinking age for all alcoholic beverages on Royal Caribbean International ships sailing from South America, Europe, Asia, Australia and New Zealand is 18. In certain circumstances where local laws permit or require, Royal Caribbean International may modify this policy which may also require parent/guardian request/authorization. Guests may contact Guest Services or refer to the Cruise Compass for specific minimum drinking age information on their cruise vacation.</p>\n<p>For purposes of complying with the minimum drinking age requirements, a guest&#8217;s age is established upon boarding at the beginning of the cruise vacation. If a guest celebrates their birthday during the cruise vacation, and thereby becomes of age to consume alcohol, the guest may thereafter ask the Guest Services Manager to modify ship&#8217;s records to permit their consumption of alcohol during the remainder of the vacation. The guest will be required to appear at Guest Services to present a valid government-issued form of identification to permit verification of their age.</p>\n<p>No guest under age 18 may possess or consume alcohol at any time while onboard. No guest under age 21 may possess or consume alcohol at Royal Caribbean&#8217;s private destinations. Any guest who goes ashore and consumes alcohol (whether under the supervision of a parent/guardian or not, is responsible for ensuring they consume responsibly and retain their ability to recognize and avoid potentially dangerous situations when they return to the ship. Parents/guardians are reminded they are responsible for the actions of their child/young adult at all times while on a Royal Caribbean International cruise vacation.</p>\n",
    "parent": 0
  },
  {
    "id": 411643,
    "author": "Ronald J. Wilkinson",
    "authorUrl": "",
    "date": "2019-07-27T17:23:24",
    "content": "<p>Pardon. I posted before I read Rick&#8217;s post.</p>\n",
    "parent": 0
  },
  {
    "id": 411642,
    "author": "Ronald J. Wilkinson",
    "authorUrl": "",
    "date": "2019-07-27T17:21:49",
    "content": "<p>I wonder what the ratio of staff to passenger is aboard these large cruise ships?<br />\nWhy was a 15 year old drinking? Wouldn&#8217;t the bartender card her?<br />\nI&#8217;d think that a bunch of men milling around a teenage girl would cause alarm.<br />\nAs the Master Mariner said above, it sounds like the staff was not performing their duty. I also wonder why the others at the bar didn&#8217;t express their concern to the staff.<br />\nA resort, cruise ship where people are on a holiday in close quarters fueled on alcohol sounds like a problem waiting to happen.</p>\n",
    "parent": 0
  },
  {
    "id": 411641,
    "author": "Doug Bostroom",
    "authorUrl": "",
    "date": "2019-07-27T15:15:33",
    "content": "<p>There are good reasons why ships and their human freight are often employed in literature for exploring human nature and character. A handy microcosm, simplified and distilled. Here we see the larger problem, crisply defined. Some few men besmirch the rest of us, make life needlessly challenging and risky for females. </p>\n<p>&#8220;I am blaming the parents&#8230;&#8221; but not the parents of the men who were cultured to behave this way? Really?</p>\n",
    "parent": 0
  },
  {
    "id": 411640,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG,%20no%20longer%20published",
    "date": "2019-07-27T11:40:31",
    "content": "<p>Very disturbing discussion.  Willy you seem to comment on just about every one of Ricks posts.  Apparently with very little knowledge of shipboard life or the duties of those aboard.  As a former cruise ship Officer the procedure in this case is for the Bar Staff to cut off alcohol to everyone involved.  They should then inform their Bar Manager who will report the problem to the Staff Captain.  The situation will be addressed and resolved.  I have seen on rare occasions passengers put ashore at the next port of call to make their own way home.  This could well be such a case.  All countries have rules of law not just the USA and some do a much better job of it.  Remember a ship follows the laws of her Flag State at all times in addition to International Maritime Law.  This child is stated as being 15 years so is in need of protection by responsible adults.  A case of negligence could be made if the cruise line has not given written instructions to the Bar Staff and followed up on those instructions actually being applied, this is a duty of departmental Managers.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 411636,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-07-27T07:55:14",
    "content": "<p>I am not blaming the kid for the rape sheesh!  I am blaming the parents for not teaching the kid to avoid the alcohol.</p>\n<p>I have three gorgeous grand daughters of whom the courts are willing to allow to stay with their boozing parents.  How do you think makes me feel?  Yet we cant do anything if a kid wants to put on a charade of an adult to get liquor.  </p>\n<p>Yes the crew should have been more diligent.  Yet the cruise industry has a hands off approach.  The industry has told the crew of not interfering with some ones desire to have fun.  It is a nasty catch 22.  On the one hand the crew needs to intervene.  On the other hand, crew gets fired if some one complains that the crew spoiled their &#8220;fun&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 411633,
    "author": "Allan S",
    "authorUrl": "",
    "date": "2019-07-26T18:38:22",
    "content": "<p>Willie, the KID was 15. Stop the victim blaming.</p>\n<p>As a father of a rape survivor, who remains unidentified after 5 years, I want so bad to get my hands on one, any one.</p>\n<p>My daughter has issues to this day and probably will for many more years</p>\n",
    "parent": 0
  },
  {
    "id": 411632,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-07-26T17:43:51",
    "content": "<p>Bartenders have a responsibility to see to it that those being served are of an appropriate age and that they do not drink too much. That is true both on land and on a cruise ship. The 15-year-old obviously made a bad choice by accepting alcohol from the group of men. That in no way removes the responsibility of the RCL staff who watched all of it happen to act appropriately.</p>\n",
    "parent": 0
  },
  {
    "id": 411631,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-07-26T17:04:02",
    "content": "<p>Apparently you havent seen the dark side of being a teenager whom wants to get drunk.  Teens will do it if it is offered and they have had a past history of consuming liquor.  Here in Maine the parents would get punished for their adolescent child being allowed to get drunk.  I hope the parents have good representation, as this child of 19 may be opening up pandoras box.</p>\n",
    "parent": 0
  },
  {
    "id": 411630,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-07-26T16:53:29",
    "content": "<p>The allegation as confirmed by the appeals court is that the 15-year-old was plied with liquor, that she was encouraged to drink by a group of men, while the bartenders and waiters stood by and watched. Yes, the teenager should not have taken the drinks. Nevertheless, the adults whose jobs it is to manage the bar should have stopped it or gone to the girl&#8217;s assistance. Blaming the rape victim is flat out wrong.</p>\n",
    "parent": 0
  },
  {
    "id": 411629,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-07-26T16:44:20",
    "content": "<p>So the 15 year old willingly consumed alcohol in a bar?  And that 15 year old doesnt want to be held accountable for her actions of wanting to get drunk.</p>\n<p>I realize the rape was unwanted and something should happen there.  Yet the 15 year old should not be able to hold the cruise liner accountable for her desire to get drunk.  That should and is the fault of the 15 year old.  That crime was hers.</p>\n<p>(I am not condoning the sexual assault, I am merely questioningthe teenagers thoughts that the cruise line was at fault for her being wrecklless).</p>\n",
    "parent": 0
  }
]