[
  {
    "id": 428481,
    "author": "dd",
    "authorUrl": "",
    "date": "2022-08-25T18:50:53",
    "content": "<p>Geoengineering is where it&#8217;s at,CaptRick&#8230; corbettreport.com/waterwars/&#8230; not only has cloud seeding been around since the 1940s, it is just one of a number of weather modification technologies that have been used to modify (and even weaponize) weather for the better part of a century.</p>\n<p>As early as the late 1940s, American mathematician John von Neumann was researching weather modification and its potential uses in climatic warfare for the US Department of Defense. In the 1950s early cloudbursting experiments were performed by Wilhelm Reich and in 1956 Dr. Walter Russell was writing of the potential for complete weather control. In the 1960s, Dr. Bernard Vonnegut, brother of the famous writer, vastly improved the techniques then in use by employing silver iodide crystals in the cloud seeding mixture. Silver iodide’s hygroscopic qualities insure water particles quickly bond with its crystalline structure.</p>\n<p>Unsurprisingly, the idea was put to active military use almost immediately. From 1967 to 1972, the US Air Force ran Operation Popeye, a highly-classified rainmaking program deployed in Southeast Asia “in an attempt to slow the movement of North Vietnamese troops and supplies through the Ho Chi Minh trail network.” The program was so classified that even President Nixon’s Defense Secretary, Melvin Laird, didn’t know of its existence until it was reported in the press. So, who went over the Secretary of Defense’s head to authorize and coordinate a scheme to weaponize the weather? Why, Henry Kissinger, of course.</p>\n<p>According to Seymour Hersh, who broke the story in The New York Times in 1972:</p>\n<p>“This kind of thing was a bomb, and Henry restricted in formation about it to those who had to know,” said one well placed Government official, referring to Henry A. Kissinger, the President’s adviser on national security&#8230;it should not be surprising that a market has evolved for “weather derivatives,” effectively allowing large financial institutions to make money gambling on the weather. And it should also come as no surprise that this market was largely pioneered by that infamous globalist-connected insider corporation, Enron&#8230;</p>\n",
    "parent": 0
  }
]