[
  {
    "id": 420728,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-04-24T17:03:32",
    "content": "<p>She discovered she could sail around the world in less time than it took B&amp;Q, her sponsor, to deliver a new kitchen to a customer eight miles from the local store.</p>\n",
    "parent": 0
  },
  {
    "id": 420718,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-04-23T15:51:49",
    "content": "<p>The circular economy is a full accounting, appropriate for operating both the smaller and larger of the two space stations we have. </p>\n<p>The smaller station is a model for how the larger ought to work; to the greatest extent possible, <i>everything</i> on the little space station is accounted for, has to be for otherwise it would cease to function as a habitable space. </p>\n<p>On the little space station, constraints are recognized and respected without controversy and with avarice etc. agreed to be subordinated. Nobody can open a cigar shop on the space station because there&#8217;s no way of accounting properly for the smoke emitted from cigars, in that miniature world. Down here on the larger space station, bigger analogues to cigars are unaccounted for. </p>\n<p>As well, devotion to the common purpose of helping the little space station operate properly has suppressed nationalist pride and parochial concerns. Even while Russia and the US are at odds in many arenas down on the larger space station, they nearly effortlessly coexist and cooperate in respect to their treatment of the little space station.</p>\n<p>So, just from the perspective of an instructional example, the ISS is worth its monetary cost, if we bother to notice these things. 🙂</p>\n<p>Meanwhile, back on Earth and the ocean, one of the many features and benefits of cruising in a boat: acute awareness of the economy of the boat and its crew. Water, electricity, food, sewage are all matters of accounting made plainly visible. This changes one&#8217;s perspective even ashore.</p>\n",
    "parent": 0
  }
]