[
  {
    "id": 425518,
    "author": "Derek. Nelson",
    "authorUrl": "http://onetonpump.com",
    "date": "2022-01-24T09:04:36",
    "content": "<p>Aye , the time will come when Jumbos come home to roost : we will get real about energy &amp; use natural forces. In eight decades I’ve crossed seven seas &amp; some , in tall ships, schooners  Constellations, and Liberty Ships , a lot of fuel was consumed. My contribution to warming this Planet.<br />\n This wind driven cargo ship is a crude idea , a ‘modern’ one would use telescopic masts, roller furling on the yards &amp; kite like spinnakers.  I now live near where I was born on the‘Ring of Fire “ by the great Southern Ocean “The Roaring Forties” , which is the Intercontinental express track, an ideal route connecting three large land masses &amp; some. Bring on the riggers!<br />\n As a child going 1/2 way around the world on a Liberty Ship , I was fascinated by the crane jibs  loading and unloading : later as a longshoreman I participated. Basic equipment &amp; skills. For some of us this life may return, when the need arises &amp; the IOT &amp; virtual existence is inadequate..<br />\nWhen we ‘dare’ as Greta implies the CPAs  &amp; economic practices will give precedent to practice, our limitations will be different..<br />\nI’ve been a Master Mariner for 1/4 century , learning seamanship,  a Bondi surfer to feel hydrodynamics , SCUBA, now kayaking for intimate love of water, while working on a ‘higher performance’ muscle power bilge pump [last chance]  , pedal prop &amp; teacher of the Art of Sculling , the fundamental ability to navigate..I learned this at New Providence Island, where it was the ordinary practice &amp; inter island cargo was carried by sail..<br />\n I’m sure that this wind driven  cargo ship will evolve. It’s been done before.</p>\n",
    "parent": 0
  },
  {
    "id": 425428,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-17T20:26:11",
    "content": "<p>I suppose financial mechanics needing to be employed are an indication of the quality of the plan. In this case, not confidence inspiring. </p>\n<p>My heart is with this romantic idea of how sail can come back to cargo but my brain is with bulkers equipped with wing sails as most likely to be first succesful effort, with &#8220;success&#8221; including &#8220;economically viable&#8221; as a key virtue.</p>\n",
    "parent": 0
  },
  {
    "id": 425386,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-01-15T10:21:37",
    "content": "<p>I am concerned primarily with the size, the challenges of breakbulk cargo handling, and yes, the lack of auxiliary power. The cargo deadweight of only 500 tonnes is a quarter to a tenth of the size of early 20th century windjammers, several of which survive today. Small ships crossing large oceans with mid-19th century technology seem unlikely to be &#8220;sustainable.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 425379,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-14T22:50:07",
    "content": "<p>No engine: bold. Too much friction (such as what&#8217;s well described above) and things become impossible. No engine is more friction of a kind. </p>\n<p>It makes me wonder if having electric propulsion strictly for tricky bits would be a cost dealbreaker. Over a typical voyage quite a few kWh could be gathered into batteries. </p>\n<p>I suppose all of this has been considered? Our insight is not perfect. It&#8217;s hard to imagine scrupulous modeling of a venture such as this one missing such things.</p>\n",
    "parent": 0
  },
  {
    "id": 425374,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2022-01-14T17:14:34",
    "content": "<p>While it is laudatory experiment rebuilding old sailing ships is fraught with surprises which cost more than the budget is covering.  The ships, even with modernization, are still labor intensive.  Motors were created for good reason &#8211; ignore this basic concept at severe peril.  </p>\n<p>The inability to guarantee delivery dates in a time sensitive inventory economy because of ships that can be waylaid by weather and winds makes no business sense whatsoever.  Plus, as stated above, an infrastructure needs to be created.  I love tall ships and have sailed and crewed on them, but I am also a CPA and the economics don&#8217;t make sense at first blush.  Should the investment money being used for this experiment be used differently to maintain our existing fleets?  Should we repurpose the Peking after its voyage from NY to Hamburg to be leased for these purposes?  Is the money better spent elsewhere?  I don&#8217;t know &#8211; just asking the questions.</p>\n",
    "parent": 0
  },
  {
    "id": 425369,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2022-01-14T10:31:15",
    "content": "<p>Captain Hartmut Schwarz formerly master of SEA CLOUD and a Hamburg resident worked up a design for an advanced square rigged sailing ship some years ago but failed to fine the funding to get CAP HORN built although he had progressed the design through water tank and wind tunnel tests his design would have cost around E90.000 million to build but that was ten years ago, whether that project has finally died or is still alive I do not know, somewhere here I have files the captain sent me detailing such thingas as size, rig and construction,his model would have been somewhat bigger than the present proposal.</p>\n",
    "parent": 0
  },
  {
    "id": 425343,
    "author": "Norman de Vall",
    "authorUrl": "http://www.ggbs.us",
    "date": "2022-01-13T21:13:12",
    "content": "<p>Bill,<br />\nInteresting article; I commented with this:</p>\n<p>I worked as a Stevedore Superintendent from the 1960&#8217;s to the 1990&#8217;s.  They were the last years of gangs down the hatch loading<br />\nbag by bag, box by box or plunder from the tank tops to the<br />\nhatch comings.  Seatrain began loading containers in Oakland by<br />\n1963; Matson had their own container oporation in Alameda and<br />\nthe military, during the Vietnam war was using study boxes they called &#8220;connex&#8217;s&#8221;.  In the 1970&#8217;s I attempted to establish a longshore museum.  How these guys worked was fascinating, the gear they used (and how often it or ships&#8217; gear broke). and how much was hand work could and did fill books.  The longshore museum was not a success, it didn&#8217;t happen and soon the gear was scrapped.  In my view and with some decades of experience sailing cargo ships may be doable &#8211; as was the voyage of the SV FRI, the last sailing cargo ship from northern Europe to San Francisco in<br />\n1969 but the piers and docks of those days are gone: so are the Jitneys powered with Ford Model A engines and larger pushers, the rain tents, bar bridles and bins of rigging gear.  And so are the men.  Share your idea with Walking Bosses, Clerks, Gang Bosses, Coopers, and Frontmen; you<br />\nmay find the ship is the easiest part of this project.</p>\n",
    "parent": 0
  }
]