[
  {
    "id": 414913,
    "author": "Gordon Barnard",
    "authorUrl": "",
    "date": "2020-06-20T22:40:56",
    "content": "<p>My Father was one of the fortunate survivors from the HMT Lancastria.<br />\n  Believe he was picked up by a Destroyer &amp; taken to Wales.  One of the last to board the ship, he was blown off the bow into the sea. The sea was set afire by planes straffing the personnel.   It took 3 months to get the tarry oil out of his hair. It was not a subject he spoke much about, as with most Service Personnel.<br />\n   He had joined up Sept. 5th 1939 &amp; was a proud Patriotic Englishman, going back in 1944 &#8211; 1945. Transferring to UNRA &amp; UNESCO.<br />\n   Thank God we had people with that fortitude in those days.</p>\n<p>   Father :- William G. Barnard. SSM, R.A.S.C.</p>\n",
    "parent": 0
  },
  {
    "id": 414895,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-06-18T16:02:55",
    "content": "<p>My father Maurice Patrick Roche was a survivor he dived from an open boat deck some 60 feet up, it was the last time he dived although he swam for the Kent Police he never dived they tried to make him pulling a towel out from under his feet when there was a TV programme with Edgar Lustgarden called 25 years ago today dad sat shivering when a photo of the sinking ship appeared on screen as he at the same moment crushed the glass he was holding and said with glass fragments on the floor, I have to explain. He said that was the last time he dived and that just looking at water he would see it coming up to meet him. He said there were 9000 aboard, I have read that the count was stopped at 6000. Dad was brought back to England in a destroyer the figure evacuated from France was 558.000 around 200.000 from St Nazaire, Brest, St Malo and other of the smaller ports around Brittany, Dad was take to Didcot and some time after was loading penny parcels in Liverpool he was stowing antiaircraft gun barrels into the torpedo tubes of submarines for Malta.</p>\n<p>There were two songs being sung by men on the hull of the upturned ship the Andrews Sisters had released Roll out the Barrel &#8211; and the other was also released in 1939 There will always be an England `John West (compiler) wrote a book published in 1988 by Millgate Publishing of the actual memories of 30 men who were rescued he published it with their texts just as he collected them it makes chilling reading. Dad was with the expeditionary force a second time when he was sent to North Africa, he was at Monte Casino and in Rome.</p>\n<p>I was a member of the Lancastria society in its last days  when I met Stan Forrest  a survivor who said to me that &#8220;we were near Le Harve tearing down a beach hut we were going to come home like Robinson Crusoe on a raft then we heard there were ships but the put us on trains for St Nazaire they were trying to set up a new defence line you know and when the ship was struck by four bombs at 4.30 in the afternoon of the 17 June I was manning a bren gun shooting at the planes that dropped them.&#8221;</p>\n<p>By way of a note: Chief officer Harry Grattige had served his apprenticeship in sailing ships (S V Osborne) and went on to be a master of Queens he was one of my Cape Horners and sadly the Captain of `HMT Lancastria &#8216;Captain Sharp was also the master of the second worst loss of life in a British ship `Laconia&#8217; in 1942 he did not survive that sinking.</p>\n",
    "parent": 0
  },
  {
    "id": 414889,
    "author": "Alaric Bond",
    "authorUrl": "http://www.alaricbond.com",
    "date": "2020-06-18T02:39:54",
    "content": "<p>My father wrote what many consider the definitive account of the disaster during the course of which he interviewed many of the survivors. The book was well received but I know the process affected him greatly. Sadly the incident is often not remembered with the same reverence as victories, (or miracles such as Dunkirk).<br />\n<a href=\"https://www.amazon.com/Lancastria-Geoffrey-Bond/dp/B000OII852\" rel=\"nofollow ugc\">https://www.amazon.com/Lancastria-Geoffrey-Bond/dp/B000OII852</a></p>\n",
    "parent": 0
  }
]