[
  {
    "id": 420672,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-04-20T08:36:31",
    "content": "<p>A video came out about the difficulties of the ship ever given<br />\n<a href=\"https://www.youtube.com/watch?v=Ty-m4pm8oog\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=Ty-m4pm8oog</a><br />\nI hope it helps</p>\n",
    "parent": 0
  },
  {
    "id": 420625,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-04-17T19:33:56",
    "content": "<p>Thankyou for your policing Rick.  Too bad you cant remove the absurd fantasies.  Oh well.</p>\n",
    "parent": 0
  },
  {
    "id": 420576,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-04-15T09:49:12",
    "content": "<p>There were no animals aboard the Ever Given and the ship did not hit the bank at full throttle by all accounts. QAnon rumors are a waste of time.</p>\n",
    "parent": 0
  },
  {
    "id": 420569,
    "author": "Texty",
    "authorUrl": "",
    "date": "2021-04-15T02:26:05",
    "content": "<p>What do ya&#8217;ll make of the route taken just prior to entering the canal?<br />\nCould the navigation system have been hacked to ram the front in so deeply at full throttle?<br />\nWhat if some of the reported animals aboard were actually humans being trafficked?</p>\n",
    "parent": 0
  },
  {
    "id": 420558,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2021-04-14T09:54:02",
    "content": "<p>Willy your armchair speculating raises an excellent point.  However the SCA will never admit that it could be wrong!  As one can see from the &#8220;hostage&#8221; situation being used, once again, the SCA investigation will no doubt place all blame on the vessel and crew. There are two other vessels currently being held one for over a year and a half.</p>\n<p>Egyptian Law is based on the Napoleanic Code with both secular and religious courts.  Family Law is divided between Islamic, Christian and Secular courts. The Law plays an important part in Egypt&#8217;s political process which in turn is highly influenced by its religious authority.</p>\n<p>One might think that the attitude and behaviour of the SCA will in the long term work against itself. Shippers already encouraged by Russia will consider using the Northern Route with its excellent pilots and icebreaker escorts available already if needed.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 420557,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-04-14T07:54:18",
    "content": "<p>Unsure of how ships navigate the canal.  Yet if the ship required tugs to get through the canal.  Maybe it is the canal authority that is to blame for underestimating the amount of control required to steer the vessel.</p>\n<p>Just armchair speculating</p>\n",
    "parent": 0
  },
  {
    "id": 420556,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-04-14T07:50:29",
    "content": "<p>Oh joy.  The filter down effect will raise more costs.  We may not be paying for it now, yet we will in time.  Isnt life wonderful????</p>\n",
    "parent": 0
  },
  {
    "id": 420549,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-04-13T19:50:18",
    "content": "<p>Yeah, Rick. I was thinking more of joining other crews stranded on ships due to lack of rotation. But perhaps these were already in that jamb, come to think of it.</p>\n",
    "parent": 0
  },
  {
    "id": 420548,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2021-04-13T18:07:41",
    "content": "<p>Am I right that the cargo owner can insure against general average but if he doesn&#8217;t and refuses to cough up his cargo is forfeit?</p>\n",
    "parent": 0
  },
  {
    "id": 420547,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-04-13T16:04:02",
    "content": "<p>Doug, my guess is that the crew will be OK. The ship is owned by Shoei Kisen Kaisha, Ltd., chartered to Evergreen Marine and managed by the German ship management company Bernhard Schulte. The claims are being made against the owner. At least so far, the ship manager and the crew hired have not been party to the various lawsuits.</p>\n",
    "parent": 0
  },
  {
    "id": 420546,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-04-13T14:30:19",
    "content": "<p>One wonders if the crew will become yet another held hostage by our spate of misfortunes.</p>\n",
    "parent": 0
  },
  {
    "id": 420543,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2021-04-13T11:24:41",
    "content": "<p>From a friend:<br />\n&#8220;The cargo owners will have insurance so eventually if general avg is proven, and not negligence or any other culpability it will all come back to the insurers. I guess that a priori, they have to prove that it was an accident and not the fault of the ship and its operators.&#8221;</p>\n",
    "parent": 0
  }
]