[
  {
    "id": 420346,
    "author": "John",
    "authorUrl": "",
    "date": "2021-03-31T14:18:08",
    "content": "<p>It seems to me that the Jumbo Containers may require a 2 Tug escort thru the narrow sections of the Suez.Looking at the canal where the Ever Given had gotten wedged was so narrow&#8230;it reminded me of  the narrow C &amp; D Canal in the upper Chesapeake Bay which connects with the Delaware River.</p>\n",
    "parent": 0
  },
  {
    "id": 420344,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-03-31T11:21:29",
    "content": "<p>A lot of attention has been paid to the ship&#8217;s considerable length. Another factor that probably played a role was the beam of the ship. The ultra-large container ships are relatively beamier than traditional smaller container ships. The Ever Given has an L/B ratio of 6.8 vs an older Panamax container ship with an L/B ratio of over 9. The larger, boxier ship is harder to steer in a narrow channel.</p>\n<p>Another consideration is tug assist. The two ships that preceded the Ever Given through the canal both had tug escorts, which are not required but could have made a difference in crosswinds.</p>\n<p>Finally, speed. The Ever Given was operating at 13.5 knots just before grounding. While higher speeds can improve maneuvering (or not depending on the ship and the canal size), it also increases the impact if something goes wrong. The kinetic energy of the ship going at 13.5 knots is 285% higher than the ship traveling at the Suez speed limit of 8 knots.</p>\n",
    "parent": 0
  },
  {
    "id": 420342,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2021-03-31T10:30:25",
    "content": "<p>Bonjour Jean-Pierre, valid point.  However I would caution using positions taken from AIS in narrow waters.  Any increase of speed above the SCA speed limit would be on pilots advise to the Master.  These ships are really to big for transit without tug escort fore and aft, one would suggest a review by SCA. Perhaps trained SCA helms persons for ships above a certain tonnage would also be helpful.<br />\nAs to Ron&#8217;s comment, what problems are you referring too?  These ships are signed off on by international authorities prior to shipping companies building them.  When you are carrying 20,000 TEU&#8217;s with a crew of 25 the operating costs are greatly reduced rather than using smaller TEU capacity vessels with the same number of crew with increased costs passed on to consumers.<br />\nThere are other routes such as around South Africa and the Northern Route promoted by Russia with excellent pilots and Russian icebreaker escort as/if required.</p>\n",
    "parent": 0
  },
  {
    "id": 420340,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-03-31T07:37:22",
    "content": "<p>@D.Peter Boucher<br />\nWould a possible reason for the excess speed be trying to maintain steerage way in the strong cross winds? After coming through the dog-leg she did seem to be very close to the port bank on the AIS.</p>\n",
    "parent": 0
  },
  {
    "id": 420329,
    "author": "Ron Wilkinson",
    "authorUrl": "",
    "date": "2021-03-30T18:22:13",
    "content": "<p>These boats are too big. They are problematic on the high seas other than a canal. Maybe those shipping firms learned a lesson along with the regulating agencies.</p>\n",
    "parent": 0
  },
  {
    "id": 420328,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2021-03-30T17:52:35",
    "content": "<p>One hopes the investigation will find out what happened as there are indications that the Ever Given was exceeding the SCA speed limit for Canal transit.  This of course should have been corrected by the pilots of which it was stated by SCA two were onboard.  They are the specially trained Watchofficers advising the Master who remains in Command. One suspects the whole incident could stem from a steering error coupled with excessive speed in difficult weather conditions.  Having been a helmsman, Navigation Officer and Chief Officer through both the Suez and Panama Canals Bridge communications can at times be difficult.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 420326,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-03-30T13:49:32",
    "content": "<p>The bank effect could have played a role but might have been reduced by the 4:1 slope in the canal bottom.</p>\n",
    "parent": 420325
  },
  {
    "id": 420325,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-03-30T12:36:56",
    "content": "<p>Looking at the AIS track i would say she had a bank effect &#8220;tank slapper&#8221;. Those of you who follow motorcycle racing should have heard the term.</p>\n",
    "parent": 0
  },
  {
    "id": 420323,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://not%20applicable",
    "date": "2021-03-30T11:02:38",
    "content": "<p>Now for many years in Maritime Court.  Maritime Law is a complex subject and was one of the Nautical Science courses I taught for a couple of years after retiring from a 50 year sea-going career.<br />\nThis included two years on the New Zealand coast in the late 1950&#8217;s the TSS Tamahine was my first ship on arrival which Joan Druett will remember no doubt.  Her remark on &#8220;tax dodging&#8221; really has nothing to do with the grounding.  All nations Panama included tax shipping and in many, particularly those of the socialist approach, it is a heavy burden. Remember by reducing the operational costs of a ship reduces overall costs and therefore the cost of goods to the consumer so much of which comes from Asia including New Zealand one of the most remote nations.<br />\nAs to the slight list I believe this is from the stress of the angular towing off the canal bank it does not show up in later Egypt TV videos from the Bitter Lakes.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 420312,
    "author": "Joan Druett",
    "authorUrl": "",
    "date": "2021-03-29T22:37:27",
    "content": "<p>Thank you for the image that shows the vessel&#8217;s actual name!  It seems odd that the ship is registered in Panama when the Evergreen Company is in Taiwan, but I suppose tax dodging might be the reason.  Pity the ship couldn&#8217;t dodge the flaw in the tide or wind or steering or whatever that sent her embarrassingly skewed around.</p>\n",
    "parent": 0
  },
  {
    "id": 420306,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-03-29T16:28:39",
    "content": "<p>Congrats.  Now to right her from the list she has.</p>\n",
    "parent": 0
  },
  {
    "id": 420305,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2021-03-29T15:58:38",
    "content": "<p>Few realise how complicated a job this has been and respect to Boskalis for achieving it.</p>\n",
    "parent": 0
  }
]