[
  {
    "id": 407913,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2018-11-10T16:20:28",
    "content": "<p>When it comes to saving anything for future generations it comes down to ease ant to the will to save, modern mankind has not been good at saving industrial heritage if a building is left for 40 years untouched it can be brought back to life more easily than say a ship or industrial process maker. I have friends struggling to reconnect a canal link  known as the Stafford Link to Stafford centre they have only to cross two small rivers and a field but are finding it a struggle to fund the £6m it will cost, Ships are another matter, particularly when remotely located. The Iron Ship `Duchess of Albany&#8217; 1884-1893 laying where she came to grief was seen by myself in 1992 on the bleak shore of Tierra del Fuego, I could see the vision of what could be done with her intact bow but the Liverpool maritime museum could not, had they seen that part of her as their frontispiece she could have graced the  museum entrance. She was after all built in the city by Messrs Thomas Royden. </p>\n<p>It will be a tragedy if therefore the once magnificent `Falls of Clyde&#8217; cannot be saved to the river that gave this four mast ship her name she has languished in Hawaii at Oahu where the powers that be should have saved her for as I said future generations, it was not entirely lack of funding that brought about her trials there, the Bishop Museum were given State and Government funding for preservation funding that was not spent as it should have been on the ship. The late Jack Whitehead oversaw a full  restoration of her woodwork for the museum at a time when the then management was more enlightened than those who wasted further funding. Her rig was largely destroyed, gas axed and left on the dockside to save maintenance and prepare her for sinking as a dive reef. The is hope as long as she remains afloat and David O`Neil in Glasgow has to be given credit for his and his groups persistence. I support them in that and although I do not do facebook remain in touch by email these guys need all the help they can get and should be supported, if indeed they have the good will of a heavy recover ship business then this rescue will be much akin to the efforts made to bring the `Great Britain&#8217; back from the South Atlantic and not much short of a miracle. </p>\n<p>I salute their efforts both in vision and scope and hope that there are many who will do the same and donate to the cause.</p>\n<p>Chris</p>\n",
    "parent": 0
  },
  {
    "id": 407885,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-11-08T12:41:48",
    "content": "<p>What is it about ships that touches our souls so as to inspire such fanatical preservation efforts as this? </p>\n<p>Many of us would walk through fire to save a painting, others the same for a ship. </p>\n<p>Special privileges reserved only for art intended purely for enjoyment, and for machines created for entirely prosaic purposes. </p>\n<p>There must be some correlation of joy in our minds between the two. Hmm.</p>\n",
    "parent": 0
  }
]