[
  {
    "id": 442576,
    "author": "Erik Abranson",
    "authorUrl": "",
    "date": "2025-07-06T14:17:04",
    "content": "<p>This is not a comment on this particular post but concerning Old Salt Blog&#8217;s use of «follow.it» for distribution of its news items. This is no criticism of Rick Spilman and other contributors to the blog contents but a reaction about follow.it. For while now those quasi-daily mails have become aggravated spam and click bait. Faced with information overload and increasingly fussy and multiple-step logging-in procedures (especially when one is adverse to yielding personal info and being scraped and squeezed by advertisers and Big Brothers), I like emails arriving in my inbox to have an explicit subject line allowing preliminary weeding. It never was so with Old Salt Blog&#8217;s use of follow.it where the inbox display listing has always been:<br />\nfollow it  &#8211;  oldsaltblog.com – new message<br />\nbut clicking to display the mail used to display the WHOLE article, title and text. I do not have the time to read every blog mail and am only particularly interested in those dealing with traditional sailing vessels, &#8220;tall ships&#8221;, historical vessels and the like.<br />\nAt the foot of the mail there was a small ad for follow.it and its services.<br />\nThen follow.it started truncating the blog text, ending it with a link &#8220;Continue Reading&#8221; and an advertising plug for follow.it.<br />\nIF the article was of interest, clicking &#8220;Continue Reading&#8221; DID NOT SEND THE READER TO THE OLD SALTBLOG.COM PAGE but to a sponsored ad page on the follow.it site, at the foot of which  appeared a link &#8220;Go to article—Don&#8217;t want to see ads and get taken directly to the publisher&#8217;s page? Upgrade to the &#8220;Hello&#8221;-plan for only 3 USD/month&#8221;. That is spam.<br />\nFor a while now, there is not even the blog article title and first few lines, just &#8220;follow.it New updates! &#8212; Click to read&#8221; and the self-advertising ads for follow it.<br />\nClicking sends to a page on follow.it with the Blog&#8217;s release title and truncated text and advertising ending with, finally a link to the blog&#8217;s whole post.<br />\nNow follow.it is purely riding on the back of Rick&#8217;s and other voluntary contributors to the Old Salt Blog. I am not &#8220;upgrading&#8221; to the &#8220;HELLO&#8221;-plan but saying GOOD-BYE.<br />\n I am cancelling my subscription to follow.it<br />\nI shall of course still being visiting directly the Oldsaltblog.com home page from time to time, but this is prone to lapses and is not as convenient as being notified of interesting posts on the day they are published, especially &#8220;hot news&#8221; with lively comments. Actually, even before unsubscribing from the parasitic follow.it mailing list, the click-baiting strategy was already leading to lengthy delays in opening those click-baiting mails,  skipping them for infrequent quiet days.</p>\n",
    "parent": 0
  }
]