[
  {
    "id": 415152,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-07-15T03:55:30",
    "content": "<p>Would bulkhead doors would have been wedged open with cables running through them preventing their closure? The ultimate nightmare.</p>\n",
    "parent": 0
  },
  {
    "id": 415147,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-07-14T13:36:37",
    "content": "<p>As usual Maritime Executive have published an excellent report which ends with:<br />\n&#8220;The devastating extent of the fire raises questions about the 22-year-old vessel&#8217;s future and the cost-effectiveness of a restoration. A replacement built to the more modern America-class amphib design would cost roughly $4 billion. </p>\n<p>Long before the fire, the Navy had discussed accelerating the procurement of the next planned America-class amphib (LHA-9) to FY2023. However, a tranche of $650 million in early  funding for that purpose has been diverted for &#8220;DHS counter-drug activities, commonly reported to mean the construction of the southern border wall,&#8221; according to the Congressional Research Service.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 415146,
    "author": "ws",
    "authorUrl": "",
    "date": "2020-07-14T09:15:59",
    "content": "<p>This looks like 1942, SS Normandie, pier 88 NYC..</p>\n",
    "parent": 0
  },
  {
    "id": 415141,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-07-13T16:27:23",
    "content": "<p>They will rebuild, but the ship is cursed!<br />\nThe fire is a warning!</p>\n",
    "parent": 0
  },
  {
    "id": 415140,
    "author": "Ben",
    "authorUrl": "",
    "date": "2020-07-13T16:23:52",
    "content": "<p>Doesn&#8217;t look good. On the active carriers I was on we had fast response fire parties mustered pretty much all the time. When you are in port for maintenance response is harder. With all the electronics now, I can see how damage can happen.</p>\n",
    "parent": 0
  },
  {
    "id": 415139,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-07-13T15:51:13",
    "content": "<p>Burn, no. Melt, yes!</p>\n<p>Steel is just the element iron that has been processed to control the amount of carbon. Iron, out of the ground, melts at around 1510 degrees C (2750°F). Steel often melts at around 1370 degrees C (2500°F).</p>\n",
    "parent": 0
  },
  {
    "id": 415138,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-07-13T15:23:17",
    "content": "<p>Steel doesnt burn (unless you get it to 6000F degrees).<br />\nWell it is one way to retire the boat with out the POTUS&#8217;s help.<br />\nTho some how wiith the economy where it is.  I doubt there would be a replacment</p>\n",
    "parent": 0
  },
  {
    "id": 415137,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-07-13T15:17:30",
    "content": "<p>A local fire official indicated that it might well &#8220;burn to the waterline,&#8221; meaning I guess that it&#8217;s too risky to contain. 🙁</p>\n",
    "parent": 0
  }
]