[
  {
    "id": 415266,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-07-26T13:11:59",
    "content": "<p>@Albert Pasay, I&#8217;ve also seen GPS that looked just like that.</p>\n",
    "parent": 0
  },
  {
    "id": 415262,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-07-26T05:36:07",
    "content": "<p>Our Cape Horner Jan Wit a Dutchman did this in 1989  he left and arrived Falmouth he carried a 12 meg VHF radio to speak to ships, he was spoken 5 times in 273 days at sea. Jan said he wanted to do this in the old way. By the way he and his father in law built the yacht in the garden out of steel. No internet then!<br />\nWe at <a href=\"http://www.capehorners.org\" rel=\"nofollow ugc\">http://www.capehorners.org</a> welcome new member applications from those who race and those who do not but cruise be it yacht or square rigger. </p>\n<p>Remembering the traditions of the old ways</p>\n<p>Chris  CH archivist</p>\n",
    "parent": 0
  },
  {
    "id": 415247,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-25T15:49:21",
    "content": "<p>It all comes down to definitions. Joshua Slocum was the first person to sail around the world alone. It took him three years and he made many intermediate stops. Bert terHart is claiming the title of first non-stop solo North American circumnavigator using traditional celestial navigation. So, there are at least three qualifiers to his assertion. Nevertheless, he made it around the globe alone.</p>\n",
    "parent": 415245
  },
  {
    "id": 415245,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-07-25T15:38:07",
    "content": "<p>May I just put in a word for Joshua Slocombe who did this in 1895?</p>\n<p>He was born in Nova Scotia, which according to my very old, 1970s, atlas was in North America.</p>\n<p>&#8220;I had resolved on a voyage around the world, and as the wind on the morning of April 24, 1895 was fair, at noon I weighed anchor, set sail, and filled away from Boston, where the Spray had been moored snugly all winter. The twelve o&#8217;clock whistles were blowing just as the sloop shot ahead under full sail. A short board was made up the harbor on the port tack, then coming about she stood to seaward, with her boom well off to port, and swung past the ferries with lively heels. A photographer on the outer pier of East Boston got a picture of her as she swept by, her flag at the peak throwing her folds clear. A thrilling pulse beat high in me. My step was light on deck in the crisp air. I felt there could be no turning back, and that I was engaging in an adventure the meaning of which I thoroughly understood.&#8221;</p>\n<p>Great reading and inspiring for any yachtsman.</p>\n<p>And that before Instagram and all the other &#8220;social media&#8221; bull. His book about it became a best seller which no doubt &#8220;Bert erHart&#8221; laughed at whilst looking at his AIS, EPIRB, VHF selcall, satellite weather predictions etc etc etc.</p>\n",
    "parent": 0
  },
  {
    "id": 415241,
    "author": "glenwood weather",
    "authorUrl": "https://www.glenwoodwashington.info",
    "date": "2020-07-25T11:34:51",
    "content": "<p>Thank you for this article.</p>\n",
    "parent": 0
  },
  {
    "id": 415236,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-07-25T06:53:18",
    "content": "<p>I missed the adventure 🙁<br />\nIt probably saved me a lot of worry and stress 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 415225,
    "author": "Albert Passy",
    "authorUrl": "",
    "date": "2020-07-24T16:14:55",
    "content": "<p>@phil &#8211; that&#8217;s a radar radome.</p>\n",
    "parent": 0
  },
  {
    "id": 415224,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-07-24T14:52:44",
    "content": "<p>I guess he just ignored the equipment he has installed?<br />\nWe can see the antenna in the photo.</p>\n",
    "parent": 0
  }
]