[
  {
    "id": 415341,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-08-02T03:41:58",
    "content": "<p>As one can see in the video, the ship&#8217;s engines are being run hard right until she takes the ground. They&#8217;re driven, not towed (what sort of tug could crawl up onto land to tow a ship onto the beach?) Of course there&#8217;s a crew on board, including a skipper.  </p>\n<p>Look carefully at these films and you can often see radar antennas sweeping per regulation&#8211; right up until the last moment. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 415338,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-08-01T19:43:03",
    "content": "<p>@ Doug, those ships are towed there, I doubt the skipper is even in the area.</p>\n",
    "parent": 0
  },
  {
    "id": 415335,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-08-01T18:35:10",
    "content": "<p>At thirty years old I would imagine that maintenance costs are escalating depending on when they last had a refit. As soon as they don&#8217;t have paying customers they become a heck of a liability especially if they were trying to keep them up to scratch for the anticipated but sadly delayed upturn.</p>\n",
    "parent": 0
  },
  {
    "id": 415333,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-08-01T16:18:56",
    "content": "<p>Refining Willy&#8217;s idea and addressing Denis&#8217; points, it seems as though it would be possible to dock such as ship, attach it to shore facilities.</p>\n<p>Leaves a lot of unsolved problems regarding fire safety and other matters incorporated in rules pertaining to ships, plus some practicalities.</p>\n<p>But (at least temporarily) better than on a grate, beneath a bridge, or trying to live in a car? </p>\n<p>In terms of thinking about net results an interesting idea to ponder.</p>\n",
    "parent": 0
  },
  {
    "id": 415332,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-08-01T16:13:10",
    "content": "<p>It must be very strange as a skipper to plot a course ending like this example.</p>\n",
    "parent": 0
  },
  {
    "id": 415328,
    "author": "Denis Peter Boucher",
    "authorUrl": "http://Formerly%20Nautical%20Log%20no%20longer%20published",
    "date": "2020-08-01T08:37:24",
    "content": "<p>Interesting idea Willy.  However between all the IMO, USCG regulations not to mention the Seamans Unions this would never be workable.  Then of course there are politics and funding.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 415325,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-08-01T04:20:45",
    "content": "<p>I see this as a waste.  With all the homeless that are out there.  If one of these were beached near a city with a high homeless population.  The homeless could be allowed to move on and be able to stop cluttering the streets.  Train them on how to maintain the ship.  Let them do crowd funding to get resources to fuel the generators.  It could give them a way out of the misery they are in because of the way society is now.</p>\n",
    "parent": 0
  }
]