[
  {
    "id": 417823,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-11-23T16:40:48",
    "content": "<p>We obviously will agree to disagree. As I suggested before, &#8220;If this is the sort of movie you, you may like this movie.&#8221;</p>\n",
    "parent": 417724
  },
  {
    "id": 417724,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-11-19T15:56:16",
    "content": "<p>Rick,not only have I seen the movie, I have the, very much treasured, CD.<br />\nThe movie was nominally set in 2010 but was filmed in 2017, 2018. The death of the band member in the film was &#8220;artistic license&#8221; for the deaths of two of their most important, and loved, people who had been involved from early days. A large roller shutter door ending their lives would not have fitted in with the story or the ROMCOM style of the movie but the band members and the script writers wanted the tragedy to be represented.</p>\n",
    "parent": 0
  },
  {
    "id": 417721,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2020-11-19T12:40:17",
    "content": "<p>Old Salt, I always enjoy your film reviews. You are a tough critic but that’s what I appreciate. A review is different than a blurb or endorsement. To hear the men sing South Australia and New York Girls, and to see sights of Cornwall might be worth the price for me.<br />\nI always thought you were a little harsh on your review of Robert Redford’s All is Lost (2013)  but your analysis compelled us to view the film. Keep ‘em coming!</p>\n",
    "parent": 0
  },
  {
    "id": 417720,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2020-11-19T10:03:29",
    "content": "<p>RomCom is a genre, not a value judgement.  It&#8217;s formulaic, but so is The Cosy Mystery, The Tart with the Heart, The Man Who Survives, The Intruders from Space, The Star Crossed Lovers &#8230; The Midshipman who makes it all the way to Admiral.  The genre is a formula, as is a sonnet, a concerto, a portrait, a landscape.  Individual examples can be done well, or badly.  Personally, I enjoyed Fisherman&#8217;s Friend, and Local Hero, but I think that has a lot to do with the fact that they are RomComs that focus on a man transformed by love, unlike some of the RomComs I&#8217;ve sat through with my wife that are focused on the woman, as in Pretty Woman and You&#8217;ve Got Mail, which are first class examples of the genre.</p>\n",
    "parent": 0
  },
  {
    "id": 417718,
    "author": "Des Kerrigam",
    "authorUrl": "http://hmsgangesassoc.org",
    "date": "2020-11-19T08:58:58",
    "content": "<p>Just about to view for the THIRD TIME&#8230;&#8230;&#8230;&#8230;&#8230; Proper Job 🙏⚓️</p>\n",
    "parent": 0
  },
  {
    "id": 417707,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-11-18T20:35:59",
    "content": "<p>&#8220;Local Hero.&#8221; Just looked it up and now it&#8217;s on the list. Thanks, Rick!</p>\n",
    "parent": 0
  },
  {
    "id": 417703,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-11-18T18:21:54",
    "content": "<p>I look forward to your take on the movie. My favorite romcom from the Uk was Local Hero from 1983, although that was set in Scotland and not Cornwall.</p>\n",
    "parent": 417702
  },
  {
    "id": 417702,
    "author": "David Davies",
    "authorUrl": "",
    "date": "2020-11-18T18:14:39",
    "content": "<p>Rick, I&#8217;m distinctly ashamed to say that I, as a Brit who once lived in Cornwall, haven&#8217;t yet seen this film but you have! I&#8217;ll rectify this ASAP to see if I agree with your review. But it&#8217;s certainly true to say that romcoms from these parts are either superb or absolutely atrocious, rarely anywhere in the middle&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 417701,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-11-18T18:05:32",
    "content": "<p>So you obviously have not seen the movie. Yes, the original group was and is very real. That being said, the 2013 stage accident which killed two people had absolutely nothing to do with the movie, set nominally in 2010. The death of the oldest member of the group in the movie, from natural causes, was one of the lesser plot points in a completely formulaic screenplay.</p>\n",
    "parent": 417699
  },
  {
    "id": 417699,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-11-18T17:55:29",
    "content": "<p>I hate to kick your bricks over but the movie is based on very real and very tragic events which were heavily sanitised to make them more palatable. Never let the truth get in the way of a good story. The original people were very real.</p>\n<p>This is the true story of the death which, to attract audiences, was heavily edited to cause least offence and truth.</p>\n<p><a href=\"https://www.cornwalllive.com/news/five-years-tragedy-fishermans-friends-1187404\" rel=\"nofollow ugc\">https://www.cornwalllive.com/news/five-years-tragedy-fishermans-friends-1187404</a></p>\n",
    "parent": 0
  }
]