[
  {
    "id": 422336,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-07-27T07:53:19",
    "content": "<p>The correct signal for vessels under sail in fog (visibility less than one sea mile) is three blasts (one long and two short) of the horn at not more than two minute intervals.<br />\nThe signal is, by the way, Morse D &#8220;keep clear of me &#8211; I am manouvering with difficulty&#8221;<br />\nMeanwhile, the monitor on my applemac is flashing code U at me (you are running into danger) &#8211; not sure what that is all about as it is stationary in my office 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 422328,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2021-07-26T20:11:02",
    "content": "<p>I sailed on the Tovaritsch from NY to Boston in 1992.   At one point we were in a dense fog and the skipper insisted on close watch and constant sounding of the horn as tall ships emit a strange image on the radar screen and curious ships close in to see what it is.  Anything helping to define what the ship is can only bolster safety for all.</p>\n",
    "parent": 0
  },
  {
    "id": 422314,
    "author": "Cathy Shelbourne",
    "authorUrl": "http://www.seashellcommunications.co.uk",
    "date": "2021-07-26T10:32:50",
    "content": "<p>I&#8217;m thrilled that my Monumental Maritime Heroes playing cards are available on board the world&#8217;s largest square-rigged sailing ship! Giants together.</p>\n",
    "parent": 0
  },
  {
    "id": 422304,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-07-26T04:32:58",
    "content": "<p>I&#8217;m sure that having all those lights on the rig is not in compliance with colregs.<br />\nI can imagine skippers of other vessels being called to the bridge because the lookout is confused by a &#8220;large Christmas tree&#8221; in the shipping lanes.<br />\nIt is bad enough that you can&#8217;t see the port and starboard lights (because of all the cabin/deck lights) on normal cruise ships to ascertain which way they are going without this new addition to the confusion for small vessels&#8217; crews.</p>\n",
    "parent": 0
  }
]