[
  {
    "id": 407208,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-09-21T18:26:44",
    "content": "<p>I had no idea. </p>\n<p>What was a day at work like, on this vessel?</p>\n<p>Makes me wish more of our governmental bits ran oral history programs along the lines of NASA (worth visiting history.nasa.gov, punching &#8220;oral history&#8221; into the search box).</p>\n",
    "parent": 0
  },
  {
    "id": 407196,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-09-20T16:20:01",
    "content": "<p>The days of the newspaper reporter wearing a fedora, smoking cigarettes, drinking booze, and pounding out a story on the manual typewriter are long gone. Alas, blogs like Old Salt Blog furnish us with the news, that All of the Main stream media are overlooking!<br />\nMany Thanks!</p>\n",
    "parent": 0
  },
  {
    "id": 407190,
    "author": "Stretch",
    "authorUrl": "",
    "date": "2018-09-19T22:57:56",
    "content": "<p>Dad was an Engineer officer.<br />\nSomewhere in his &#8220;stuff&#8221; I&#8217;ve seen overhead slides (remember them?) of this vessel.  I&#8217;ll try to find them and copy/forward them to you</p>\n",
    "parent": 0
  },
  {
    "id": 407188,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-09-19T18:51:40",
    "content": "<p>Now There are (5) FIVE Surviving Liberty Ships: Sturgis, John W. Brown, Jeremiah O&#8217;Brien, Arthur M. Huddell, Albert M. Boe..</p>\n<p>Sturgis was built after the catastrophic 3 January 1961 meltdown of the Army&#8217;s 3 MW SL-1 Land Based Nuclear reactor..<br />\n<a href=\"https://en.wikipedia.org/wiki/SL-1\" rel=\"nofollow ugc\">https://en.wikipedia.org/wiki/SL-1</a>..</p>\n",
    "parent": 0
  },
  {
    "id": 407182,
    "author": "Andy Hall",
    "authorUrl": "",
    "date": "2018-09-19T10:54:49",
    "content": "<p>It was funny, when the original announcement was made that she was coming here for dismantling of her reactor, a lot of folks set their hair on fire about it. Then it quieted down and a few months later she arrived, to cirtually zero public notice. She&#8217;s been over there [points] for three years now, and I doubt one in a hundred of my neighbors has any idea.</p>\n",
    "parent": 0
  }
]