[
  {
    "id": 409550,
    "author": "glenwood weather",
    "authorUrl": "https://www.glenwoodwashington.info",
    "date": "2019-02-20T19:16:08",
    "content": "<p>Glad you find that amusing.  I am not so sure I am so much a supporter of our President as I am someone who wishes our news sources would try and do truthful research in their reporting rather than looking for any reason to promote something negative about our President.<br />\nAnyway,&#8230;  I have been doing some research for a short article about people of color in our area here on the west coast.  One of the early pioneer ladies in our community was a &#8220;woman of color&#8221;, even though she was less than half black.  But I don&#8217;t have much information about her.<br />\nLinda mentions a day when we will no longer have a need for special months to honor people of color, but first we have to get beyond what our eyes see.  Frederick Douglass, just as our former President, was the product of a white parent and a black parent, but we only see one color.  For Douglass, that was enough to condemn him to slavery.<br />\nPresident Obama&#8217;s mother grew up in the Seattle, Wa. area, but she wasn&#8217;t black so that wouldn&#8217;t work.<br />\nWhen I read your blog about Douglass, I had been researching<br />\nHenry Villard,  a well known name in the history of Portland, Oregon for his work with the railroads, shipping and grand buildings.    <a href=\"https://oregonencyclopedia.org/articles/villard_henry_1835_1900_/#.XG3N0S3Myqk\" rel=\"nofollow ugc\">https://oregonencyclopedia.org/articles/villard_henry_1835_1900_/#.XG3N0S3Myqk</a><br />\nVillard was married to the daughter of abolitionist  William Lloyd Garriison who was at one time a  mentor and friend of Frederick Douglass.  I thought some of the readers might enjoy this blog about Garrison and Douglass.  Some good research but no mention of Douglass&#8217;s love of the sea, nor that Garrison was the son of a merchant sailing master.  The Owlcation.   <a href=\"https://owlcation.com/humanities/William-Lloyd-Garrison-and-Frederick-Douglass\" rel=\"nofollow ugc\">https://owlcation.com/humanities/William-Lloyd-Garrison-and-Frederick-Douglass</a>   There are other articles out there that discuss Douglass&#8217;s and Garrison&#8217;s disagreements about the Constitution and slavery.<br />\nSorry for this being so long.</p>\n",
    "parent": 0
  },
  {
    "id": 409521,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2019-02-19T14:58:25",
    "content": "<p>Frederick Douglass&#8217;s books are amazing and powerful stories; his connection to the sea is legendary. Thanks for posting this highlight. I long for the day when we will no longer need to have special months to honor people of color and women, but their names and their contributions and their stories will be fully woven into collective memory.</p>\n",
    "parent": 0
  },
  {
    "id": 409517,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-02-19T12:27:45",
    "content": "<p>Being called &#8220;bitter and hateful&#8221; by a Trump supporter is amusing. </p>\n<p>Trump demonstrated his ignorance of who Frederick Douglass was by saying “Frederick Douglass is an example of somebody who’s done an amazing job and is getting recognized more and more, I notice.&#8221; The fact that he made these ignorant comments at a Black History Month event only reinforces the point.</p>\n",
    "parent": 409514
  },
  {
    "id": 409514,
    "author": "glenwood weather",
    "authorUrl": "https://www.glenwoodwashington.info",
    "date": "2019-02-19T10:53:35",
    "content": "<p>A wonderfully written article that brought Frederick Douglass alive for the readers.<br />\nI am sorry that it had to end with a bitter and hateful &#8220;implied&#8221;  ending from a bitter and hateful news source, with no mention of the signing into law the &#8220;Frederick Douglass Bicentennial Commission Act&#8221;.  </p>\n<p><a href=\"http://www.douglassbicentennial.org\" rel=\"nofollow ugc\">http://www.douglassbicentennial.org</a></p>\n",
    "parent": 0
  },
  {
    "id": 409511,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-02-19T08:55:07",
    "content": "<p>A breath of fresh air.<br />\nThankyou for this article Rick</p>\n",
    "parent": 0
  }
]