[
  {
    "id": 417875,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-11-24T18:30:34",
    "content": "<p>I am afraid that often in the UK restoration is in short not done properly, the CUTTY SARK is a prime example of that I could explain from experiencing in some detail my contact with the last captain she had he was not in any way consulted, GLENLEE is another example example of the practice as is the frigate HMS FOUDROYANT where steel masts were made up, HMS WARRIOR does not carry the correct rig her fibre glass yards are made to the spec used on a frigate of the period again looking good to tourists but could not power a ship of her size. On the other hand the latest pictures of the PEKING in Germany show that no expense was spared in her excellent restoration. My friend the late Captain Adrian Small who served his apprenticeship in PASSAT said of her restoration all she needs is a suit of sails which seem to be missing. On the down side he said that his bunk space had been turned into an office. Chris</p>\n",
    "parent": 0
  },
  {
    "id": 417821,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-11-23T16:38:53",
    "content": "<p>The missing rigging is pretty obvious. In NYC at the South Street Seaport, they did something similar in the initial restoration of the Wavertree. If I am not mistaken, the missing yards were replaced with flagpoles, which could never be used to carry sail but looked OK from the deck if you squinted.</p>\n",
    "parent": 417819
  },
  {
    "id": 417819,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-11-23T16:18:06",
    "content": "<p>In north-western Spain at Ferrol I was able to gain an invite to enter the naval base where I was able to see photograph and inspect the Glenlee ex Isla Mount figure head. Still in good condition and well maintained I was some years ago at the site you see in your photograph where the barques restoration was started. It has to be said that as she is today there is a long way to go with the rigging before she looks anything like a great restoration since it was decided not to fully replace and restore all the rigging as such the casual visitor will not see her as she would have looked in 1896 and that is a shame.</p>\n",
    "parent": 0
  },
  {
    "id": 417815,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-11-23T15:20:19",
    "content": "<p>Thanks for posting this, she is in my backyard. Can I give a big shout out for the myriad of volunteers who made her repatriation, refurbishment and display possible, she is a truly must see attraction if you are visiting Glasgow.</p>\n",
    "parent": 0
  }
]