[
  {
    "id": 420060,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2021-03-08T14:22:15",
    "content": "<p>Farley Mowat in WestViking argued that superior mirages were deliberately used by Vikings in plotting a course from island to island when the next landfall was beyond the horizon, as is the case between Iceland and Greenland, and Greenland and Newfoundland.  They climbed hills or mountains to ascertain that there indeed was land and to confirm their course to steer. The phenomenon is not as rare as suggested in the article and video. I did not credit it until I saw a many times magnified image of a cruise ship appear over the horizon, grossly out proportion to what could be expected normally.  Just as Mowat said, I was essentially looking OVER the horizon through a lens of air.</p>\n",
    "parent": 0
  },
  {
    "id": 420059,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-03-08T10:54:13",
    "content": "<p>Wow Mike that must have been amazing<br />\nI was surprised to see the coast of France when I climbed to the top of the old Dungeness lighthouse a distance of about 50 miles.<br />\nAlso, there is a saying in Calais (where the two coasts are much closer) that if you can&#8217;t see England it is because it is raining and if you can see England it is going to rain.</p>\n",
    "parent": 0
  },
  {
    "id": 420057,
    "author": "Mike",
    "authorUrl": "",
    "date": "2021-03-08T07:00:37",
    "content": "<p>Sitting on the pebble beach at Hastings, on the English south coast, about two feet above sea level, we suddenly realised that we could clearly see the coast of France, about fifty miles away. Every tree, hedge ,field, building, as if it were just across a little river estuary. Astonishing. I later read that this had been recorded in the past as a notable event, with the townspeople hurrying down to the seafront to witness it. It certainly wasn&#8217;t April 1st. A fairly common sight to see ships flying like this but not whole stretches of a distant land.</p>\n",
    "parent": 0
  },
  {
    "id": 420055,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-03-07T22:45:27",
    "content": "<p>Would have been better if posted on April 1st</p>\n",
    "parent": 0
  },
  {
    "id": 420054,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-03-07T22:44:21",
    "content": "<p>If only it were true and not a distortion</p>\n",
    "parent": 0
  }
]