[
  {
    "id": 409139,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-27T09:18:46",
    "content": "<p>Oxford dictionary defines discover as &#8220;to find unexpectedly or during a search&#8221; so yes, the place may have already been known about by others.<br />\nThe use of the word first should be qualified, eg with Brit or European.<br />\nNobody in my circle of friends complains when I tell them I have discovered a great pub. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 409128,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-01-26T14:36:34",
    "content": "<p>Yeas, Flinders was far sighted in taking him on the journey where the arrogance of many explorers would not have allowed it.</p>\n<p>Cook &#8220;discovered&#8221; Australia in much the same way as the several claimants &#8220;discovered&#8221; America, again quite an arrogant assumption with the aboriginals already living quite happily in those respective countries.</p>\n<p>What is less known is that these explorers &#8220;discovered&#8221; the new world with Chinese charts. The Chinese had already &#8220;discovered&#8221; these countries but sought not to conquer, but to seek out minerals and metals for their industries. It is a great tale and is told in the fabulous book &#8220;1421:The Year China Discovered the World&#8221; about the Eunuch Admirals in mahogany ships with rudders 10 metres high.</p>\n",
    "parent": 0
  },
  {
    "id": 409127,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-01-26T14:20:31",
    "content": "<p>Bungaree was the first Australian to circumnavigate the continent, but he&#8217;s less well known than Matthew Flinders<br />\nBy Yasmin Jeffery<br />\nUpdated Fri at 12:58am<br />\n<a href=\"http://www.abc.net.au/news/2019-01-25/bungaree-australian-circumnavigate-country-matthew-flinders/10749476\" rel=\"nofollow ugc\">http://www.abc.net.au/news/2019-01-25/bungaree-australian-circumnavigate-country-matthew-flinders/10749476</a></p>\n",
    "parent": 0
  },
  {
    "id": 409125,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2019-01-26T13:09:41",
    "content": "<p>JIC some did not have time to scroll thru the whole of the BBC link:<br />\nOther notable people buried at St James&#8217;s include:<br />\nBill &#8220;the Black Terror&#8221; Richmond, a slave born in New York who became a free Londoner and a celebrated bare-knuckle boxer who was favoured by King George IV and taught Lord Byron to spar<br />\nLord George Gordon, a political and religious activist famous for his part in the anti-Catholic &#8220;Gordon Riots&#8221; of 1780<br />\nJames Christie, a British naval officer who became a leading auctioneer and founded Christie&#8217;s auction house in 1766</p>\n",
    "parent": 0
  }
]