[
  {
    "id": 412015,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-08-30T17:06:07",
    "content": "<p>Having stayed on a yacht&#8230; well a 32ft sailing boat&#8230; in Monte Carlo harbour I appreciate the irony of that statement Rick 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 412013,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-08-30T13:32:19",
    "content": "<p>To answer your question as to who is behind Greta&#8217;s trip, the voyage appears to have been funded primarily by the Prince Albert II of Monaco Foundation which is &#8220;dedicated to the protection of the environment and the promotion of sustainable development on a global scale.&#8221; </p>\n<p><a href=\"https://www.fpa2.org/about-us.html\" rel=\"nofollow ugc\">https://www.fpa2.org/about-us.html</a></p>\n",
    "parent": 412010
  },
  {
    "id": 412010,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2019-08-30T13:21:37",
    "content": "<p>No question of her concern and commitment.  Well, maybe no questions.<br />\nAndy Warhol&#8217;s dictum comes to mind.  Lotta people have made a lot of money and gained notoriety espousing &#8217;causes&#8217;. Spurious or no.</p>\n<p>Questions do arise around the faked and altered data, and the &#8216;settled science, and the &#8216;political aspects of the stunt.  Somebody&#8217;s paying for this. Who?   What&#8217;s their play?</p>\n<p>With all due respect, she&#8217;s 16, an ardent 16 year old know it all. Such rarely have the iron bound &#8216;TRUTH&#8217; &#8211; Hell, I&#8217;m 79 and don&#8217;t know what&#8217;s<br />\nreal, what&#8217;s true, or what matters any more, after all those years of propagandizing and fraud.  </p>\n<p>Rachel Carson succeeded in having DDT banned &#8211; Yay, Rache!!! But<br />\nhundreds of thousands have since died from mosquito borne diseases, the DDT once controlled.  Net Gain or not?  Only Gaia knows, I suppose. </p>\n<p>Helen Aldicott talks a lot, but reality seems to not be listening.  The world<br />\nhas not ended in a cataclysmic cloud. </p>\n<p>Anyway, been fun pickin&#8217; at ya,  stay away from crowds.  Adieu.</p>\n",
    "parent": 0
  },
  {
    "id": 412007,
    "author": "Ronald Wilkinson",
    "authorUrl": "",
    "date": "2019-08-29T23:37:12",
    "content": "<p>Keep up the good work Greta. If Rachel Carson is one of your mentors you&#8217;re in good company. If you get to the West Coast check out Scripps Institute of Oceanography at UCSD. Good sailing out here too.<br />\nStay with life&#8217;s adventures and do good.<br />\nRon</p>\n",
    "parent": 0
  },
  {
    "id": 412004,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG,%20no%20longer%20published",
    "date": "2019-08-29T17:26:41",
    "content": "<p>I am shocked you mean that after all my years as a navigator the Earth is NOT flat !!<br />\nNice young lady but she is just that one of millions who are justly concerned for our planet while trying to understand all the conflicting &#8220;science&#8221;. Rather like plotting Hurricane Dorian which is heading -one thinks- for South Florida.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 412003,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-08-29T15:52:16",
    "content": "<p>She was on one of the news shows this morning, them the stupid commercial came on and I changed the channel.</p>\n",
    "parent": 0
  },
  {
    "id": 412000,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-08-29T14:32:08",
    "content": "<p>While specific policy recommendations my be worthy of debate, there is no question about the validity of her concerns on climate change. The scientific consensus is clear and definitive. At this point, climate change denial is just another baseless conspiracy theory on par with the flat-earthers.</p>\n",
    "parent": 411999
  },
  {
    "id": 411999,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2019-08-29T13:48:48",
    "content": "<p>A shame she&#8217;s so  dedicated to a false premise.  Perhaps she should open her mind to more, and better information.  Nawww.  Never happen.<br />\nA budding Rachel Carson, with likely the same sort of consequernces<br />\nfor humanity.</p>\n",
    "parent": 0
  },
  {
    "id": 411980,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-08-28T19:43:17",
    "content": "<p>Good for her.  I am glad she is able to stick to her principles.</p>\n",
    "parent": 0
  },
  {
    "id": 411979,
    "author": "Peter S. Van Sickle",
    "authorUrl": "http://Mr.",
    "date": "2019-08-28T17:25:29",
    "content": "<p>It is uplifting to see one so dedicated, so informed, so focused, and so eloquent of any age spreading the message she champions.</p>\n",
    "parent": 0
  }
]