[
  {
    "id": 415248,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-25T15:50:17",
    "content": "<p>Thanks for the review. I hope to see the film one day if Apple lets me.</p>\n",
    "parent": 415242
  },
  {
    "id": 415242,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-07-25T13:40:45",
    "content": "<p>I enjoyed the movie but enjoyed Forester&#8217;s book The Good Shepherd more.  I think the reviewers in the referenced video wanted more of a documentary and kept focusing on what was happening in 1942.  If one looks at the movie more as a composite of 1940-1945 convoy duty, it is easier to overlook some of the nitpicks.  The movie kept my interest to the end, the reviewers did not.  I bailed half way through.</p>\n<p>I saw an interview with Tom Hanks and he was talking about how the producers wanted more explanatory dialogue for nautical and naval terms that were in the script.  I&#8217;m glad that didn&#8217;t happen.</p>\n<p>A film&#8217;s purpose is to make money by entertaining a large number viewers.  If historians made films, I doubt they would make money.  That&#8217;s why we read books if we want to learn history.</p>\n<p>Finally, remember the difference between a fairy tale and a sea story?</p>\n<p>I&#8217;d give the movie a solid B.</p>\n",
    "parent": 0
  },
  {
    "id": 415218,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-07-24T11:06:57",
    "content": "<p>Oh the joys of an &#8220;artists license&#8221;.</p>\n",
    "parent": 0
  },
  {
    "id": 415215,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-07-23T16:51:55",
    "content": "<p>Same as fishing: never let facts get in the way of an exciting story. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 415214,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-07-23T15:57:10",
    "content": "<p>There have been complaints about this movie.</p>\n<p>Read the reviews:</p>\n",
    "parent": 0
  }
]