[
  {
    "id": 405434,
    "author": "Greg Caldecott",
    "authorUrl": "",
    "date": "2018-02-06T12:59:46",
    "content": "<p>In the mood for writing,<br />\nIn all my long life at sea they were called lifejackets. May Wests, Victory etc. were just pet names as I remember. I have sailed with all types issued currently and after the War, even the old cork neck breakers .<br />\nAlthough maybe not as efficient in preserving your life when in the water as the latest models, the victory type gave you more movement and gave you a bit of warmth. Try getting into a liferaft with something trying to throw you on your back as the &#8220;latest&#8221; in the 1980&#8217;s.<br />\nOne last note, I guess not many sailors get sea water wet these days, the old timers used to say that sea water didn&#8217;t do you any harm. They were telling lies!!!!! to be polite.<br />\nCaptain Greg</p>\n",
    "parent": 0
  },
  {
    "id": 405433,
    "author": "Greg Caldecott",
    "authorUrl": "",
    "date": "2018-02-06T11:13:46",
    "content": "<p>Hi Tom,<br />\nAs an old seadog ( 50 odd years at sea) and Master Mariner , but alas not a shellback, they are no more, although as you yourself I have done a bit under square rig. Although noted, it was not so much the Coll. Regs, that grated but that how can they compare the mighty &#8220;Prussian&#8221; with a passenger carrying abortion like the plastic &#8220;Royal Clipper&#8221;.<br />\nIf a landsmen fancies  a trip as a passenger on a square rigger, albeit a pretty brig, try signing on &#8220;Eye Of The Wind&#8221; you can take your ease our pull your tripe&#8217;s out.. as you please.<br />\nCaptain Greg</p>\n",
    "parent": 0
  },
  {
    "id": 405393,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-01-27T16:33:33",
    "content": "<p>&#8220;Right of way&#8221; is one of those phrases like &#8220;life-savers,&#8221; &#8220;life-preserver&#8221; or &#8220;life-jackets.&#8221; The proper term is &#8220;personal flotation device&#8221; but &#8220;life-saver&#8221; is more evocative. I even heard a Coast Guard Admiral refer to &#8220;life-savers.&#8221; There is no &#8220;right of way&#8221; in Colregs but then everyone knows what one means.</p>\n",
    "parent": 0
  },
  {
    "id": 405392,
    "author": "Robin Denny",
    "authorUrl": "",
    "date": "2018-01-27T12:35:58",
    "content": "<p>My apologies to Mr. Cunliffe who is correct in stating there is no &#8220;right of way&#8221; in Col Regs, only &#8220;Stand-on&#8221; which itself is qualified. I put it thus for brevity but it could have been better. Sorry to have misled anyone.<br />\nIn a vaguely similar situation when helming a 90ft.ketch under sail across the English Channel I was unaware that we were showing a steaming light on the main mast. The five whistle blasts from the cargo ship crossing astern were fully deserved! Seems the Skipper was unaware also.</p>\n",
    "parent": 0
  },
  {
    "id": 405391,
    "author": "Tom Cunliffe",
    "authorUrl": "http://www.tomcunliffe.com",
    "date": "2018-01-27T08:28:56",
    "content": "<p>Very interesting post. Thanks. Without wishing to sound Blimpish, the remarks about the Colregs are curious. The initial statement that Brighton had right of way being off the starboard bow of Preussen is incorrect on two counts. First, Right of way as such doesn&#8217;t exist. There&#8217;s only a &#8216;stand-on&#8217; and a &#8216;give-way&#8217; vessel. In this case, who was on whose starboard bow is irrelevant. Preussen was always going to be stand-on as she was under sail. I appreciate that&#8217;s what the post goes on to say, but the way it is laid out might give those not well versed in the Colregs cause to wonder&#8230;</p>\n",
    "parent": 0
  }
]