[
  {
    "id": 408126,
    "author": "Tom Tanguay",
    "authorUrl": "",
    "date": "2018-11-27T18:59:26",
    "content": "<p>I know this is far fetched and unrealistic, but I have an idea. Bring the Brown to San Francisco, and SWAP it for the O&#8217;Brien. Then bring the O&#8217;Brien to Portland Maine Harbor for her new home at the harbor where she was born! I knw nothing of the legalities, but it seems within the realm of probability that the region could have a fund raising to build a pier at the South Portland Bug Light park where the O&#8217;Brien was built. The remains of several New England Shipbuilding piers are still to be seen. There is already a large Memorial structure to the Liberty Ships, and the South Portland Historical Society is a very active organization well acquainted with pulling off the &#8220;undoable&#8221;!</p>\n",
    "parent": 0
  },
  {
    "id": 408068,
    "author": "Whit Petrie",
    "authorUrl": "",
    "date": "2018-11-22T00:52:32",
    "content": "<p>Maybe look into the Navy piers in Newport, RI.</p>\n",
    "parent": 0
  },
  {
    "id": 408063,
    "author": "Ronald Phelps",
    "authorUrl": "",
    "date": "2018-11-21T14:57:03",
    "content": "<p>I hope they find something close by so as not to impact their volunteer force</p>\n",
    "parent": 0
  },
  {
    "id": 408060,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2018-11-21T13:04:33",
    "content": "<p>There’s Battleship Cove in Connecticut also. They also have a PTBoat, Aircraft Carrier and submarine, all from WW II. At least they did 30 years ago.</p>\n",
    "parent": 0
  },
  {
    "id": 408059,
    "author": "Steve Lindsey",
    "authorUrl": "",
    "date": "2018-11-21T12:41:56",
    "content": "<p>Hope its fate is better than the USS Zuni/USCGC Tamaroa which for a short time lived in Baltimore.   Now a reef.   We need to do better this time around.</p>\n",
    "parent": 0
  },
  {
    "id": 408057,
    "author": "Daniel Swords",
    "authorUrl": "",
    "date": "2018-11-21T10:46:33",
    "content": "<p>They consider contacting the WW-II Museum located near the Mississippi River in New Orleans, LA. The museum owns, restored, and operates a PT boat on Lake Pontchartrain and they have restored a landing craft.</p>\n",
    "parent": 0
  },
  {
    "id": 408055,
    "author": "Harry T Scholer",
    "authorUrl": "http://aol",
    "date": "2018-11-21T09:46:08",
    "content": "<p>They should look into Tampa and a berth near American Victory. Two seagoing ships that helped win the war and a true memorial to all those merchant mariners who gave their all.</p>\n",
    "parent": 0
  },
  {
    "id": 408054,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-11-21T09:41:46",
    "content": "<p>Take it to the Maritime Museum of San Diego.  They seem to be doing well to have two submarines a small fleet of sailing ships, a steam yacht, and a steam ferry.</p>\n",
    "parent": 0
  },
  {
    "id": 408052,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-11-21T09:04:26",
    "content": "<p>I&#8217;d be looking for a berth in a tourist town, that way they can recoup mooring fees by charging visitors for guided tours.<br />\nThey are probably ahead of me there 🙂</p>\n",
    "parent": 0
  }
]