[
  {
    "id": 425427,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-17T20:20:51",
    "content": "<p>That&#8217;s a great story, Seymour. Thank you.</p>\n",
    "parent": 0
  },
  {
    "id": 425398,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2022-01-15T17:27:21",
    "content": "<p>Am I the same person I was half a century ago? New skin cells, brain cells lost, fat cells gained, new information learned, new memories made, replacement parts…<br />\nGood points made, all around!</p>\n",
    "parent": 0
  },
  {
    "id": 425388,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2022-01-15T11:01:13",
    "content": "<p>HMS Victory is the focal point of the best of the Royal Navy traditions of excellence, as I hope this story indicates.</p>\n<p> In 1941, the year of my birth, my father commanded HMS Coreopsis, a flower class corvette on convey duty in the North Atlantic. The convoy was under attack from at least one U-boat.  Coreopsis&#8217; ASDIC operator reported a ping, and seconds later, confirmed it as a contact. The chase was on. The target evaded Coreopsis according to a pattern that my father recognized from his own and others&#8217; experience as characteristic of a U-boat&#8217;s response.  Whatever the outcome, my father knew that while they were engaged, his quarry could not attack the merchantmen in the convoy.  So the corvette twisted and turned, chewing up a fair area of the North Atlantic, Coreopsis evading one torpedo, the U-boat dodging Coreopsis&#8217; depth charges.  All the while the convoy sailed on, pulling out of range.  </p>\n<p>Then the lookout yelled &#8220;Periscope, sir! Dead ahead!&#8221;  My father&#8217;s response was immediate: &#8220;Close all watertight doors, stand by to ram, release shallow-set depth charges.&#8221;  Coreopsis bucked, shuddered and slowed. The technician ripped off his earphones. &#8220;Asdic&#8217;s gone sir!&#8221; The depth charges exploded so close to the stern that spray drenched the quarterdeck. In the waist of the ship, the first lieutenant shouted, &#8220;Diesel oil! And blood!&#8221;  Only then did my father realize that he had rammed a whale.</p>\n<p>Opinions varied about his exploit, ranging from mockery to recrimination.  The only way to restore his reputation and chances of promotion was for my father to demand a court martial, which was held &#8230; aboard Victory.  </p>\n<p>The court sat at a table in the space below deck as it had been when the partitions were removed for action at Trafalgar. My father stood where Nelson and his officers had conferred before battle in 1805, when the outcome of the Napoleonic Era&#8217;s war at sea hung in the balance as did the Battle of the Atlantic in 1941.</p>\n<p>My father&#8217;s sword, which he had inherited from his father, lay across the table. </p>\n<p>He made his defence, and was asked to withdraw while the board conferred. When he returned, the tip of his sword was pointed away from him. He had been exonerated by the judgement of the senior officers in the presence and context of history.</p>\n",
    "parent": 0
  },
  {
    "id": 425387,
    "author": "Bill",
    "authorUrl": "",
    "date": "2022-01-15T10:49:26",
    "content": "<p>If we are any example, I&#8217;m told we&#8217;re constantly replacing the cells of our bodies with new ones, Does that make us a different person?</p>\n",
    "parent": 0
  },
  {
    "id": 425382,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2022-01-15T06:21:31",
    "content": "<p>Wooden ships are like brushes.</p>\n<p>&#8220;I have had this brushe for forty years. It has had twenty heads and four handles but it is as good as the day I bought it.&#8221;</p>\n<p>Interestingly, Victory&#8217;s original wooden masts were removed and replaced by wrought iron ones from the decommissioned HMS Shah in 1893. The extra weight added to the damaged over the years. They have been removed for inspection but the debate is whether to reinstall the iron masts, remake the original wooden ones or to make carbon-fibre items sheathed with a veneer of wood that would be much lighter. The wrought iron items are important as they were the first wrought iron masts raised on a UK ship and there is a desire to display them but do you display them as a separate display or reinstall them where they were not an original item and would add weight to the delicate structure?<br />\nI have been involved in several wooden yacht restorations and it was impractical to restore them to totally original. Glues are a good example, Cascamite had a life of 15 to 20 years whereas Epoxy will last almost indefinitely with no gradual degradation. It is also very hard to obtain many original wood species which are, quite rightly, protected.</p>\n",
    "parent": 0
  },
  {
    "id": 425378,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-01-14T22:41:06",
    "content": "<p>Per Allan and Rick, the good fortune in my lucky hat is not in the material of the hat. 🙂</p>\n<p>But perhaps this idea will be challenged when the gust of wind that will take my hat and throw it into the sea finally arrives? Hmm.</p>\n",
    "parent": 0
  },
  {
    "id": 425375,
    "author": "Allan Pickman",
    "authorUrl": "",
    "date": "2022-01-14T19:42:44",
    "content": "<p>There are Japanese temples that have been totally rebuilt from scratch many times, but they are considered the original temple, not reproductions. It&#8217;s a little like you can put a new roof on a house and it&#8217;s still the same house.  There is a spiritual essence that is maintained.  On the other hand I have a quibble with the current iteration of Bluenose II, which was a total new build from the keel up, which I thought could have been called Bluenose III, with out detracting from her mission.</p>\n",
    "parent": 0
  }
]