[
  {
    "id": 415424,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-08-13T08:58:11",
    "content": "<p>The support systems look very similar but are very different. The Cutty Sark is supported by 24 struts that have the ship literally hanging in the air by her tween deck. There is no support for the keel whatsoever. When the project Chief Engineer saw the plan as drawn up by the architects, he resigned convinced that it will damage the ship&#8217;s structure. Time will tell.</p>\n<p>The Victory support system uses 134 struts as compared to 24 on the Cutty Sark. Victory is sitting on keel blocks. If too much of the ship&#8217;s weight is on the keel, the ship&#8217;s frames are unsupported and will begin to deform or sag. The 134 struts, or props, attempt to replicate the buoyancy of the water as if the ship was afloat, providing support for the frames, planking, and other structure. The system is adjustable so the engineers can control the loads on the hull to best suit the way the structure was designed originally.</p>\n",
    "parent": 415417
  },
  {
    "id": 415417,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-08-12T19:38:46",
    "content": "<p>Hi Rick. The new props look great but the Royal Navy could probably have bought a frigate for the money spent!</p>\n<p> I seem to recall you were less positive when Cutty Sark received similar treatment as part of her restoration. Maybe it was the &#8220;newness&#8221; of the look.</p>\n",
    "parent": 0
  },
  {
    "id": 415416,
    "author": "John",
    "authorUrl": "",
    "date": "2020-08-12T17:13:54",
    "content": "<p>What an incredible engineering and curatorial achievement! I&#8217;ve watched the new system being installed and I&#8217;m very happy that is is a success. Victory is an international treasure &#8212; may she &#8220;float&#8221; for many centuries yet to come!</p>\n",
    "parent": 0
  },
  {
    "id": 415415,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-08-12T14:41:23",
    "content": "<p>Wooden ships left afloat are all subject to serious problems with hogging. Both the USS Constitution and USS Constellation have had to undergo major restorations to correct significant hog. Unfortunately, there aren&#8217;t many easy answers to wooden ship preservation.</p>\n",
    "parent": 415411
  },
  {
    "id": 415414,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-08-12T13:25:27",
    "content": "<p>I agree. The struts supporting the Cutty Sark are a horror show.</p>\n",
    "parent": 0
  },
  {
    "id": 415413,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-08-12T12:07:42",
    "content": "<p>I sincerely hope they make a better job of HMS Victory than was done to the Cutty Sark at Greenwich</p>\n",
    "parent": 0
  },
  {
    "id": 415411,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2020-08-11T19:21:35",
    "content": "<p>Further to my comment above &#8212; such a &#8220;low tech&#8221; solution would, I bet, be significantly less expensive and certainly a lot simpler and easier to maintain.</p>\n",
    "parent": 0
  },
  {
    "id": 415410,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2020-08-11T19:19:33",
    "content": "<p>The props look very similar &#8212; from what little is visible &#8212; to the the way larger sailing vessels used to be propped while under construction and/or repairs, maintenance such as painting. etc. with the stepped side walls for the space in which the vessel was located and long logs or pieces of wood extending from the side walls to the hull (horizontally).   Hard to explain and the photos I can think of are usually naval vessels.   I would guess that clipper ships might be similarly &#8220;arranged.&#8221;     </p>\n<p>I have always wondered why the British don&#8217;t leave vessels in the water, and haul them annually to service the bottom, check the caulking and fastening, do more anti fouling etc.    That way a boat/ship would be supported by the water in such a fashion that she is on her lines and holding her shape.</p>\n",
    "parent": 0
  }
]