[
  {
    "id": 427895,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-07-14T03:50:10",
    "content": "<p>@ws There is an interesting article on FPSO here <a href=\"https://www.maritime-executive.com/editorials/seven-key-environmental-challenges-for-fpsos\" rel=\"nofollow ugc\">https://www.maritime-executive.com/editorials/seven-key-environmental-challenges-for-fpsos</a></p>\n",
    "parent": 0
  },
  {
    "id": 427892,
    "author": "ws",
    "authorUrl": "",
    "date": "2022-07-13T14:48:31",
    "content": "<p>Ship propulsion, steam turbine or diesel? (Year built 2021)</p>\n<p>Recent[when?] advances in technology reliquefication plants to be fitted to vessels, allowing the boil off to be reliquefied and returned to the tanks. Because of this, the vessels&#8217; operators and builders have been able to contemplate the use of more efficient slow-speed diesel engines (previously most LNG carriers have been steam turbine-powered). Exceptions are the LNG carrier Havfru (built as Venator in 1973), which originally had dual fuel diesel engines, and its sister-ship Century (built as Lucian in 1974), also built with dual fuel gas turbines before being converted to a diesel engine system in 1982.[citation needed]</p>\n<p>Vessels using Dual or Tri-Fuel Diesel Electric, respectively DFDE/TFDE, propulsion systems are now in service.[citation needed]</p>\n<p>Recently, there has been interest in a return to propulsion by boil-off gas. This is a result of the IMO 2020 anti-pollution regulation that bans the use of marine fuel oil with a sulphur content greater than 0.5% on ships not fitted with flue-gas scrubbing plant. Space constraints and safety issues typically prevent the installation of such equipment on LNG carriers, forcing them to abandon the use of the lower-cost, high-sulphur fuel oil and switch to low-sulphur fuels that cost more and are in shorter supply. In these circumstances, boil-off gas may become a more attractive option.[21]</p>\n",
    "parent": 0
  },
  {
    "id": 427719,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-06-28T14:19:59",
    "content": "<p>What is semi-autonomous? If it had autopilot steering to waypoints, ais and radar proximity alarms does that qualify? In which case my sailing boat is semi autonomous 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 427716,
    "author": "ws",
    "authorUrl": "",
    "date": "2022-06-28T10:24:05",
    "content": "<p>LNG tankers are making natural gas a fungible commodity, &amp; weaning Europe off of Russian natural gas</p>\n",
    "parent": 0
  }
]