[
  {
    "id": 415570,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-08-23T13:14:32",
    "content": "<p>I&#8217;ll stick with Ice Station Zebra with Hudson &amp; Borgnine.</p>\n<p>I&#8217;m too old to be going to either ends of the Earth.</p>\n<p>After the short as.<br />\n<a href=\"https://m.imdb.com/video/vi480773401?ref_=m_tt_vi_1\" rel=\"nofollow ugc\">https://m.imdb.com/video/vi480773401?ref_=m_tt_vi_1</a></p>\n",
    "parent": 0
  },
  {
    "id": 415569,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-08-23T00:07:54",
    "content": "<p>To show how much the Arctic has changed, in 1997 the Canadian icebreaker Des Groseilliers found suitable ice during project SHEBA to tie into at a much lower latitude than the Polar Stern.  The furthest north we got was ~81 degrees.  There was much more multi-year ice back then.  I was on the Des Groseilliers for 17 weeks during the 1997-1998 experiment and stayed with the ship through the return to Quebec via the Northwest Passage at the end of the experiment.  Needless to say it was a trip of a lifetime.</p>\n<p>Icebreakers have been to the North Pole before.  In the 90&#8217;s, the USCG Polar Star and Canadian Coast Guard Louis St Laurent got there together.  The Russian icebreaker Yamal showed up shortly after and help an ailing Polar Sea get through the ice on the return.  These were all heavy icebreakers and the Polar Stern is not.  This is documented in the film By Icebreaker to the North Pole that is available on Amazon.</p>\n<p>The most amazing ship attempt at the North Pole was the Fram with Fridtjoft Nansen in 1893-1896.  They got above 84 degrees north and realized the Fram wouldn&#8217;t make the North Pole.  He and Hjalmar Johansen took off with dogs and sleds and attempted to reach the North Pole but came up short at 86.3 degrees north before ice conditions forced a retreat.  This amazing expedition is documented in Nansen&#8217;s Farthest North and is an excellent read.</p>\n<p>To see the shape of Arctic ice, checkout <a href=\"http://nsidc.org/arcticseaicenews/\" rel=\"nofollow ugc\">http://nsidc.org/arcticseaicenews/</a></p>\n",
    "parent": 0
  },
  {
    "id": 415563,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-08-22T14:48:02",
    "content": "<p>August 10, 2020</p>\n<p>Hundred years old tall ship &#8220;Sedov&#8221; embarks on historic Arctic voyage<br />\nThe ship will be the first of its kind that sails across the Northern Sea Route<br />\n<a href=\"https://thebarentsobserver.com/en/arctic/2020/08/hundred-years-old-tall-ship-sedov-embarks-historic-arctic-voyage\" rel=\"nofollow ugc\">https://thebarentsobserver.com/en/arctic/2020/08/hundred-years-old-tall-ship-sedov-embarks-historic-arctic-voyage</a></p>\n",
    "parent": 0
  },
  {
    "id": 415562,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-08-22T13:24:15",
    "content": "<p>Alas a sign of climate change.  Where before no ship could navigate.</p>\n",
    "parent": 0
  }
]