[
  {
    "id": 407349,
    "author": "Patrick",
    "authorUrl": "",
    "date": "2018-10-01T18:05:59",
    "content": "<p>What a fantastic sailor.   Correct me if I’m wrong, But I believe this young man crossed the equator, making him eligle to join the Royal Order of Neptunus Rex.    I’d like to mail him the certificate if I can get his address.   Anyone?    Wori, Manado Indonesia.   Maybe that’s enough</p>\n",
    "parent": 0
  },
  {
    "id": 407278,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-09-26T17:00:31",
    "content": "<p>Per other remarks it would be interesting to know exactly what equipment Adilang was provided with. 125km offshore, with what?</p>\n<p>Every time I read about the hardship endured to extract food from the ocean, I think &#8220;be sure to finish all of your fish dinner.&#8221;  The story behind a filet on a plate is quite flabbergasting.</p>\n",
    "parent": 0
  },
  {
    "id": 407270,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-09-26T08:55:47",
    "content": "<p>I did think about that but presumed that the sort of person who takes on a job like that is not aware of emergency radio protocols and had to watch ships pass until a watchkeeper who understood his language or dialect was actually listening on the channel he was transmitting on. I may be wrong about the chap in which case I apologise, at one company where I worked the three employees with university degrees were motorcycle messengers.</p>\n",
    "parent": 0
  },
  {
    "id": 407267,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-09-26T06:01:35",
    "content": "<p>So 10 ships went by that wouldnt respond to a &#8220;Mayday&#8221;.  Sad fact of life these days</p>\n",
    "parent": 0
  },
  {
    "id": 407256,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-09-25T17:02:58",
    "content": "<p>Anchor rode is correct!<br />\nHis job should be superfluous, LED lights with daylight sensors would save on overheads.</p>\n",
    "parent": 0
  },
  {
    "id": 407254,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-09-25T14:47:33",
    "content": "<p>Error: &#8221; Every night Aldi turned on lamps suspended &#8220;below&#8221; the trap to attract fish.</p>\n<p>I think they mean above the traps, unless they now have underwater lighting?</p>\n<p>And Rope, not rode chafed.<br />\nBad foreign English.</p>\n<p>Also TV news reported he had a 2-way walky-talky which he radioed &#8220;HELP&#8221; on.</p>\n<p>I also doubt that cloth alone would remove any salt from seawater.</p>\n",
    "parent": 0
  }
]