[
  {
    "id": 411995,
    "author": "Chip Croft",
    "authorUrl": "",
    "date": "2019-08-29T09:01:32",
    "content": "<p>I sailed on &#8220;Iolaire&#8221; with Don and Trich in the 80s &#8211; shot the &#8220;Antigua Race Week&#8221; and &#8220;Knots&#8221; Videos. We were ahead of our time &#8211; charged camera batteries with solar panel and Don supplemented boat volts with wind generator. She sailed rock steady and fast. A true pleasure to experience. Painful to see her go down but she will be remembered into eternity as will Don.</p>\n",
    "parent": 0
  },
  {
    "id": 411882,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-08-20T15:10:30",
    "content": "<p>There isn&#8217;t much more information publically available right now. You might want to follow the link to read a bit more, but there isn&#8217;t much. </p>\n<p><a href=\"http://classicsailboats.org/iolaire-lost-off-the-north-east-coast-of-ibeza/\" rel=\"nofollow ugc\">http://classicsailboats.org/iolaire-lost-off-the-north-east-coast-of-ibeza/</a></p>\n",
    "parent": 411881
  },
  {
    "id": 411881,
    "author": "Rob Canterbury",
    "authorUrl": "",
    "date": "2019-08-20T15:00:34",
    "content": "<p>So many questions about how this actually happened.  Maybe we could all learn from some additional details. Does anyone have a link with additional info.  Accidental gybes do not necessarily cause you to run your boat onto the rocks. Too close to shore?  Did the boom break?  Did the entire rig snap?  I speak from experience as on this exact same day, delivering a Hanse 470e, we too accidentally gybed off of Cabo de Gato (not far from Ibiza) in 3 meter swells and 40kts.  Our preventer (boom foreguy) gave way due to a soft shackle failure on the bow.  Over the boom went and it snapped in half like a toothpick at the point where the main sheet attaches.  Professional crew set about securing the boom and we motored to Alicante for a replacement.  Only sharing as I’ve been a fan of Iolaire since I was a boy. I’m not at all disrespecting the crew, I’m just curious about the details and how we can all potentially benefit from this tragic loss.  Very happy to hear that the crew are all ok.</p>\n",
    "parent": 0
  },
  {
    "id": 411875,
    "author": "Casey Fasciano",
    "authorUrl": "",
    "date": "2019-08-19T21:35:31",
    "content": "<p>Noooooooo! Nonononoooo! Incompetent fools should have bought a Beneteau and wrecked that instead. That fine lady old battleaxe deserved better. Sorry Squeaky</p>\n",
    "parent": 0
  },
  {
    "id": 411872,
    "author": "George ZBridger",
    "authorUrl": "",
    "date": "2019-08-19T17:38:56",
    "content": "<p>Always a sad event ,when a boat with such an amazing history, is lost</p>\n",
    "parent": 0
  },
  {
    "id": 411871,
    "author": "Charles Sawka",
    "authorUrl": "",
    "date": "2019-08-19T14:26:22",
    "content": "<p>I will never forget Don and the docking maneuvers under sail at Crabbs. In Antigua</p>\n",
    "parent": 0
  },
  {
    "id": 411870,
    "author": "Ron Schaper",
    "authorUrl": "http://CaptainRonYachtCharters.com",
    "date": "2019-08-19T13:16:58",
    "content": "<p>Sad to hear of the loss of this historical boat.<br />\nI knew Don and Iolaire  in the West Indies and always admired the seamanlike manner she was handled, in and out of anchorages under sail.<br />\nIt has to be like losing a family member for Don.</p>\n",
    "parent": 0
  },
  {
    "id": 411869,
    "author": "Marilyn Stenberg",
    "authorUrl": "",
    "date": "2019-08-19T12:49:38",
    "content": "<p>Iolaire sank under new ownership, just a few weeks after the sale</p>\n",
    "parent": 0
  },
  {
    "id": 411868,
    "author": "Nigel James",
    "authorUrl": "https://nj-yacht.com",
    "date": "2019-08-19T10:08:45",
    "content": "<p>Very sad; I&#8217;ve been following Don Street&#8217;s escapades for about 30 years, always an inspiration. I&#8217;m glad to learn he and his crew are safe and fingers crossed she was insured &#8211; yes, I know, irreplaceable, but it helps.</p>\n",
    "parent": 0
  },
  {
    "id": 411867,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd.)",
    "authorUrl": "http://formerly%20Nautical%20Log,%20no%20longer%20published.",
    "date": "2019-08-19T09:38:52",
    "content": "<p>oops that&#8217;s &#8220;without major incident&#8221; !!!</p>\n",
    "parent": 0
  },
  {
    "id": 411866,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd.)",
    "authorUrl": "http://formerly%20Nautical%20Log,%20no%20longer%20published.",
    "date": "2019-08-19T09:36:01",
    "content": "<p>Rick, thank you for this post.  Don Street is my brother-in-law being married to my sister Patricia (Trich).  I was quite shocked when I received this news somewhat  after the event.  It was amazing that Don accomplished so many voyages and ocean crossings with major incident only to have this happen under another command.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 411865,
    "author": "Cornelius van Rijckevorsel",
    "authorUrl": "",
    "date": "2019-08-19T09:26:54",
    "content": "<p>Sad news to lose a boat with this distinction. I hope Don is not too heartbroken.</p>\n",
    "parent": 0
  },
  {
    "id": 411863,
    "author": "Maritime - Bow Designs",
    "authorUrl": "https://www.maritimemanual.com/types-of-bow-designs/",
    "date": "2019-08-19T02:57:46",
    "content": "<p>That&#8217;s a sad news.The bright side is that the crew is safe. Iolaire took with it more than a century of sailing history. :'(</p>\n",
    "parent": 0
  }
]