[
  {
    "id": 406454,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-24T19:13:34",
    "content": "<p>Agreed.  The canadians have no size or catch limits.  The grand daddy lobsters or tthe notched tail female are off limits in Maine.  But not to the canadians.</p>\n",
    "parent": 0
  },
  {
    "id": 406448,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-06-23T14:28:12",
    "content": "<p>I anticipate that unless the catch is regulated all the Maine lobsters will be hoovered up by over-zealous fishing fleets long before the lobsters find the water too warm.</p>\n",
    "parent": 0
  },
  {
    "id": 406445,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-22T18:36:18",
    "content": "<p>There was a joke about Maine in 1997.  Seems that Maine would curb lobster fishing by buying up lobster gear so lobstering persons would get training and do other proffessions.  Well that was the theory.  Instead what the industry realized was you could spend 2 grand buying a boat that no longer floated, go to a antique store and buy up all their useless old traps.  Take that inventory to the government and they would give you enough money to buy a new boat and better gear.  So instead of curbing the harvest, the government encouraged fishing at three times the level of damage than before!</p>\n<p>Now supposedly there are hatcheries that figured out how to get lobsters to grow in hatcheries.  Before it couldnt be done.  Now supposedly a hatchery can grow a lobster to under the size of legal catch (to release them and regrow the population).  Tho the industry is catching on to this as well and pitch their traps near the hatcheries so they dont need to fish as hard.</p>\n<p>Its a wonderful life in Maine.  Isnt it?</p>\n",
    "parent": 0
  },
  {
    "id": 406443,
    "author": "Al Porc",
    "authorUrl": "",
    "date": "2018-06-22T15:13:13",
    "content": "<p>o not forget that there is still a lot of pollution in the Long Island Sound. The cities still dump raw sewage into the waters (they say the sewage is treated but when it rains all of the cities  around the sound divert the sewage).  Also, starting in the late 1980&#8217;s and 1990&#8217;s a lot of spraying for west Nile virus carrying mosquitoes was done. This also had a bad effect on the shellfish larva. This coupled with a tremendous amount of over fishing appeared to wipe out the fishery. I am not nor do I claim to be a fishery expert. This is just my observations and reports from local papers.</p>\n",
    "parent": 0
  },
  {
    "id": 406442,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-06-22T11:03:40",
    "content": "<p>&#8220;Right Whales do get tangled in lobster and snow crab gear&#8221;?</p>\n<p>Really?<br />\nHow do they fit in the little lobster pots/crab traps?</p>\n<p>If the water gets too warm for lobsters, they will move to cooler waters, either north or to deeper water.</p>\n",
    "parent": 0
  },
  {
    "id": 406439,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-06-21T20:15:48",
    "content": "<p>Don&#8217;t forget the new 25% tariff just announced to be placed on lobster imported to China.   However Right Whales do get tangled in lobster and snow crab gear&#8230;&#8230;&#8230;&#8230;..I fear that the Right Whale will be extinct in my lifetime (and I am elderly).</p>\n",
    "parent": 0
  }
]