[
  {
    "id": 405796,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-03-29T16:34:55",
    "content": "<p>Captain Crossland, we can think of inflatables as being akin to three-point harnesses in motor vehicles. Absolutely it&#8217;s the case that five-point harnesses will work more effectively as a matter of simple statistics immune from human nature. But human nature dictates three-point harnesses will be used more frequently and hence will be more statistically reliable than five-point harnesses. &#8220;Lego&#8221; style PFDs are all too often found just yards away from drowning people because (especially for sailors dancing around on the deck of a sailboat) they&#8217;re optimized for excellent flotation, not physical activity.</p>\n<p>The biggest danger from inflatables I&#8217;ve directly observed is that of embarrassment at shopping for groceries while still wearing a PFD, because inflatables are indeed forgettably comfortable. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 405794,
    "author": "Roger Crossland, CAPT USN (Ret.)",
    "authorUrl": "http://www.dreadnaughts-bluejackets.com",
    "date": "2018-03-29T10:43:45",
    "content": "<p>In the conditions described in the article jacklines are laid out fore and aft on the boat and crew members must wear harnesses that clip into the jacklines. Crew members are tethered to the jacklines. At the moment the boom jibed, Fisher was &#8220;untethered.&#8221;  I suspected he was wearing an inflatable lifejacket (which I view as unsafe, extremely unreliable, and lethally comfortable). Some inflatables will inflate upon contact with sea water, but not if the wearer has sunk below a certain depth. </p>\n<p>Speculation is he was unconscious when he hit the water.</p>\n<p>I suggest any time jacklines are rigged crew members should be wearing Type I lifejackets with a saltwater initiated strobelight and beacon/tracker actuated to the Iridium satellite system.  In those seas you couldn&#8217;t see a bobbing head twenty feet away from you. </p>\n<p>Of course, the rule of unintended consequences would dictate that lazy skippers will not rig jacklines to avoid wearing cumbersome Type 1 lifejackets.</p>\n",
    "parent": 0
  },
  {
    "id": 405793,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG",
    "date": "2018-03-29T09:45:46",
    "content": "<p>Not knowing very much about ocean racing but a great deal about the sea one wonders why he was not, apparently, wearing a harness.  One understood this was required under ocean racing rules.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 405787,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-03-28T17:18:20",
    "content": "<p>Obviously its courting danger to run this race and of course its each crewmember&#8217;s decision to take it on.</p>\n<p>But still it&#8217;s a little hard to understand how in this age of PLBs and AIS COB beacons let alone strobes and other older kit the poor guy could have just vanished. Technically-speaking it&#8217;s possible to strap on 3 electronic aids, only one of which has to function to provide a target, two of these operating beyond-visual-range. </p>\n<p>But again this particular event isn&#8217;t about safety.</p>\n",
    "parent": 0
  }
]