[
  {
    "id": 405916,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-04-16T11:02:15",
    "content": "<p>106 years after Titanic disaster, expedition planned to survey &#8230;<br />\nSILive-17 hours ago<br />\nIt has been 106 years since the R.M.S. Titanic struck an iceberg and sank just three hours later, killing over 1,500 people. It was one of three large ships built by the White Star Line, complete with 10 decks and 840 staterooms. At the time, it was the largest passenger steamship ever built, with a capacity of &#8230;<br />\n<a href=\"http://www.silive.com/expo/erry-2018/04/b26fb2fa08287/106_years_after_titanic_disast.html\" rel=\"nofollow ugc\">http://www.silive.com/expo/erry-2018/04/b26fb2fa08287/106_years_after_titanic_disast.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 405908,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-04-15T16:59:58",
    "content": "<p>This bit is delightfully sarcastic in a fully extended way only Conrad (or perhaps Twain) could pull off:</p>\n<p><i> Enter to the grizzled examiner a young man of modest aspect: &#8220;Are you well up in modern seamanship?&#8221; &#8220;I hope so, sir.&#8221; &#8220;H&#8217;m, let&#8217;s see. You are at night on the bridge in charge of a 150,000 tons ship, with a motor track, organ-loft, etc., etc., with a full cargo of passengers, a full crew of 1,500 cafe waiters, two sailors and a boy, three collapsible boats as per Board of Trade regulations, and going at your three-quarter speed of, say, about forty knots. You perceive suddenly right ahead, and close to, something that looks like a large ice-floe. What would you do?&#8221; &#8220;Put  the helm amidships.&#8221; &#8220;Very well. Why?&#8221; &#8220;In order to hit end on.&#8221; &#8220;On what grounds should you endeavour to hit end on?&#8221; &#8220;Because we are taught by our builders and masters that the heavier the smash, the smaller the damage, and because the requirements of material should be attended to.&#8221;</i></p>\n",
    "parent": 0
  },
  {
    "id": 405907,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-04-15T14:06:09",
    "content": "<p>In the bad old days before the internet a friend told me his son was given a school project on the Titanic as homework. He suggested his son look in the Encyclopedia Britannica and then huffed and puffed when his son came back and said he could not find anything about his homework subject in the volumes in their library. Much to his embarrassment he found nothing either but on further investigation realised that their set of encyclopedias were the 1911 edition.</p>\n",
    "parent": 0
  }
]