[
  {
    "id": 412780,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-11-17T02:29:09",
    "content": "<p>The relationship of the CG and NTSB seems a little similar in the wrong way with that of the NTSB and FAA.</p>\n<p>The CG and FAA both suffer the tension of needing to encourage and foster commerce while simultaneously regulating it for safety purposes. Without extraordinary scruples and diligence, this defaults to an unhealthy arrangement. That&#8217;s what the empirical evidence shows, in both cases. </p>\n<p>Each could use more generous and courageous political backing to show their teeth where needed. </p>\n<p>But we have the ongoing problem of confusing Freedom with freedumb. That may take the immediate shape of propping up businesses that aren&#8217;t actually viable by looking the other way and trading lives as a kind of subsidy for failed enterprises.</p>\n",
    "parent": 0
  },
  {
    "id": 412776,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-11-16T20:28:19",
    "content": "<p>Not only was the egress limited but initial reports say fire on the deck above prevented escape. This would also counter the suggestion that phone lithium batteries charging on the berthing deck caused the fire.  The question of alarms is important, as is the reason why the standards for watch standing were basically ignored. The hull material also does matter because it could provide fuel for the fire, something that a steel hull would not. We will know a lot more after the NTSB report comes out in about a year&#8217;s time.</p>\n<p>The larger issue is how the USCG could have approved this death trap as safe and in compliance with all rules and regs.</p>\n",
    "parent": 0
  },
  {
    "id": 412775,
    "author": "island girl",
    "authorUrl": "",
    "date": "2019-11-16T20:09:57",
    "content": "<p>The matter of limited access (egress and ingress) via the steep ladder and small hatch is problematic but even more of concern is why did the fire happen at all?    We have heard some issues with charging digital devices for the passengers, and issues with lithium-ion batteries.   Did she have a charging station and what about the house and start batteries?   Also, what about the rules governing use of digital devices?     I have heard of serious problems and at least one sinking due to lithium ion batteries.    </p>\n<p>What about smoke/fire/co detectors and fire extinguishers?    Why did a fire get going and the passengers not be &#8220;alarmed?&#8221;    Automatic sprinkler system?   </p>\n<p>The fact that the boat was wood was not the most important aspect although the access issue is crucial.     The issues to do with the cause of the fire and the lack of alarm seems even more crucial!</p>\n",
    "parent": 0
  }
]