[
  {
    "id": 407509,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2018-10-11T08:01:19",
    "content": "<p>Simply put and well said, Rick.</p>\n",
    "parent": 0
  },
  {
    "id": 407506,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2018-10-11T07:41:53",
    "content": "<p>I speak as a Cape Horner who has been there in the Southern oceans three times each time in Square rigged sailing ships 1991, 2015 and 2018. It is tough no matter how it is tried the sea has to be respected at all times as a tough mistress, I am most proud of the earliest rounding I made in SOREN LARSEN 1991, when we used single sideband radio, weather fax was the only other outside contact in the 45 days it took us to get to the Horn from Auckland, we hung on to contact with Kerry, Kerry Radio until the signal ran out otherwise we were on our own. EUROPA 2015 was difficult when we went down from the east a rare occurrence for a square rigger these days we were off the pitch of the Horn for 13 days  after a wind shift of 110 degrees in 10 seconds decided Antarctica was where we should go and not west as we needed to get to 80 degrees before making north, we were hove to for 4 days laying in troughs awaiting a change. TENACIOUS 2018 was mostly easier again out of Auckland but even then with all the up to date weather we at one point found ourselves being blown way north when we needed south east. When Cape Horner member Charlie Crawshaw was down there in the southern ocean some years ago prior to 1990 in REVELLER a Nicholson 32 the first of her type to go into those Horn waters he and his two companions sat down below clinging on to whatever they could playing board games and Dominoes when it got tough. Before sailing Charlie had filled the cockpit of his  boat more used to being seen in the Mediterranean with polystyrene  to throw off water perhaps he was either foolish or lucky but he made it so proving that a Nic 32 could go anywhere. At Cape Horner`s we are always on the lookout for more intrepid members. Of the present group down in those waters Cdr Tomy<br />\nthe unfortunate Indian entrant is already one of our members, I understand his injuries are sever and muscular without any breakages. Perhaps the Indian Navy will be successful in rescuing his and Gregor`s boats.<br />\nChris R</p>\n",
    "parent": 0
  },
  {
    "id": 407480,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-10-10T07:58:53",
    "content": "<p>To see if a race could be done in the late 1960&#8217;s technology is ludicrist.  I was going to say comendable, yet as a society that of which was in the world in the 1970&#8217;s has forever changed.  We cant go back to what was for a challenge.  As the seas wont go back to what was either.</p>\n<p>If the want to have a race of what it was like back then that is nice.  Yet dont take away the safety gear that allows people to do their job.  Solar panels for fresh water should have been allowed as well as the ability of auto navigation.  Even an tablet would have helped.  </p>\n<p>Nope, have this race only as a class of race if people want to try it.  Yet it needs to have the warning that &#8220;99% of you probably wont make it with these limitations&#8221;.  Tho there had best be an award of twice the value of a new boat at the end.  Especially where this could be a life ending race.</p>\n",
    "parent": 0
  },
  {
    "id": 407472,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-10-09T13:45:49",
    "content": "<p>Quote: There is no guarantee that they would have avoided the weather entirely if they had access to weather routing and satellite communications, but they would have had a better chance of avoiding the reported 80-knot winds and high seas.  /quote<br />\nIf you listen to the conversation that the chap who was injured had with Australian weather forecaster before the incident he was told that (not the exact words) there was a blow coming but nothing he couldn&#8217;t handle.<br />\nSo&#8230; you can&#8217;t predict freak waves and weather routing wouldn&#8217;t have helped.<br />\nBeing able to go faster than the weather systems does seem to have a plus side providing you don&#8217;t hit any flotsam or jetsam at high speed.<br />\nAs I am a poor man I will stick with my Nic 32 and stay out of the southern ocean.</p>\n",
    "parent": 0
  },
  {
    "id": 407469,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-10-09T12:34:23",
    "content": "<p>Really, taking on the ocean as a recreational or sporting activity at any level is to join an all-volunteer navy featuring more or less gratuitously chosen hazards and risk.</p>\n<p>I generally hate board games, claim they&#8217;re an irrational waste of time and effort when real-world problems offer enjoyable and useful problem-solving, but then I go sailing for no good reason. I have to admit that sitting at a table and participating in an imaginary world of arbitrary rules and ephemeral excitement while accomplishing nothing useful is a more sensible choice than sailing, if I&#8217;m thinking about my safety and that of others who sail with me. </p>\n<p>No professional mariner will be needed to put their own lives (and charterer/owner/etc. money) at risk to rescue participants in a game of Monopoly gone wrong, but they readily do so for people with nothing better to do than tie one arm behind their backs,go to sea and get into serious trouble. Rescuers know full well how their time is being wasted. Yet for the most part rescuers seem happy to do so; there&#8217;s some kind of sport even in a rescue as we can see in the elation following a successful recovery.</p>\n<p>There&#8217;s no reasoning this out. We are very strange creatures.</p>\n",
    "parent": 0
  }
]