[
  {
    "id": 412919,
    "author": "L Stone",
    "authorUrl": "",
    "date": "2019-12-03T06:31:33",
    "content": "<p>I purchased 6 Pre-cooked lobsters at Hannaford&#8217;s in Gardiner Maine in May 2019. I processed the meat for a salad.  I was dumbfounded when I found an egg/berry bearing female, which really does not look very appealing. Upon further investigation, into the remaining bag of lobster, I discovered it was a Product of Canada.  First, I am a fishermen&#8217;s daugher and no self-respecting fishermen keeps a female, especially an egg-bearing female.  Secondly, I really don&#8217;t see the need for Canadian lobsters in our Maine grocery stores, but maybe I am missing something.</p>\n",
    "parent": 0
  },
  {
    "id": 412754,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-14T16:06:18",
    "content": "<p>As far as I know, lobsters and crabs are caught in traps, not nets.<br />\nCrawfish, crawdads or crayfish taste just as good, I accidentally ate a sample at a grocery store in California, but to me, they are the bugs we played with as kids.</p>\n",
    "parent": 0
  },
  {
    "id": 412747,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-11-14T09:03:24",
    "content": "<p>If you want a cheaper new england lobster?   Call Hannaford supermarket in Ellsworth Maine 207 667 5300.  They will overnight you a fresh lobster at $20 (approximately) each.</p>\n",
    "parent": 0
  },
  {
    "id": 412743,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-11-13T21:00:34",
    "content": "<p>Knowing that the imperiled North Atlantic Right Whale has suffered terribly from gear entanglements (certain types of crab and lobster, etc.) as well as from vessel strikes, I have put lobster on the embargoed list.    Some states are trialling break away lines and/or radio released gear without gear and line to the surface but the fishermen are, of course, objecting.   I understand that but with whales at stake, no more lobster for me.    Since it costs close to $50 for a picked out pound that is OK.     I stopped eating swordfish 55 years ago when long lining threatened the species.  Long lining catches species of all sizes and types and if you catch sexually immature creatures you wipe them out even faster.</p>\n",
    "parent": 0
  },
  {
    "id": 412740,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-13T16:52:05",
    "content": "<p>Seen it on the news, but if you want lobsters, start buying them before the Chinese get them!</p>\n<p>Why We Don&#8217;t Eat California Spiny Lobsters (Even Though They Taste even better</p>\n<p>Pacific lobster?<br />\nOct 12, 2016 · California spiny lobsters lack the pincers typical of Maine lobsters and are sweeter than their East Coast​<br />\n<a href=\"https://www.vice.com/en_us/article/gvk5kq/why-we-dont-eat-california-spiny-lobsters-even-though-they-taste-better\" rel=\"nofollow ugc\">https://www.vice.com/en_us/article/gvk5kq/why-we-dont-eat-california-spiny-lobsters-even-though-they-taste-better</a></p>\n",
    "parent": 0
  },
  {
    "id": 412735,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-11-13T10:02:30",
    "content": "<p>Something to note about the lobster industry.  We arent suffering here in Maine.  The bulk of our $3 lobster (price off the boat) are sold in New York or Boston.  Granted once the lobsters hit the markets down there, the average cost as almost $40.  The local industry is still alive and well.  That being said, the companies in Boston or New York might be hurting from the tarrifs.</p>\n",
    "parent": 0
  }
]