[
  {
    "id": 405800,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-03-30T10:14:02",
    "content": "<p>When Ashman died on the Clipper Race the boom was rigged with a preventer that failed during the gybe, allowing the boom to swing out of control. Ashman was standing so-called &#8220;danger zone&#8221; which proved to be a fatal mistake. </p>\n<p>There is no reference to gear failure on Skallywag, so a preventer may not have been rigged. There have been VOR videos of gybes on other boats where it did not appear that a preventer had been rigged.  Preventers can cause their own problems, turning a nasty gybe into a dangerous broach.</p>\n",
    "parent": 0
  },
  {
    "id": 405799,
    "author": "Roger Crossland, CAPT USN (Ret.)",
    "authorUrl": "http://www.dreadnaughts-bluejackets.com",
    "date": "2018-03-30T09:51:33",
    "content": "<p>Maybe off-shore racing officials need to introduce a mandatory &#8220;slither alley,&#8221; or tunnel, (with jackline) to prevent the mainsheet tackle fatalities.</p>\n",
    "parent": 0
  },
  {
    "id": 405798,
    "author": "Tony Nelson",
    "authorUrl": "",
    "date": "2018-03-29T22:21:52",
    "content": "<p>No doubt AIS / PLB s will be standard equipment in those circumstances in future , they are available and it&#8217;s tragic one was not used.<br />\nI have been involved in five MOB situtions : each time astonished at how hard it is to see that little head among the waves , so I made the crew have a large heavy duty orange plastic bag in their pocket or bum-bag , to hold in the wind and inflate for greater visability ;then get into it later for a kind of wet-suit to delay hypothermia.[Turn the tide on plastic].<br />\nA high quality purpose built, automatic self inflating buoy of this sort , is the logical evoloution . tethered to the casualty.<br />\nAn inflatable &#8216;sleeping-bag&#8217; kind of sausage is another idea , which you might be glad to have in that situation. With goggles and snorkel.</p>\n",
    "parent": 0
  },
  {
    "id": 405797,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-03-29T18:42:26",
    "content": "<p>I find it hard to believe that it was accepted practice to be on deck without a safety line in the Southern Ocean, or anywhere else in a gale and 4 metre plus seas. He died fulfilling his dream but that is no help to the rest of the crew or his friends and family who have my deepest sympathy.</p>\n",
    "parent": 0
  },
  {
    "id": 405795,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-03-29T16:22:38",
    "content": "<p>Working untethered is a bit of surprise, truly. </p>\n<p>I suppose that evaluating events such as the VOR against standard metrics of common sense is to miss the point. </p>\n<p>Even so, as always the biggest misery only really begins immediately after the dying is finished. Failed hazard/risk calculations affect survivors who may not be such enthusiastic volunteers to court disaster.  Presumably there are remaining family members who would have strongly preferred to hear instead a sea story about how a brush with death was avoided by simple precautions.</p>\n",
    "parent": 0
  }
]