[
  {
    "id": 422897,
    "author": "curt bovee",
    "authorUrl": "",
    "date": "2021-08-28T13:14:55",
    "content": "<p>Good on ya&#8217;, Willy.<br />\n Hey from Northport.   🦞🦞🦞</p>\n",
    "parent": 0
  },
  {
    "id": 422896,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-28T11:53:51",
    "content": "<p>Since you dont live in Maine you dont know what life is like here Stan.  While I can relate to what your saying.  Lobstering is not all that stressful.  Here in Maine life moves at a different pace.  Yes we pay our bills.  We earn what we need.  Some people are more driven than others.  Yet alot of us we are happy with the life of &#8220;making do&#8221;.</p>\n<p>Oh and the lobster indostry can make alot of money if a fisherman wants.  Many of the lobster boats here are capable of 200 traps.  The boats themselves new are worth 100k-200k and are usually paid off after 5 years.</p>\n<p>If you want to see them having fun.  Go to YouTube and look for &#8220;winter harbor lobster boat race&#8221;.  When the locals get together and have some downeast fun.</p>\n<p>Sad?  Not really.  In Many ways working on a lobster boat would be more fun than being lethargic and looking out a retirement window wondering why family doesnt have the time to say hello anymore.</p>\n",
    "parent": 0
  },
  {
    "id": 422889,
    "author": "Stan",
    "authorUrl": "",
    "date": "2021-08-27T22:36:16",
    "content": "<p>This is a sad story. She has done it because it’s the only thing she knows. She never had a life, this is her life. Sad for the family all around. How is this a news story? The oyster/crab/lobster boats scrape by on crap wages. This is the only way they stay in business is keeping people like this working salary wages that aren’t anything.</p>\n",
    "parent": 0
  },
  {
    "id": 422821,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-08-24T07:42:49",
    "content": "<p>You will know when you are getting old because you start telling random strangers &#8220;I&#8217;m 85 (or whatever) you know&#8221;. It always seems to end with the &#8216;you know&#8217;.<br />\nI doubt that Virginia has ever said that, it is amazing how some bodies and brains last much longer than others.<br />\nYou are an incredible lady Virginia.</p>\n",
    "parent": 0
  }
]