[
  {
    "id": 419449,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-01-26T14:49:16",
    "content": "<p>The larger question is whether the project is viable. Blaming the government is silly. The current manager is at least the fifth private developer, including Disney, that has attempted to make the old ship pay her way. So far, the project has been a public/private failure.</p>\n",
    "parent": 0
  },
  {
    "id": 419448,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2021-01-26T14:32:15",
    "content": "<p>My father, 95, still fully independent and sharp as a tack remembers getting soaked on a very rainy day as he watched Queen Mary being launched. He also remembers her transiting the narrow river to the open sea where she briefly ran aground and her doing trials off his home on the Ayrshire Coast. He also tells me the original propellers were of some revolutionary design, pardon the pun, but were replaced in Southampton immediately after her first transatlantic return trip.</p>\n<p>Construction was stopped during the great depression and he remembers that the ship was painted with red lead to try and prevent corrosion.</p>\n",
    "parent": 0
  },
  {
    "id": 419446,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-01-26T12:59:49",
    "content": "<p>What did they expect letting the ownership go to Singapore, its obvious that&#8217;s where all the revenue is going to go as well. Time to start investigating whether any of the staff of Long Beach City acquired some unexplained wealth at the time of the sale.<br />\nHmm&#8230; ship owner and ownership, anyone know how the term came about.</p>\n",
    "parent": 0
  },
  {
    "id": 419441,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2021-01-26T09:34:09",
    "content": "<p>The owner is the City of Long Beach.  They bear the ultimate responsibility.  It seems governments like to have no blame for anything.  This is just one more failure in a long sad line of failures by government.</p>\n",
    "parent": 0
  }
]