[
  {
    "id": 415525,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-08-20T07:09:05",
    "content": "<p>I had a retired teacher friend who sailed around the inland waters of southern Netherlands just using a railway map 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 415506,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-08-19T17:08:48",
    "content": "<p>To admire Marvin Creamer does nothing to disparage the amazing accomplishments of the Polynesian voyagers. In many respects, the skills of the great Polynesian navigators were far advanced beyond the skills that Dr. Creamer learned on his own.</p>\n<p>By the way, we have not ignored the Polynesian voyaging traditions on this blog. If you search for Hokulea on the search box on the upper right-hand side of the main menu bar, you will find 10 posts that either feature or reference Hokulea. (<a href=\"http://www.oldsaltblog.com/?s=HOKULEA&#038;x=12&#038;y=15\" rel=\"nofollow ugc\">http://www.oldsaltblog.com/?s=HOKULEA&#038;x=12&#038;y=15</a>) There are also several more posts about vaka, as well as reviews and background of Joan Druett&#8217;s biography of the great Polynesian navigator Tupaia.</p>\n",
    "parent": 415505
  },
  {
    "id": 415505,
    "author": "Capt. Ed Enos",
    "authorUrl": "http://DAVE%20LYMAN%20MEMORIAL%20SCHOLARSHIP%20FOUNDATION",
    "date": "2020-08-19T16:46:28",
    "content": "<p>Mr. Creamer is receiving much adulation in some maritime circles, for his accomplishment. In his many interviews, he refers to &#8220;the ancients&#8221; as early as 1978 (remember that date) and how he was amazed they sailed around without any navigational instruments. Not once in this NYT article or in any other reference I can find associated with him, does the accomplishment of the #HOKULEA even come up or mentioned. I have always been stunned by how the academic community has almost purposely overlooked the first voyages of the #Hokulea and the efforts of the #PVS in ensuing years. It&#8217;s purely speculation on my part, but I wonder if he knew of the Hokulea voyage two years before he committed to his own adventure. It would seem that was the catalyst for his endeavor.</p>\n<p>I appreciate that he sailed around the world and that is distinctly different than a Pacific Basin round trip. I&#8217;m not taking anything away from his remarkable accomplishment. But I have always wondered &#8230; When will Historians see the first 1976 Voyage of the Hokulea for what it was? That trip was an amazing real-time demonstration of the human brain to conceptualize something very abstract, keep it recorded with respect to time, distance, speed, and to be able to use an abstract picture only seen in the mind of one individual (the Navigator, Mau) and deliver the canoe to a specific location thousands of miles away, 30+ days later. And knew ALL along the way, exactly where he was in &#8216;reference&#8217; to his mental track line and his actual location. Making landfall in the middle of the ocean that is nothing more than a flat low lying beach that can hardly be seen from even just a few miles away, as any navigator can appreciate, is an amazing accomplishment.</p>\n<p>It saddens me that most people in the world have little appreciation for what Polynesian Navigators accomplished. They must have sailed thousands of voyages that we will never know of, all across the Pacific Ocean Basin, from one island group just over the horizon to another island group several weeks away. They were all done without any navigational instruments. They were doing this for generations before the European explorers even entered into the waters of the Pacific Ocean during the early stages of western discovery. These gifted Polynesian men that obtained the wisdom and experience should be celebrated for who they were and what they (amazingly) accomplished. Routinely.</p>\n<p>For those who don&#8217;t know or wish to learn more, start here:    <a href=\"http://www.hokulea.com/voyages/our-story/\" rel=\"nofollow ugc\">http://www.hokulea.com/voyages/our-story/</a></p>\n",
    "parent": 0
  },
  {
    "id": 415480,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-08-18T16:21:17",
    "content": "<p>Being at sea is mostly quite safe, its the bits around the edge that are dangerous.</p>\n",
    "parent": 0
  },
  {
    "id": 415479,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-08-18T14:37:24",
    "content": "<p>Ah, but did he or the crew make any money doing this?<br />\nDid he or his crew have any Nav charts?</p>\n",
    "parent": 0
  }
]