[
  {
    "id": 415372,
    "author": "ws",
    "authorUrl": "",
    "date": "2020-08-06T09:31:47",
    "content": "<p>There’s a maritime connection: Halifax, Beirut, black Tom</p>\n",
    "parent": 0
  },
  {
    "id": 415370,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-08-06T07:46:11",
    "content": "<p>Interesting stuff @Willy<br />\nMany years ago a rugby club I belonged to had a guy fawkes party and put all the fireworks in the groundsman&#8217;s shed for safe keeping.<br />\nThe first rocket they set off shot straight in through the open door and what followed was a very quick and colourful display followed by the wooden shed burning to the ground. Those that arrived ten minutes late missed it!<br />\nThere was no attempt to quell the flames, we just stood well back.</p>\n",
    "parent": 0
  },
  {
    "id": 415368,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-08-05T19:27:51",
    "content": "<p>I am not surprised.  As a pyrotechnician, we use it in the shells to create the &#8220;report&#8221;.  The shells that make the bang.  I also woundnt be surprised if the fireworks group was using it for making their shells.  </p>\n<p>Tho when fireworKs burn?  It is counter intuitive, yet it is best to not to try to put out the fire.  Fireworks burn cooler if you dont try to put it out.  Putting water or some form of fire suppression will make the fireworks use their own oxidiser.</p>\n",
    "parent": 0
  },
  {
    "id": 415367,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-08-05T16:43:21",
    "content": "<p>The Russian captain and Ukrainian crew of the ship impounded in Beirut that was carrying this cargo spent a year confined to the vessel. </p>\n<p>The ship was detained over the matter of US$ 100K in unpaid port fees. Adding 6 years of incompetence leaves the net result at $US -3B. Talk about unintended consequences.</p>\n<p>The root cause (owner of the vessel) is not accessible for comment.</p>\n",
    "parent": 0
  },
  {
    "id": 415366,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-08-05T14:50:47",
    "content": "<p>Ammonium nitrate that was seized off a cargo ship 6-years ago. Usually just the powder until mixed with fuel, blasting cap to set it off.</p>\n<p>Ammonium nitrate is also used as a fertilizer and to make hot packs when mixed with water. I bought one a few years ago from. &#8220;The Dollar Store&#8221;.</p>\n",
    "parent": 0
  },
  {
    "id": 415365,
    "author": "Mary Greydanus",
    "authorUrl": "http://-%20Select%20-",
    "date": "2020-08-05T11:38:11",
    "content": "<p>Halifax explosion</p>\n<p>Liberty Park (NYC) explosion</p>\n",
    "parent": 0
  }
]