[
  {
    "id": 415212,
    "author": "Karl Harding Raseman",
    "authorUrl": "",
    "date": "2020-07-23T14:38:16",
    "content": "<p>Matthew Fontaine Maury was a distant relative on my mothers side I am torn between MFM being a hero or traitor, but I&#8217;m happy that his history has not been erased like so many other things, so I can make a decision as to what kind of person he was.</p>\n",
    "parent": 0
  },
  {
    "id": 415136,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-13T15:04:03",
    "content": "<p>Greg,</p>\n<p>My comments were directed more toward Chris&#8217; comment. From an economic point of view, slavery was not dying in the US. From a political and social point of view, as you note, it was on the decline.</p>\n",
    "parent": 415134
  },
  {
    "id": 415134,
    "author": "Greg",
    "authorUrl": "",
    "date": "2020-07-12T20:45:33",
    "content": "<p>I agree with what you&#8217;re saying, Rick The point I was trying to make was that the south felt the developments mentioned above were &#8211; in the long term &#8211; the writing on the wall, and thus intolerable.</p>\n",
    "parent": 0
  },
  {
    "id": 415133,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-12T16:03:16",
    "content": "<p>Slavery may have been dying in the British Empire after 1834 but was growing dramatically in the United States.  Between 1800 and 1860 the number of slaves increased by a factor of 4.  Between 1830 and 1860, the number of slaves doubled.  The economic value of the slave economy was immense.  By the start of the war, the South was producing 75 percent of the world’s cotton and creating more millionaires per capita in the Mississippi River valley than anywhere in the nation. American slaves were worth some $3.5 billion, making them the largest single financial asset in the entire U.S. economy, worth more than all manufacturing and railroads combined. Slavery was emphatically not dying in the United States.</p>\n",
    "parent": 0
  },
  {
    "id": 415132,
    "author": "Greg",
    "authorUrl": "",
    "date": "2020-07-12T13:37:10",
    "content": "<p>Slavery was dying because the northern public was turning against it and the northern states were ascending in national power. </p>\n<p>The Lost Causers&#8217; states&#8217; rights claims are completely specious.<br />\nThe powers in the north were in favor of letting new states make their own decision on slavery. The south coudn&#8217;t tolerate this. They also could not tolerate existing northern states passing their own laws on how to deal with runaway slaves. The south wanted northern states to be forced to follow *their* laws on runaway slaves. </p>\n<p>So much for states rights.</p>\n",
    "parent": 0
  },
  {
    "id": 415129,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-07-12T12:17:43",
    "content": "<p>Slavery was a dying institution from the time that the British set up the west Africa squadron in 1834 to destroy the Atlantic slave trade, further the RN took its last slave ship in 1897 of Zanzibar  when HMS Turquoise took a Dhow from the Sultanof Zanzibar. </p>\n<p>It pains me to say that when I sailed with Capt Bill Pinkney in Amistad out of Senehal he would talk at length on how there are more in unpaid servitude than there ever were in former times. aboard Amistad we had  a crew of 16 and the Africans among the crew could not accept that without the Arab and the African tribal leaders slavery would not have worked. </p>\n<p>The European  from Drake and Hawkins 1572 voyage found something that was already going on in Africa and turned it into a commercial enterprise. We have Thomas Clarkson 1785 to thank for his efforts in recording what was happening and the Quakers who supported him with safe houses, his work was put before Wilberforce it says much that without Clarkson it would have been difficult to get a bill through Parliament. The 1839-41 Amistad incident was Americas first human rights case which is why it is so important today.</p>\n<p>I am sorry if I did not make my point adequately clear but: until the North got its act together the south was  militarily far better led and always had the better officer corps , did I read somewhere that it was a Captain Lee who was at Harpers Ferry taking down John Brown for the Union? I do not support the institution of slavery yesterday, today or tomorrow, those who exploit our labours are always wrong. We must learn from history not try to rewrite it that is how it gets forgotten. Racism takes many forms and is well practised among many creeds, here they are trying to discredit Baden Powell founder of the non racial scout movement, for the record the Scout CREED : </p>\n<p>&#8220;A scout is a friend and a brother to all no matter what country or creed the other may belong&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 415118,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-07-10T23:16:44",
    "content": "<p>Uh-oh, memory has become corrupted again, &#8211;already&#8211;! </p>\n<p>CTRL-ALT-DEL</p>\n<p>(reboot)</p>\n<p>&#8220;&#8230;right of property in negro slaves&#8230;&#8221;</p>\n<p>&#8220;&#8230;their slaves and other property&#8230;&#8221;</p>\n<p>&#8220;&#8230;right of property in said slaves &#8230;.&#8221;</p>\n<p>&#8220;&#8230;delivered up on claim of the party to whom such slave belongs&#8230;&#8221;</p>\n<p>&#8220;&#8230;any slaves lawfully held by them&#8230;&#8221;</p>\n<p>There we go, the canonical constants are restored and we have an accurate assessment. </p>\n<p>Definitive, authoritative, self-described by those who created the history.</p>\n",
    "parent": 0
  },
  {
    "id": 415106,
    "author": "JaimeInTexas",
    "authorUrl": "",
    "date": "2020-07-09T21:27:24",
    "content": "<p>My early primary source of history were teachers, nuns, from Buffalo, New York, and not anywhere close to Texas.<br />\nI read history.<br />\nI do not say, nor I have said that slavery was not an issue but if you go back to the Louisiana Purchase, the war of 1812, followed by the annexation of Texas, the war with Mexico, and the Tarriffs of Abomination, secession and a State&#8217;s authority to re-assert its independence was raised. What was different in 1861, among other things, was the actual secession, not to take over these uSA but to leave.<br />\nThose are facts and not &#8220;legalistic claptrap.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 415102,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-09T18:25:54",
    "content": "<p>As Kevin notes slavery was not on the decline in the US &#8220;on account of the British destroying the Atlantic Slave Trade.&#8221; The US banned the importation of slaves in US ships in 1794 and imposed an outright ban in 1807. British parliament followed suit in the same year.</p>\n<p>The problem here is that the history of the Civil War has subject to a campaign of lies for the last hundred years by those committed to retaining and enforcing white supremacy. From textbooks downplaying slavery to monuments glorifying traitors, we are now working through the process to correct those lies. </p>\n<p>Maury is an unfortunate and lesser player in this. Nevertheless, he used his brilliance to kill his fellow US Navy officers and sailors in significant numbers in the battle to perpetuate slavery.</p>\n",
    "parent": 415099
  },
  {
    "id": 415101,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-07-09T17:32:59",
    "content": "<p>Chris Roche &#8211; you are wrong and your post rings of &#8220;Lost Cause&#8221; rhetoric.  The Act Prohibiting Importation of Slaves was passed in 1807 and went into effect in 1808.  However slave population continued to rise and peaked in the US at 4 million in 1860.  Laws were passed and upheld to continue the institution of slavery, e.g. Dred Scott and Fugitive Slave Act up to the Civil War.  Approximately 25% of the families in slave holding states had slaves &#8211; a minority but not a small minority.  Most statues of the traitorous &#8220;heroes&#8221; of the Confederacy were erected during the Jim Crow era to further subjugate African-Americans.  Acknowledging a wrong and correcting it is always the right thing to do.  </p>\n<p>It is ironic that you say &#8220;the gentlemen who have been removed were all superb masters of their trade&#8221; since they were all slave masters.</p>\n<p>Speaking of traitors, I saw that England has a plaque honoring Benedict Arnold as an &#8220;American Patriot&#8221; at his former London home.</p>\n",
    "parent": 0
  },
  {
    "id": 415099,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-07-09T16:50:49",
    "content": "<p>leaving aside most of the arguments for and against I have to say from a British perspective the way I see it the war was about Southern rights slavery was dying on account of the British destroying the Atlantic Slave Trade. At the beginning even Lincoln did not see it as the issue so much as he did uniting his country do not forget that is why he went to war. Why on earth was General Sherman answered in the way he was when he after cutting the south in half  asked &#8220;why do you continue to fight&#8221; to a group of defeated Confederate soldiers ragged and bootless &#8220;Sir you were not invaded &#8221; remember the South did not invade the north had it done so it would have won at the first battle of the Potomac. The south always had the better generals, was not Lee offered command of both sides the only time in history that happened, The South had not the manufacturing might of the North, it is a surprise that  so much was achieved with so little. Take the navy it did not exist at time of seceding when the battle took place on the plate against Graf Spee how many know that Raphael Semmes biography was compulsory reading for Lansdorfs officers who studied his tactics. The majority of Confederate soldiers did not of course own slaves. the gentlemen who have been removed were all superb masters of their trade and should be remembered for that and honoured as such.  We rewrite history at our peril.</p>\n",
    "parent": 0
  },
  {
    "id": 415097,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-07-09T14:31:12",
    "content": "<p>Maury and Britain&#8217;s Francis Beaufort are two of my favorite Age of Sail individuals. Both did much to help the world&#8217;s ships and sailors have safer passages on the world&#8217;s oceans.<br />\nThey should both be celebrated at maritime museums instead of casting aspersions on Maury&#8217;s Confederate history.</p>\n",
    "parent": 0
  },
  {
    "id": 415096,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-09T13:27:52",
    "content": "<p>The statue of Maury was all about defending his role in the Confederacy. It was erected in 1929 on Monument Row in Richmond along with other Confederate heroes/traitors. Monument Row was all about white supremacy not art or history.</p>\n",
    "parent": 415092
  },
  {
    "id": 415095,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-09T13:24:55",
    "content": "<p>Spare me the legalistic claptrap. You ask what lies and then provide several fine examples. I grew up in Texas and heard all the Lost Cause lies. The war was not about slavery but states rights. Slaves were well treated and happy. The treasonous rebellion was a noble struggle for freedom (for white folks.) All lies.</p>\n",
    "parent": 415093
  },
  {
    "id": 415093,
    "author": "JaimeInTexas",
    "authorUrl": "",
    "date": "2020-07-09T12:08:23",
    "content": "<p>Which lies. That the winner of the contest views the loser as traitors. I wonder how the British viewed the ungrateful Colonialist?<br />\nThe difference is that under a monarchy the only legal framework for independence except by petitioning the crown or revolution. Under the Constitution Of These uSA the legal framework was one of sovereign States joining under, first, a mutual assistance compact to gain their independence (see Treaty Of Paris 1783) and, then, by seceding from the the 1st compact to join under a new compact.<br />\nDid the States under the new compact of 1787 cede their authority to leave/secede and resume those delegated power? That was what the contest was about. Yes, slavery was very much the fire but the fuel for that fire was the nature of the compact &#8212; a consolidated unitary government or an union of States.<br />\nMaybe the problem is not &#8220;The Lost Cause&#8221; but the rewriting of history to fit the victor&#8217;s.<br />\nThere was more legal justification for secession by the [Southern] States than by the Colonies under the British Crown.</p>\n",
    "parent": 0
  },
  {
    "id": 415092,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-07-09T12:08:03",
    "content": "<p>Is the US Navy going to stop using mines because they were invented by a Confederate? If not, removing the statue is morally questionable.<br />\nAlso, is if the statue was erected to celebrate the chaps efforts on behalf of the losers in the war against slavery then, in my opinion, it should be removed. But, if it was erected to celebrate his achievements in advancing navigation techniques then it is perfectly acceptable. Which is why I suggested in my earlier post the it should be relocated to a college or museum.<br />\nThe whole question is a bit of a minefield. We have to consider the artistry involved by the sculptor. After all a sculpture is just a three dimensional picture. Should the pictures in the art galleries be destroyed, shortly followed by the burning of books in the libraries.<br />\nThe situation can quite quickly get out of hand. Just improve education.</p>\n",
    "parent": 0
  },
  {
    "id": 415091,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-07-09T11:22:22",
    "content": "<p>The Lost Cause mythology is not history. It is a package of lies that distort and destroy history. If we are to move forward we need to remove the lies.</p>\n",
    "parent": 415087
  },
  {
    "id": 415088,
    "author": "JaimeInTexas",
    "authorUrl": "",
    "date": "2020-07-09T09:57:49",
    "content": "<p>Doug. I guess you prefer the terms &#8220;bound to Service,&#8221; and &#8220;other Persons&#8221; and to &#8220;fugitive slave laws.&#8221;<br />\nSay what you will of CSA&#8217;s Consitution but it did not deal in ingenious terminology.<br />\nIMO, CSA&#8217;s Constitution applied lessons learned from cases brought to the SCOTS, laws passed and amendments made to the uSA&#8217;s Constitution. As to slavery, it made explicit how slavery/slaves were to dealt by the CSA&#8217;s Federal government and its courts.<br />\nAnd, the CSA&#8217;s Consitution maintained a means on how to be amended.</p>\n",
    "parent": 0
  },
  {
    "id": 415087,
    "author": "Donald C.A Watson",
    "authorUrl": "",
    "date": "2020-07-09T09:55:18",
    "content": "<p>I have been watching events in the US over the last few weeks and am stunned to see what is happening. A country&#8217;s history, be it good or bad, is the country&#8217;s history. </p>\n<p>The wanton destruction of Monuments, Statues etc is terrible but what is more terrible is the apparent lack of protest against these acts. Wake up America before all your history has gone.</p>\n",
    "parent": 0
  },
  {
    "id": 415086,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-07-09T06:31:26",
    "content": "<p>I had an uncle who served as a Lieutenant on the USS Maury (DD-401) during WW2 from 1942 until the end of the war.  16 Battle Stars and a Presidential Unit Citation later she was scrapped in 1946.</p>\n<p>I wonder what he would think about the current unpleasantness over Confederate statues.  I am sure it never bothered anyone onboard while they were engaged with the Japanese that Maury was potentially considered a traitor.</p>\n",
    "parent": 0
  },
  {
    "id": 415069,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-07-08T20:04:35",
    "content": "<p>We&#8217;re hearing a lot about &#8220;heritage&#8221; being disrespected, obliterated. </p>\n<p>It&#8217;s always helpful to see where the anchor of that heritage was dropped. Here&#8217;s the ground as written by the founders of the Confederacy, in their constitution and proudly published for all to see:</p>\n<p>Article 1, section 9 ,(4)</p>\n<p>No bill of attainder, ex post facto law, or law denying or impairing the right of property in negro slaves shall be passed.</p>\n<p>Article IV, section 2,(1)</p>\n<p>The citizens of each State shall be entitled to all the privileges and immunities of citizens in the several States; and shall have the right of transit and sojourn in any State of this Confederacy, with their slaves and other property; and the right of property in said slaves shall not be thereby impaired.</p>\n<p>Article IV, section 2,(3)</p>\n<p>No slave or other person held to service or labor in any State or Territory of the Confederate States, under the laws thereof, escaping or lawfully carried into another, shall, in consequence of any law or regulation therein, be discharged from such service or labor; but shall be delivered up on claim of the party to whom such slave belongs,. or to whom such service or labor may be due.</p>\n<p>Article IV, section 3,(3)</p>\n<p>The Confederate States may acquire new territory; and Congress shall have power to legislate and provide governments for the inhabitants of all territory belonging to the Confederate States, lying without the limits of the several Sates; and may permit them, at such times, and in such manner as it may by law provide, to form States to be admitted into the Confederacy. In all such territory the institution of negro slavery, as it now exists in the Confederate States, shall be recognized and protected be Congress and by the Territorial government; and the inhabitants of the several Confederate States and Territories shall have the right to take to such Territory any slaves lawfully held by them in any of the States or Territories of the Confederate States.</p>\n",
    "parent": 0
  },
  {
    "id": 415067,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-07-08T17:02:49",
    "content": "<p>Offer it for sale to a British naval college or museum.</p>\n",
    "parent": 0
  },
  {
    "id": 415064,
    "author": "will",
    "authorUrl": "http://tugster.wordpress.com",
    "date": "2020-07-08T14:24:36",
    "content": "<p>Interesting post.  And &#8220;W. H. Bunting contributed&#8221;  I&#8217;m intrigued.  His books have long been favorites of mine .  . .</p>\n",
    "parent": 0
  }
]