[
  {
    "id": 418282,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-11T19:47:47",
    "content": "<p>As I understand it certain waterways in North America have speed limits for commercial vessels to reduce the number of impacts with whales and vessels can be fined for inappropriate passages.<br />\nWe certainly need more information about UFO incidents, maybe cameras can be installed in the leading edges of keels, foils and rudders to help analyse strikes.</p>\n",
    "parent": 0
  },
  {
    "id": 418266,
    "author": "Patrice Ayme",
    "authorUrl": "https://patriceayme.wordpress.com/",
    "date": "2020-12-10T13:33:01",
    "content": "<p>Let me address the fear that some of the Unidentified Floating Objects boats with foils flying above water may encounter, and why one should not be afraid of it.</p>\n<p>Technological progress is important: it is the essence of humanity and gave birth to it through a process of artificially natural self-selection. In particular present humanity, with 7.8 billion individuals, using the technologies it had to use to get to its present situation, has put spaceship Earth on an unsustainable course. </p>\n<p>There are two ways out of this: either a spectacular regression, through war, famine and collapse, or a spectacular progress into new technologies which will make our integration with the biosphere sustainable again. </p>\n<p>Sailing technology and flying above water could be technologies of the future even for the most massive transport of goods and people. The latter essential activity creates much of the world’s pollution as it is, and it is therefore essential to reduce it. The impact on sea mammals could probably be reduced precisely because the foils make noise, and should warn sea creatures. Maybe studies could be made to generate a clearer warning, or maybe collisions are mostly with man-made oceanic debris, and that, per se, should be an important object of study leading to diminution thereof.  </p>\n<p>Other ships collide with sea creatures, but nobody cares as the ships are too large to be affected by the collisions. Hence the travails of maxi-trimarans with UFOs attract attention to this problem, which has been so far ignored. Efforts to avoid collisions, necessary for the maxi flying trimarans, could then lead to reducing collisions and pollutants in the high seas, both laudable objectives. So let’s celebrate the efforts to fly on boats around the world in less than 40 days! Such efforts are not just technological and even scientific prowesses, but also economic and moral prowesses!</p>\n",
    "parent": 0
  },
  {
    "id": 417966,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-11-28T17:54:07",
    "content": "<p>My only concern?  The boat appears to make alot of noise.  Sailboats are normally quiet.  These appear to howl when under sail.  I cant help but wonder what noise is being generated in the water.  The UFO?  Could have been a marine mamal that came up to see what the noise was?</p>\n<p>The crew has no way to tell if they had hit something living.  By the time that boat comes to a stop, it will probably gone at least 300 yard from the point of impact.  Generally a creature that gets attacked will leave the area.  I am not of Greenpeace or save the dolphins movement.  Yet if a dolphin were to try and ride the pressure wave?  I dont know where to take this further.  Some one help me out here.</p>\n",
    "parent": 0
  }
]