[
  {
    "id": 406341,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-06-05T14:36:25",
    "content": "<p>Willy, Wow!</p>\n<p>What a depressing position.</p>\n<p>I hope that things can be turned around but I know it is difficult in the selfish society that has been created by this social media circus.</p>\n",
    "parent": 0
  },
  {
    "id": 406330,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-04T17:24:07",
    "content": "<p>&#8220;If they are caught they should be tried for attempted manslaughter*&#8221;</p>\n<p>Here in Maine alot of things wont happen.  Your supposed charge might work else where, yet not in Maine.  There are hunters that come here from Massachussetts whom kill locals and may only see two years in jail for trespassing or failing to alert authorities in quickest means possible.</p>\n<p>We are a depressed society here in Maine.  A great deal happens here that goes away with time.  More than likely it is a tourist that is stealing the bells.  As the locals know not to take them.</p>\n",
    "parent": 0
  },
  {
    "id": 406326,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-06-04T14:13:38",
    "content": "<p>&#8220;A certain number of brass bells and gongs from bell and gong buoys off the coast of Maine have turned up missing&#8221;</p>\n<p>Whilst the difference in our languages amuses me, it is beyond the pail that such vandalism and theft occurs. The bells and whistles are invaluable in fog on vessels large and small.</p>\n<p>ps: I do hope they turn up found.</p>\n",
    "parent": 0
  },
  {
    "id": 406325,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-06-04T11:26:31",
    "content": "<p>I wonder about my dad&#8217;s brass grave headstone?<br />\nThey stole brass markers off the sides of churches here, what&#8217;s next?</p>\n",
    "parent": 0
  },
  {
    "id": 406324,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-06-04T10:26:10",
    "content": "<p>Presuming that the items were removed by seafaring folk the mind boggles at their stupidity. If they are caught they should be tried for attempted manslaughter*<br />\n*this may not be an actual offence but hopefully you will understand how seriously this should be taken.</p>\n",
    "parent": 0
  },
  {
    "id": 406321,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-04T08:15:16",
    "content": "<p>I am surprised they havent gone after the whistles as well</p>\n",
    "parent": 0
  }
]