[
  {
    "id": 418386,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-12-14T11:22:47",
    "content": "<p>The savings from one mast are significant even if they are in single digits percentages. Most sail assist designs that offer these levels of savings, project a three-year payback period. Of course, this will also depend on fuel prices, route, and a number of other factors. As Jean-Pierre suggests this looks like a trial installation of a wholly new design. Measuring performance and tweaking operating issues will be easier with a single sail.</p>\n",
    "parent": 418327
  },
  {
    "id": 418337,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-13T09:25:47",
    "content": "<p>@Irwin Bryan<br />\nI expect that is what they are trying to deduce, not worth going for all nine* masts till you know if they are going to be worth it 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 418327,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-12-13T01:58:53",
    "content": "<p>Rick, you know anything with sails is fine with me, but what&#8217;s the cost-benefit? How much extra will the ship cost to build and how soon would the savings in fuel costs be greater than the build cost?</p>\n",
    "parent": 0
  },
  {
    "id": 418312,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-12-12T15:30:57",
    "content": "<p>Ok, wind assisted but carrying coal. Getting there. We&#8217;ll take it.  😉</p>\n<p>And yeah to Jean-Pierre. How many people know what a steaming light is for, really? I&#8217;ve heard them called &#8220;fog lamps,&#8221; &#8220;auxiliary anchor light.&#8221; 😀</p>\n",
    "parent": 0
  },
  {
    "id": 418306,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-12T09:09:55",
    "content": "<p>I don&#8217;t see the inverted black cone signifying that the vessel is also under mechanical power and subject to those particular colregs. They had better watch out in Belgium&#8217;s national waters where yacht skippers have been fined for that omission.</p>\n",
    "parent": 0
  },
  {
    "id": 418305,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-12T09:02:10",
    "content": "<p>Presumably this is just a test with only one mast. It will be interesting to compare the efficiency, practicality and cost effectiveness against Flettner Rotor ships</p>\n",
    "parent": 0
  },
  {
    "id": 418283,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-11T21:05:28",
    "content": "<p>looking forward to seeing her under sail</p>\n",
    "parent": 0
  }
]