[
  {
    "id": 410243,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-04-17T14:17:23",
    "content": "<p>$43 Mil is othing.</p>\n<p>Navy’s $128 Billion Nuclear Submarine Project Faces Audit<br />\nBy Anthony Capaccio<br />\nApril 17, 2019, 4:00 AM EDT<br />\n<a href=\"https://www.bloomberg.com/news/articles/2019-04-17/navy-s-128-billion-nuclear-sub-project-faces-watchdog-s-review\" rel=\"nofollow ugc\">https://www.bloomberg.com/news/articles/2019-04-17/navy-s-128-billion-nuclear-sub-project-faces-watchdog-s-review</a></p>\n",
    "parent": 0
  },
  {
    "id": 410239,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-04-16T19:52:12",
    "content": "<p>&#8220;The Orca is a design based on the Boeing Echo Voyager demonstration submarine with a range of 6,500 nautical miles. The vessel measures 51 by 8.5 by 8.5 feet and has a dry weight of 50 tons. The Echo Voyager has a maximum speed of around eight knots underwater and can dive to depths up to 11,000 feet deep. Its batteries give it a range of more than 150 miles at a speed of around 3 knots before it needs to surface and use its air-breathing diesel generator to recharge. Boeing has said that Echo Voyager could carry enough fuel to allow it to operate autonomously for up to six months at a time. It has its own sonar-enabled obstacle avoidance system, as well as an inertial navigation system.&#8221;</p>\n<p>$43 million?</p>\n<p>As we say in Scotland. Aye! Right!</p>\n",
    "parent": 0
  },
  {
    "id": 410238,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-04-16T17:15:25",
    "content": "<p>The Killer Whale Submarine<br />\nDescription<br />\nThis is the streamlined, two-person watercraft that breaches and submerges just like the Orcinus orca after which it is designed. A pilot protected beneath its watertight 1/2&#8243;-thick acrylic canopy pushes and pulls twin control levers to articulate the whale&#8217;s pectoral fins for rolls and stealthy dives. With a finger on the right lever&#8217;s throttle trigger, steering is provided by dual foot pedals that control the vectored thrust of the craft&#8217;s 255-hp supercharged Rotax axial flow engine, enabling realistic behaviors such as porpoising or skyhopping. It can hydroplane up to 50 mph over the water&#8217;s surface and it can cruise up to 25 mph while submerged; its dorsal fin&#8217;s integrated snorkel ensures air supply to the engine up to a depth of 5&#8242;. The cockpit&#8217;s dashboard includes a speedometer, tachometer, engine and air pressure gauges, and an LCD that displays live video from the dorsal fin&#8217;s built-in camera. Vinyl seats with closed-cell foam upholstery and four-point racing harnesses ensure pilot and passenger safety. With 14-gallon fuel tank. Special conditions and guarantee limitations apply. Please call 1-800-227-3528 for details. 17 1/4&#8242; L x 3 1/2&#8242; W x 4 3/4&#8242; H. (1,450 lbs.)<br />\n<a href=\"https://www.hammacher.com/product/killer-whale-submarine\" rel=\"nofollow ugc\">https://www.hammacher.com/product/killer-whale-submarine</a></p>\n<p>Ah, but wait!</p>\n<p>The Navy Just Ordered the &#8216;Orca,&#8217; an Extra-Large Unmanned submarine.</p>\n<p>Feb 14, 2019 &#8211; The unmanned submarines, called Orcas, will be able to undertake missions from scouting to sinking ships at very long ranges. Drone ships &#8230;<br />\n<a href=\"https://www.popularmechanics.com/military/navy-ships/a26344025/navy-extra-large-unmanned-submarines-boeing/\" rel=\"nofollow ugc\">https://www.popularmechanics.com/military/navy-ships/a26344025/navy-extra-large-unmanned-submarines-boeing/</a></p>\n",
    "parent": 0
  }
]