[
  {
    "id": 414583,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-05-23T08:13:55",
    "content": "<p>This must be the closest any group of people have got to the numbers required* for herd immunity.<br />\n*BBC ScienceFocus says:<br />\nWhat is herd immunity?<br />\nHerd immunity is what happens when enough people are immune to a disease (in this case, COVID-19) for the chains of transmission to be broken. As more people become immune, infected people are less able to pass on the disease, and the spread of the disease slows down. This provides an indirect form of protection for those who are not immune.</p>\n<p>Usually, individuals become immune through vaccination. But there isn’t yet a vaccine for coronavirus, so herd immunity could only currently be achieved if enough people contract the disease and recover, developing an immunity to it in the process.</p>\n",
    "parent": 0
  },
  {
    "id": 414566,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-05-21T18:42:32",
    "content": "<p>A couple of excellent articles on the extremely difficult detail work needed to keep crews safe:</p>\n<p><a href=\"https://www.seattletimes.com/seattle-news/trawl-fishing-in-the-age-of-the-coronavirus-first-you-make-it-through-quarantine/\" rel=\"nofollow ugc\">https://www.seattletimes.com/seattle-news/trawl-fishing-in-the-age-of-the-coronavirus-first-you-make-it-through-quarantine/</a></p>\n<p><a href=\"https://www.seattletimes.com/business/as-alaska-fishing-season-set-to-begin-fearful-communities-and-seafood-industry-try-to-prevent-spread-of-coronavirus/\" rel=\"nofollow ugc\">https://www.seattletimes.com/business/as-alaska-fishing-season-set-to-begin-fearful-communities-and-seafood-industry-try-to-prevent-spread-of-coronavirus/</a></p>\n<p>Trying to do this correctly, not imposing involuntary devastation on various &#8220;outsiders&#8221;  is extremely difficult. Trident is doing an exemplary job but even so there&#8217;s still too much odds-making in the mix.</p>\n",
    "parent": 0
  },
  {
    "id": 414565,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-05-21T18:32:27",
    "content": "<p>In the long run this episode may turn out to have been one of the <i>milder</i> ones. Experts on pathogens tell us to expect such a thing. As with the initial emergence of COVID-19 our minds are wired not to want to &#8220;go there&#8221; and we&#8217;ll try to whistle past the facts, reflected in the optimistic application of &#8220;may turn out.&#8221; </p>\n<p>We could look on this outbreak as an expensive and fairly horrific training exercise to help deal with worse to come. I&#8217;m sure the Navy is doing so, in terms of lessons learned, documentation. </p>\n<p>It&#8217;s not a pleasant type of recurrent training to contemplate.</p>\n",
    "parent": 0
  }
]