[
  {
    "id": 412809,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-11-20T15:40:43",
    "content": "<p>The only real change is that the traditional raster charts will be going away. The ENC versions will be available in PDF versions and one can only hope that publishers will still publish chart books using the ENC rather than the old raster format.  Whether a boater keeps an electronic or a paper backup will be a personal decision. I&#8217;d probably have both.</p>\n",
    "parent": 0
  },
  {
    "id": 412807,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-20T15:17:04",
    "content": "<p>I failed to mention, NOAA still has charts online, good luck finding what you need.<br />\n<a href=\"https://www.charts.noaa.gov/ChartCatalog/MapSelect.html\" rel=\"nofollow ugc\">https://www.charts.noaa.gov/ChartCatalog/MapSelect.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 412805,
    "author": "Ed Ellis",
    "authorUrl": "",
    "date": "2019-11-20T10:47:52",
    "content": "<p>Exactly!</p>\n",
    "parent": 0
  },
  {
    "id": 412804,
    "author": "Peter Brasford",
    "authorUrl": "",
    "date": "2019-11-20T10:41:52",
    "content": "<p>I have gps on my 22ft catboat, but only use in times of fog etc.  My chart book is always out when sailing more than a short distance, and used at home for planning. This is a horrible idea, ok for ships and larger boats with more people on them. Luckily I am older, my old charts will have to last!!Peter.</p>\n",
    "parent": 0
  },
  {
    "id": 412802,
    "author": "Erik ABRANSON",
    "authorUrl": "",
    "date": "2019-11-20T09:34:33",
    "content": "<p>This is frightening. All electronic navigational aids are practical BUT&#8230; Given the doubtful reliablity of on-board electronics, given a good virus attack by a hostile power and the loss of all satellite connections within the first few seconds of a major conflict, it is folly not to have paper charts, and, if offshore sailing, a sextant, a chronometer and tables on board. These could be just as lifesaving as the mandatory carrying of life rafts.</p>\n",
    "parent": 0
  },
  {
    "id": 412797,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-11-19T20:51:50",
    "content": "<p>IMO does allows the operation of ECDIS in RCDS mode as a backup. This is essentially digital scans of charts without full ECDIS functionality. Given the relative costs, most ship owners choose to install a second ECDIS system.</p>\n",
    "parent": 412796
  },
  {
    "id": 412796,
    "author": "Kim Smith",
    "authorUrl": "",
    "date": "2019-11-19T17:43:06",
    "content": "<p>It is a solas requirement to either have paper charts or two separate ECDIS systems set up with approved hardware. This may not be practical for some small operators. I got into the habit of always having the paper chart of the area I’m navigating out on the table. I like it because it gives a larger perspective. I also depend almost exclusively on the electronic chart but I still like to have the paper one out for reference.</p>\n",
    "parent": 0
  },
  {
    "id": 412795,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-19T17:03:23",
    "content": "<p>Sorry, but this is old news on the great lakes.<br />\nThey got rid of them several years ago, unfortunately.<br />\nWith GPS, I guess they didn&#8217;t feel the need.</p>\n<p>Thankfully they stopped issueing weather reports in all CAPS, I hated that.<br />\nThen again my GPS burned  through batteries even when off, what an idiot design.</p>\n",
    "parent": 0
  }
]