[
  {
    "id": 407404,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-10-05T17:46:46",
    "content": "<p>Once Again The  Main Stream media is wasting our time:<br />\nIndonesia rocked by powerful quake, tsunami warning called off!!!</p>\n<p><a href=\"https://www.france24.com/en/20180928-indonesia-rocked-powerful-quake-tsunami-warning-called-off\" rel=\"nofollow ugc\">https://www.france24.com/en/20180928-indonesia-rocked-powerful-quake-tsunami-warning-called-off</a></p>\n<p>An Indonesian friend of mine tipped me off to this Giant Boo-boo</p>\n",
    "parent": 0
  },
  {
    "id": 407383,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-10-03T14:22:15",
    "content": "<p>You have only to look at the topography of the bay with Palu at its head to realise that it is a tsunami magnet in an area rather prone to earthquakes. Is this the first such incident there?<br />\nWill they rebuild the city&#8230; of course they will. It will never happen again they will say.<br />\nShould they be given more warning buoys? Hmm, what do you think?</p>\n",
    "parent": 0
  },
  {
    "id": 407382,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2018-10-03T13:07:57",
    "content": "<p>Oregon State University&#8217;s Chris Goldfinger points out that these buoys are worthless for near-field tsunami warning.  If they had been working, it wouldn&#8217;t have mattered.  Responding to news this buoy system would have saved many lives, Dr. Goldfinger responded on Facebook&#8217;s Pacific Northwest Earthquake Discussion Group:  </p>\n<p>&#8220;This is dead wrong. This has been a long-term issue of miseducation. The tsunami warning systems are ineffective for the locals in a near field event. In Japan when I was there, they were effective for places that had longer travel times along the coast and up rivers, but the most proximal areas will never be served by them. The earthquake is the only effective warning, and education is key. In the US, the DART system was heavily oversold to Congress , and that legacy today means the we continue to pour money into the DART system while the states education programs languish. These warning systems cannot help in a local earthquake, whether in Indonesia, or anywhere else.&#8221;</p>\n<p>If you are on a beach on experience a large earthquake, run, do not walk, to higher ground.  If you wait for a warning, you will probably die.</p>\n<p>btw, great blog!  As a former USNR Engineering Duty Officer, I find the content very interesting!</p>\n",
    "parent": 0
  }
]