[
  {
    "id": 424881,
    "author": "Stephen Cobb",
    "authorUrl": "",
    "date": "2021-12-16T19:07:02",
    "content": "<p>I believe the same can be said of Madera and port wine. (Spains&#8217;s Juan Sebastian d&#8217;Elcano always carries a few barrels). Maybe whiskey? Perhaps there&#8217;s a profitable cargo there.</p>\n",
    "parent": 0
  },
  {
    "id": 424880,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2021-12-16T15:57:04",
    "content": "<p>Is there Akvavit in the hold?</p>\n<p>(Peculiar to the Norwegian tradition are Linje Aquavits (such as &#8220;Løiten Linje&#8221; and &#8220;Lysholm Linje&#8221;). Linje Aquavit is named after the tradition of sending oak barrels of aquavit with ships from Norway to Australia and back again, thereby passing the equator (&#8220;linje&#8221;) twice before being bottled. The constant movement, high humidity and fluctuating temperature cause the spirit to extract more flavour and contributes to accelerated maturation.)</p>\n",
    "parent": 0
  },
  {
    "id": 424861,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-12-14T13:09:35",
    "content": "<p>We&#8217;ve updated the post. Thanks.</p>\n",
    "parent": 424860
  },
  {
    "id": 424860,
    "author": "Carolina Salguero",
    "authorUrl": "http://www.portsidenewyork.org",
    "date": "2021-12-14T12:07:45",
    "content": "<p>We were contacted by a NYC liaison of this visit to assist with berth location planning. You got your blogpost up before he told us of the visit which is now fully booked. You might want to update your post</p>\n<p>&#8220;Registrations: The Event is now fully booked&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 424859,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-12-14T10:57:00",
    "content": "<p>Thanks for the clarification.</p>\n",
    "parent": 0
  },
  {
    "id": 424858,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2021-12-14T10:46:45",
    "content": "<p>Don`t be fooled and join for the Cape Horn voyage as entry on the Cape Horners register. It will not be a qualifier for the world renowned IACH the International Association of Cape Horners whose rules require a passage of over 3000 sea miles under sail alone (enginless) including passing through 52 degrees on both sides of the Horn. A passage from Ushuia to Ushuia rounding Cape Horn Island does not qualify sadly.</p>\n<p>I wish those who make the passage a safe one and even so an experience they will remember.</p>\n<p>www,capehorners.org </p>\n<p>Chris Roche Cape Horners Archivist</p>\n",
    "parent": 0
  }
]