[
  {
    "id": 407934,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2018-11-11T10:36:00",
    "content": "<p>On Veterans Day and the Centenary of WW I it’s especially meaningful to be reminded that soldiers, sailors and airmen face dangers everyday and everywhere they serve.</p>\n",
    "parent": 0
  },
  {
    "id": 407922,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-11-10T19:15:18",
    "content": "<p>Sounds like Norway needs to take a cue from the US Navy and figure out why people are ignoring other traffic.</p>\n",
    "parent": 0
  },
  {
    "id": 407909,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-11-10T13:37:53",
    "content": "<p>I should add, in the market I work in it&#8217;s a routine occurrence for skippers to ground boats despite rather fanatical efforts to make them aware of charts on MFDs and to diligently explain how with a few button-presses on a cyclic basis there is no excuse for doing what in the aviation world is termed a &#8220;controlled flight into the ground.&#8221; </p>\n<p>Surely naval officers are better than credit card captains? Where&#8217;s the pride?</p>\n<p>As with our little dinky vessels I look at <i>Helge Ingstad</i> and wonder &#8220;how much lost time in service and how much money is it going to take to get her working again,&#8221; and  as always the unanswerable &#8220;why?&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 407908,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-11-10T13:15:44",
    "content": "<p>RTFM, maybe?  </p>\n<p>For naval officers, notice that there&#8217;s this thing called &#8220;CPA&#8221; that is available on a plethora of displays. Our itsy-bitsy boat does it via radar, AIS and with a few pushes of buttons it becomes hard to ignore the computational results. </p>\n<p>Once you&#8217;ve read the manual, you can then know that the lines emanating from targets are actually something called &#8220;vectors,&#8221; that show the future position of other vessels as well as own. </p>\n<p>It&#8217;s really all  very cool and quite career-saving. Skip polishing some brass, RTFM.</p>\n",
    "parent": 0
  }
]