[
  {
    "id": 415308,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-07-30T16:47:11",
    "content": "<p>Shark Searches</p>\n<p>(Harpswell) The Maine Marine Patrol continues targeted patrols in southern Maine after a fatal shark attack near Bailey Island on Monday. The patrols are being conducted to help confirm the presence, location, and species of sharks. Anyone who sees a shark is encouraged to report it to a local Marine Patrol officer. This information will be used by Marine Patrol, working with a Massachusetts Department of Marine Fisheries Senior Scientist, to identify the species of shark sighted. Photos and video will also help in confirming the species.</p>\n<p>Shark Sighting</p>\n<p>(Cumberland) Cumberland town officials issued a shark advisory for Broad Cove Reserve Wednesday, after reports of a shark near Cousins Island in Yarmouth. Following Monday’s fatal shark attack off the coast of Bailey Island, officials are advising residents not to enter the water at the reserve beyond ankle depth. The Maine Marine Patrol continues to patrol for sharks in southern Maine and encourages anyone who sees a shark to report it to a local Marine Patrol officer.</p>\n",
    "parent": 0
  },
  {
    "id": 415299,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-07-29T19:32:07",
    "content": "<p>The rest of the story from the local radio station.  This is from a news feed sent to the local station for broadcasting.  I can provide the entire script if needed.</p>\n<p>(Harpswell) The Maine Marine Patrol has identified the 63-year-old woman from New York City who was attacked and killed by a shark Monday afternoon while swimming in Mackerel Cove off Bailey Island. Officials say Julie Holowach was wearing a wet suit at the time of the attack. Her daughter was also swimming and escaped the water without injury. Department of Marine Resources spokesman Pat Keliher says this type of attack is abnormal for Maine.</p>\n<p>Keliher says the last confirmed shark attack in Maine waters was 10 years ago near Eastport. </p>\n<p>A tooth fragment recovered from a shark attack in the Casco Bay area on Monday confirms a woman was fatally injured by a great white shark. Officials say 63-year-old Julie Holowach of New York City was wearing a wet suit, possibly causing the shark to mistake her for a seal, when she was swimming in Mackerel Cove off Bailey Island. Marine patrol spokesman Rob Beal says they continue monitoring the area where the attack took place and they ask the public to do the same.</p>\n<p>Kayakers helped get Holowach to the shore, but first responders pronounced her dead at the scene. Her daughter was also swimming with her and escaped the water without injury. </p>\n<p>Authorities have identified the woman who died Monday from injuries sustained in a shark attack near Bailey Island.  A tooth fragment helped identify the shark as a Great White.  The Maine Department of Marine Resource reports that 63-year-old Julie Holowach of New York City was swimming about 20 yards off shore near White Sails Lane when she was attacked. Kayakers brought Holowach to shore where first responders pronounced her dead. Swimmers and boaters near Bailey Island are urged to use caution and avoid swimming near schooling fish or seals.</p>\n<p>  Authorities say the woman killed in a rare shark attack off Maine’s coast was a 63-year-old resident of New York City. The Maine Department of Marine Resources says the shark fatally bit Julie Holowach off Bailey Island on Monday while she was swimming. The marine patrol says two kayakers helped her get to shore, and an ambulance provided further assistance, but Holowach was pronounced dead at the scene.  A tooth fragment helped identify the attacking shark as a Great White.</p>\n",
    "parent": 0
  }
]