[
  {
    "id": 417579,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-11-14T16:17:00",
    "content": "<p>Thanks for the tip about corked wine Peter. You can tell if it is corked by smelling the bottom of the cork.</p>\n",
    "parent": 0
  },
  {
    "id": 417570,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-11-14T00:52:38",
    "content": "<p>A Portugese colleauge&#8217;s family own one of the worlds largest cork farms says they have not been impacted by the problem as they found other markets and uses. Their cork is also used on the nosecone of every rocket that goes into space to dissipate heat that would otherwise destroy the craft.</p>\n<p>ps: If you have a corked bottle of wine,put some polythene into the bottle or pour it into a polythene bottle and let it sit for 15 minutes, the offending chemical and odour is absorbed by the polythene leaving the wine perfectly drinkable.</p>\n",
    "parent": 0
  },
  {
    "id": 417565,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-11-13T16:31:35",
    "content": "<p>Jean,</p>\n<p>Now they use fake cork that actually floats.</p>\n<p>Also, years ago they switched from cork trees to something similar.</p>\n<p>Even Cinnamon isn&#8217;t really Cinnamon now, it&#8217;s a similar tree.</p>\n<p>Nutmeg and others have added wood fillings (fine sawdust).</p>\n",
    "parent": 0
  },
  {
    "id": 417563,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-11-13T12:25:49",
    "content": "<p>Spare a thought for the wild-life losing their habitat because many of the cork tree forests in Portugal are being destroyed because they are not needed due to the prevalence of screw cap bottles for wine bottles nowadays. Owls in particular which nest in holes in the cork oaks.<br />\nMaintain biodiversity &#8211; drink more wine supplied in cork stoppered bottles!</p>\n",
    "parent": 0
  },
  {
    "id": 417552,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-11-12T19:13:53",
    "content": "<p>Pilgrim story challenged</p>\n<p>400 years on, the Pilgrims get a reality check<br />\nFrom the signing of the Mayflower Compact to the landing at Plymouth Rock, the grade-school story of the Pilgrims doesn’t quite square with the facts<br />\n<a href=\"https://api.nationalgeographic.com/distribution/public/amp/history/2020/11/400-years-on-pilgrims-get-reality-check\" rel=\"nofollow ugc\">https://api.nationalgeographic.com/distribution/public/amp/history/2020/11/400-years-on-pilgrims-get-reality-check</a></p>\n",
    "parent": 0
  },
  {
    "id": 417548,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-11-12T16:05:20",
    "content": "<p>The New Forrest in Hampshire, England was established to grow wood for the British Navy, parts of it are preserved to do so to this day.</p>\n<p>Ribs were made from oak sections fastened together which required a lot more man hours and wood. Grown oak was made by tying the tree top to the ground and as it grew, moving the tie down further away from the roots to form greater radii.These allowed very efficient and strong builds although preplanning could take 60 years.</p>\n",
    "parent": 0
  }
]