[
  {
    "id": 416139,
    "author": "Erik ABRANSON",
    "authorUrl": "",
    "date": "2020-09-15T06:58:54",
    "content": "<p>And all I asked was a tall ship and a star to steer her by&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 416097,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-13T16:41:21",
    "content": "<p>Wallenius Marine and their partners are still in the design phase of the projects so most of the answers to your questions are still not available to the public. That being said, I presume that when empty they will carry sufficient water ballast to ensure adequate stability. The ship is said to be slightly more expensive to build than a conventional car carrier but should cost significantly less to operate. The ship is designed for the North Atlantic auto trade so should have no problem operating from existing terminals. She is slightly beamier but about as long as conventional ships in the trade. Her masts which are about 80 meters high are retractable to allow to get under major bridges. The ship will have auxiliary engines which apparently have not yet been chosen.</p>\n",
    "parent": 416092
  },
  {
    "id": 416092,
    "author": "Louis K",
    "authorUrl": "",
    "date": "2020-09-13T14:10:36",
    "content": "<p>A couple of questions:<br />\n1. When not loaded where is her center of gravity. Just how much really heavy weather can she handle.<br />\n2. What is her draft when loaded<br />\n3. What is her avg gross costs including staffing per unit when fully loaded<br />\n4. How many crew are needed<br />\n5. Does she have any auxiliary powered backup<br />\n6. Are there berthings in the North East that can take her length and also allow efficient unloading/loading</p>\n",
    "parent": 0
  },
  {
    "id": 416084,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-13T11:23:45",
    "content": "<p>In online discussions, there have been references to movable skegs to improve balance and lift. If the hull looks like most car carriers, it will be relatively fine and &#8220;clipper&#8221; shaped.</p>\n",
    "parent": 416060
  },
  {
    "id": 416080,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-09-13T10:11:36",
    "content": "<p>But it has got foils. Hasn&#8217;t it?</p>\n",
    "parent": 0
  },
  {
    "id": 416071,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-13T06:24:51",
    "content": "<p>It will need a wing keel for that 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 416064,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-09-13T03:53:32",
    "content": "<p>And they can enter the America&#8217;s Cup too.</p>\n",
    "parent": 0
  },
  {
    "id": 416061,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-09-12T19:04:46",
    "content": "<p>As a trucker I am wondering if it will be cheaper to take the slow boat.  Presuming the receiver is willing to wait.</p>\n",
    "parent": 0
  },
  {
    "id": 416060,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-09-12T18:47:21",
    "content": "<p>I&#8217;m wondering about a keel not for ballast but for operational efficiency.</p>\n<p>Navigation of this vessel will be more productive to the extent it is able to sail upwind, or for that matter with wind abeam and less leeway.</p>\n<p>A substantially deep keel (full? fin?) would be a significant improvement over sailing cargo vessels of past times.</p>\n<p>But oceangoing ships enter shallow harbors, not friendly to giant appendages. Yet we certainly have the technical ability to produce something along the lines of a huge daggerboard. </p>\n<p>I suppose I should dig on this. I&#8217;ve a simple mind and better ones are working on the problem&#8211; I&#8217;m sure it&#8217;s been explored. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 416054,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-12T16:42:42",
    "content": "<p>Oceanbird was designed from scratch as a sailing vessel. Stability clearly factored into the engineering. I note that the design has more bean than comparable car carriers of her size.</p>\n",
    "parent": 0
  },
  {
    "id": 416053,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-12T16:27:48",
    "content": "<p>This could possibly be the worst idea ever.<br />\nAt first it seems a good idea but then wait a minute, what type of vessel has the highest capsize incident rate&#8230; car carriers, and they are planning to put five masts on it. I hope it will also have the world&#8217;s largest lead keel because their water ballast systems are highly prone to either operator error or malfunction.</p>\n",
    "parent": 0
  }
]