[
  {
    "id": 421458,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-06-08T12:34:00",
    "content": "<p>Captain, good to know that the Ford Fiesta&#8217;s cup holders are the right size for smoke grenades.</p>\n",
    "parent": 0
  },
  {
    "id": 421457,
    "author": "RICHARD BAILEY",
    "authorUrl": "",
    "date": "2021-06-08T12:10:51",
    "content": "<p>21st century beach landing?<br />\n<a href=\"https://www.facebook.com/watch/?v=1736807883276752\" rel=\"nofollow ugc\">https://www.facebook.com/watch/?v=1736807883276752</a></p>\n",
    "parent": 0
  },
  {
    "id": 421428,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-06-06T21:02:13",
    "content": "<p>The Higgins Family has a summer home up here on Treasure Island.</p>\n",
    "parent": 0
  },
  {
    "id": 421424,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2021-06-06T18:04:45",
    "content": "<p>On This Day &#8211; Decoys at Woolverstone, on the river Stour in Suffolk, East Anglia, England</p>\n<p>77 years ago today, codenamed Operation Overlord, the battle known as D-Day, began. 156,000 American, British and Canadian forces landed on five beaches along a 50-mile stretch of the heavily fortified coast of France’s Normandy region. Prior to D-Day, the Allies conducted a large-scale deception campaign designed to mislead the Germans about the intended invasion target, with fake landing craft and other military equipment in Woolverstone used for this purpose. By late August 1944, all of northern France had been liberated, and by the following spring the Allies had defeated the Germans.</p>\n<p>From &#8211; <a href=\"https://shotleypeninsula.nub.news/n/sunday39s-peninsula-breakfast-briefing-1622893530?fbclid=IwAR2a4q3gjvHtfEmEXsfR4sjbeK0orilwlzjK1oWD0bx4MufqtOHofWBhC78\" rel=\"nofollow ugc\">https://shotleypeninsula.nub.news/n/sunday39s-peninsula-breakfast-briefing-1622893530?fbclid=IwAR2a4q3gjvHtfEmEXsfR4sjbeK0orilwlzjK1oWD0bx4MufqtOHofWBhC78</a></p>\n",
    "parent": 0
  },
  {
    "id": 421423,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-06-06T17:39:32",
    "content": "<p>To paraphrase Satre &#8220;simplicity is perfection&#8221;<br />\nA philosophy the modern military have moved away from at their and our expense.</p>\n",
    "parent": 0
  },
  {
    "id": 421422,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2021-06-06T17:35:22",
    "content": "<p>BRITISH D DAY MEMORIAL UNVEILED</p>\n<p><a href=\"https://www.bbc.co.uk/news/uk-57373932\" rel=\"nofollow ugc\">https://www.bbc.co.uk/news/uk-57373932</a><br />\n<a href=\"https://www.youtube.com/watch?v=KQgtq_Fssek\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=KQgtq_Fssek</a><br />\n<a href=\"https://www.youtube.com/watch?v=7IkZq2m_hSU\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=7IkZq2m_hSU</a></p>\n<p>Royal Navy<br />\nOn this day in June 1944, Hitler’s vaunted Atlantic Wall was punctured by the bravery, ingenuity and overwhelming firepower of Allied forces.<br />\nToday marks the anniversary of D-Day, the beginning of the liberation of Western Europe from Nazi tyranny under the banner of Operation Overlord and its naval element, Operation Neptune.<br />\nNearly 200,000 naval personnel – more than half of them Royal Navy, plus 25,000 Merchant Navy seaman – manned an invasion force of nearly 7,000 vessels, from battleships and cruisers pounding German positions, through more than 4,000 landing craft and a good 1,500 supporting vessels.<br />\nThe ring of steel drawn around the invasion fleet, plus Allied air cover – including Fleet Air Arm patrols – largely protected it from the German Navy, but losses in the attacking waves of landing craft were heavy: one fifth of 47 (Royal Marines) Commando was wiped out in the initial assault wave at Gold Beach.<br />\nAlong the coast at Juno Beach, fellow Royal Marines suffered heavy losses as it stormed and captured the seafront village of Langrune-sur-Mer.<br />\nIn all upwards of 10,000 men on both sides were casualties on the first day of the invasion; at least 100 sailors and Royal Marines with no known grave are honoured on Portsmouth Naval Memorial alone.<br />\nTheir sacrifice is also being remembered with the formal dedication of the new Normandy Memorial overlooking what was Gold Beach on June 6 1944.<br />\nNew patrol ship – freshly painted in ‘dazzle’ camouflage like her sister HMS Tamar – is due to act as guardship for proceedings, stationed in the waters just offshore.<br />\nGiven the pandemic, veterans and family members/descendants have been invited to an event at the National Memorial Arboretum in Staffordshire where they can watch proceedings and also link up with old comrades.</p>\n<p>See &#8211; <a href=\"https://www.royalnavy.mod.uk/news-and-l\" rel=\"nofollow ugc\">https://www.royalnavy.mod.uk/news-and-l</a> &#8230; y-at-d-day</p>\n",
    "parent": 0
  }
]