[
  {
    "id": 436453,
    "author": "dd",
    "authorUrl": "",
    "date": "2023-09-12T19:14:01",
    "content": "<p>taa, capt rick! here&#8217;s more grist for the little-known-miracle 9/11 dept c/o<br />\nMargaret Anna Alice&#8230;  <a href=\"http://www.amazon.com/dp/B000S1M7JS/\" rel=\"nofollow ugc\">http://www.amazon.com/dp/B000S1M7JS/</a>  Heart of a Soldier<br />\nby James B. Stewart<br />\n4.6 4.6 out of 5 stars    278 ratings 4.3 on Goodreads 493 ratings<br />\nFrom Pulitzer Prize winner James B. Stewart comes the extraordinary story of American hero Rick Rescorla, Morgan Stanley security director and a veteran of Vietnam and the British colonial wars in Rhodesia, who lost his life on September 11.</p>\n<p>When Rick Rescorla got home from Vietnam, he tried to put combat and death behind him, but he never could entirely. From the day he joined the British Army to fight a colonial war in Rhodesia, where he met American Special Forces’ officer Dan Hill who would become his best friend, to the day he fell in love with Susan, everything in his remarkable life was preparing him for an act of generosity that would transcend all that went before.</p>\n<p>Heart of a Soldier is a story of bravery under fire, of loyalty to one’s comrades, of the miracle of finding happiness late in life. Everything about Rick’s life came together on September 11. In charge of security for Morgan Stanley, he successfully got all its 2,700 men and women out of the south tower of the World Trade Center. Then, thinking perhaps of soldiers he’d held as they died, as well as the woman he loved, he went back one last time to search for stragglers.</p>\n",
    "parent": 0
  },
  {
    "id": 436452,
    "author": "ws",
    "authorUrl": "",
    "date": "2023-09-12T14:19:56",
    "content": "<p>The President, Every politician, and elected official repeatedly, and very sincerely said Never Forget </p>\n<p>Go to the airport and the TSA treat you like you’re bin Laden, and Omar Abdul Rachman!</p>\n<p>Meanwhile all of our  borders are wide open?</p>\n<p>The words Never Forget are totally meaningless!</p>\n",
    "parent": 0
  },
  {
    "id": 436447,
    "author": "Scott Powell",
    "authorUrl": "",
    "date": "2023-09-11T16:28:58",
    "content": "<p>Thanks for this. I didn&#8217;t know that you and your wife were so personally affected.</p>\n",
    "parent": 0
  }
]