[
  {
    "id": 431094,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2022-12-01T16:17:29",
    "content": "<p>The 1968/69 single handed Sunday Times Round the World Race was won by Sir Robin. Competitors were given a time window to start and had to finish at the same port that they set off from after passing the three capes. There were two prizes, The Golden Globe for the first to finish and £5000 for the fastest time. Sir Robin won both in Suhali, a yacht he had built for himself in Bombay, now Mumbai, in 1963 based on a Colin Archer design for a Norwegian lifeboat.</p>\n<p>Donald Crowhurst had entered his trimaran &#8220;Teignmouth Electron.&#8221; Donald was an ordinary Joe following his dreams and was late in the window to the starting line in a boat built by himself and his family and friends and under immense self pressure. The boat was not really ready but his goal made him leave his wife and four children to fulfill his ambition and gain recognition for them all. He obviously struggled and eventually this affected his mental health. He went round in circles in the South Atlantic giving positions that indicated that he was advancing in the race but the reality was that he was not coping. We do not know what ultimately happened to Donald but &#8220;Teignmouth Electron&#8221; was discovered abandoned by the RMS Picardy. Donald was never found.</p>\n<p>In those unwoke days, many would have judged Donald badly but Sir Robin donated the £5000, (£45,000 in today&#8217;s money,) to Donald&#8217;s family. One of the most selfless acts ever committed by a human being, in my very humble opinion,  which is why I revere the man.  As A classic yacht skipper, we have met any times and never once have I left sober.</p>\n<p>Sir Robin. Respect.</p>\n",
    "parent": 0
  },
  {
    "id": 431063,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2022-11-30T15:09:21",
    "content": "<p>I always find the statement &#8220;There is no record of an orca killing a human in the wild&#8221; unsurprising. And amusing.</p>\n<p>08:35 would not have interrupted Sir Robin declaring that the &#8220;Sun is over the yardarm somewhere in the world&#8221; which, from experience, occurs about 09:00(z) or any other time zone.</p>\n",
    "parent": 0
  },
  {
    "id": 431008,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-11-29T19:19:36",
    "content": "<p>&#8220;We like to hear &#8217;em squeaking up there. Fun!&#8221;</p>\n",
    "parent": 0
  }
]