[
  {
    "id": 412948,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-12-06T16:25:45",
    "content": "<p>Earlier this year, I looked into buying a Narwal tusk online, forget it!<br />\nPrice was too high!</p>\n",
    "parent": 0
  },
  {
    "id": 412947,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-12-06T16:23:41",
    "content": "<p>Stupid news called it a &#8220;Whale Tusk&#8221;, anyone ever seen a whale with tusks?<br />\nAnyway, the thing looked about 1.5-feet long, at best.<br />\nGood luck with that!</p>\n",
    "parent": 0
  },
  {
    "id": 412929,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-12-04T09:23:21",
    "content": "<p>Those who let it all happen whilst recording the action on their phones so they can sell the recording should hang their heads in shame.</p>\n",
    "parent": 0
  },
  {
    "id": 412922,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2019-12-03T14:35:08",
    "content": "<p>And another thing some years ago we the Shanty Crew were booked to sing at Fishmongers Hall one of the old London trade corporations/societies we were positioned at the top of the staircase to sing our shanties alongside us was a glass case which contained the short-sword that had in 1381 killed the leader of the Kent rebels who were protesting about taxes he was killed by the then mayor of London William Waldegrave on Blackheath the event was known as the peasants revolt, we were that close to history.</p>\n<p>On the credit side I gather the fellow who had a go first was a Polish pot washer who had grabbed a medieval lance from a wall the lad who chased the attacker with the knives outside this brave Pole suffered a number of knife wounds as he tried to stab the attacker with the lance, outside the chase was continued outside with the whale tusk and a fire extinguisher, very brave people indeed it makes one think aloud.</p>\n",
    "parent": 0
  }
]