[
  {
    "id": 409894,
    "author": "Stephen Caravana",
    "authorUrl": "",
    "date": "2019-03-18T07:26:50",
    "content": "<p>What an amazing story, of an amazing man from our area, who succeeded against all odds to make his mark in American maritime history. Didn&#8217;t realize he was born in Cuttyhunk.</p>\n",
    "parent": 0
  },
  {
    "id": 409699,
    "author": "Capt. J. Vincent Collins",
    "authorUrl": "http://.",
    "date": "2019-03-01T09:43:55",
    "content": "<p>Paul Cuffee was buried here in Westport in Beech Grove Cemetery on Main Rd. Passersby cannot miss the large headstone engraved  &#8220;Capt. Paul Cuffee&#8221;,  A prominent reminder of this mans legacy. </p>\n<p>I lived on a property that was very likely the site of Cuffee&#8217;s shipyard. A large stone quay on one of the deepest spots on the west shore of the east branch of the river, just off the quay is a large &#8220;hole&#8221; over 20 feet deep, perfect anchorage for large vessels.<br />\nI kept a large garden on the waters edge and over the years pulled many iron artifacts out of the earth, all likely related to boat building of that era.<br />\nThere where numerous boats built in Westport, many whalers including the Kate Cory, most where probably built along the east branch.<br />\nAlthough the east branch has shoaled in over the years, there are pictures of large coastal schooners anchored up at Hix Bridge. </p>\n<p>Thanks for the post, Paul Cuffee was a remarkable man and is fondly remembered here in Westport.</p>\n",
    "parent": 0
  },
  {
    "id": 409692,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2019-02-28T11:25:12",
    "content": "<p>Thanks for this, Rick, and for all your posts &#8212; always a thought-provoking way to start my day.</p>\n",
    "parent": 0
  },
  {
    "id": 409689,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-02-28T01:37:48",
    "content": "<p>That&#8217;s a fine portrait&#8211; gifted artist. And a truly exceptional sitter.</p>\n",
    "parent": 0
  },
  {
    "id": 409679,
    "author": "Patricia C Sullivan",
    "authorUrl": "http://www.museumofmaritimepets.org",
    "date": "2019-02-27T14:01:04",
    "content": "<p>Fascinating!  Thanks for sharing this tribute.</p>\n",
    "parent": 0
  }
]