[
  {
    "id": 410944,
    "author": "Paul",
    "authorUrl": "",
    "date": "2019-06-16T19:30:17",
    "content": "<p>This so sickening.  First problem:  I noticed from the video is that the ship has a tiller assisted by block and tackles which several people were struggling with. Wanderbird had wheel steering; it is too big a vessel for a tiller. Wheels are geared.<br />\nThis looks like a repeat of the Andrea Doria/Stockholm collision in  in which the two ships approach in a manner that the evasive tactic is not obvious and a wrong move by either makes matters worse. So bilateral communication is essential This  calamity in 1954 resulted in the requirement for all ships to monitor a dedicated bridge to bridge channel, 13 . In this situation  communication between the two would have prevented it-if they both spoke German or English(the international language). In the US , I believe there has to be an English speaker on the bridge.<br />\nFrom the video it is apparent that the schooner was allowed to get into a position &#8220;in extremis&#8221;; that is beyond the point of escape. It is always important to make a maneuvering decision way before that point. This is the cause of many accidents.</p>\n",
    "parent": 0
  },
  {
    "id": 410897,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-06-12T17:00:16",
    "content": "<p>The Sinking of Wander Bird<br />\nBy mgrant on June 12, 2019 at 4:00 AM</p>\n<p>Early reports differ as to the cause of the accident. One report notes a ‘failed tack’; another that the Cyprus-flagged Astrosprinter was “out of its shipping lane.” Maritime law puts the burden on smaller vessels to keep clear of large ones, but we don’t know if the rules of the road are different in Germany (or the Elbe), how fast each vessel was going, or, ultimately, which one was at fault. Investigations are underway and we’ll post more information on ‘Lectronic Latitude as we get it.</p>\n<p><a href=\"https://blog.sfgate.com/latitude38/2019/06/12/the-sinking-of-wander-bird/\" rel=\"nofollow ugc\">https://blog.sfgate.com/latitude38/2019/06/12/the-sinking-of-wander-bird/</a></p>\n",
    "parent": 0
  },
  {
    "id": 410886,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-06-11T20:18:40",
    "content": "<p>Such a sad ending for a boat with magnificent lines</p>\n",
    "parent": 0
  },
  {
    "id": 410884,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner.",
    "authorUrl": "http://formerly%20Nautical%20Log",
    "date": "2019-06-11T18:19:53",
    "content": "<p>This is a very unfortunate incident particularly after the major refit.  The &#8220;Astrosprinter&#8221; no doubt had an Elbe pilot on board.  I ran regularly to the Elbe during several Summers from Irish ports and it is a busy place. I further understand that an investigation will take place so one is surprised that once again Phil, a regular commenter, is on the ball and has the answer stating the sailboat is at fault.  Having investigated many maritime incidents one could have used his crystal ball!! </p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 410883,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-06-11T15:53:20",
    "content": "<p>Normally, the smaller ship gives right of-way, but not in this case.<br />\nCan&#8217;t expect a larger ship to move or stop.<br />\nSailboat is at fault!</p>\n",
    "parent": 0
  },
  {
    "id": 410880,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-06-11T10:32:27",
    "content": "<p>Scariest pic here:<br />\n<a href=\"https://www.maritime-executive.com/article/photos-hamburg-s-oldest-wooden-ship-collides-with-container-feeder\" rel=\"nofollow ugc\">https://www.maritime-executive.com/article/photos-hamburg-s-oldest-wooden-ship-collides-with-container-feeder</a></p>\n",
    "parent": 0
  },
  {
    "id": 410874,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-06-10T18:07:58",
    "content": "<p>Ship sunk!</p>\n<p>Newly restored historic sailing ship crashes and sinks days after relaunch<br />\n<a href=\"https://www.cnn.com/2019/06/10/europe/hamburg-boat-crash-scli-grm-intl/index.html\" rel=\"nofollow ugc\">https://www.cnn.com/2019/06/10/europe/hamburg-boat-crash-scli-grm-intl/index.html</a></p>\n",
    "parent": 0
  }
]