[
  {
    "id": 406116,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-05-07T14:26:47",
    "content": "<p>They should probably be called seasonal workers, although they are commonly referred to as immigrants in the media. They have been allowed in for decades to help with seasonal work. The recent crackdown on even those here legally has shut effectively shut them down.  </p>\n<p>And undocumented immigrants are indeed immigrants. For most of US history immigrants were effectively undocumented.</p>\n",
    "parent": 406115
  },
  {
    "id": 406115,
    "author": "L.E.",
    "authorUrl": "",
    "date": "2018-05-07T14:04:07",
    "content": "<p>Was it actually &#8220;immigrants&#8221; who picked the crab meat?<br />\nOr were they illegally here in the country?<br />\nWhen the &#8220;bracero act&#8221;  was passed in 1942, a lot of white migrant families were put out of work, but it allowed seasonal workers from Mexico to help out with the U.S. labor shortage during the war.<br />\nThe history of that act has been ever changing, but the intent was that workers were given work visas for seasonal work and then returned back across the Mexican border.<br />\nSomewhere, through time, the government began to ignore those who were not returning back across the border.  They are here illegally.<br />\nIf you want to support people who are here illegally, so be it.  But I don&#8217;t think you can call them immigrants.</p>\n",
    "parent": 0
  },
  {
    "id": 406114,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-05-07T07:45:26",
    "content": "<p>All this anti-immigrant nonsense is going to do is to destroy US jobs and maritime culture. If US crab meat prices soar due to a lack of labor, we will see an influx Chinese and Venezuelan crab meat imports. The real cost of this blatant bigotry will be paid by the US crabbers whose boats will be laid up and whose crews will be unemployed.</p>\n",
    "parent": 0
  },
  {
    "id": 406105,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-05-05T18:24:25",
    "content": "<p>As the blueberry growers here in Maine realized some 5 years ago.  Its time to pay better wages if you want the job done at all.</p>\n",
    "parent": 0
  },
  {
    "id": 406102,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-05-05T15:13:52",
    "content": "<p>Buyers too lazy or stupid to pick their own crab meat, just as bad as all the dried out (cooked) skinless chicken in the grocery store, want chicken with skin, buy a whole raw chicken.<br />\nWith just me, what do I do with the rest, freeze it hard as rock, or toss it out?</p>\n",
    "parent": 0
  },
  {
    "id": 406101,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-05-05T12:40:36",
    "content": "<p>We are still a nation of immigrants even if the bigots are too dim to know their own history. Nd, by the way, these hard-working seasonal workers contribute to the economy and do nothing to &#8220;burden &#8230; our social services.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 406100,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-05-05T12:17:48",
    "content": "<p>US joins Canada in investigation of outbreak linked to oysters</p>\n<p>Food Safety News-Apr 30, 2018</p>\n<p>“Most individuals who became sick reported eating raw oysters from the south and central parts of Baynes Sound, British Columbia, before the onset of their illness,” the Canadian agency reported. The investigation into a specific source of contamination impacting the shellfish farms in that area is ongoing.<br />\n<a href=\"http://www.foodsafetynews.com/2018/05/u-s-joins-canada-in-investigation-of-outbreak-linked-to-oysters/#.Wu3Y4IjRXcs\" rel=\"nofollow ugc\">http://www.foodsafetynews.com/2018/05/u-s-joins-canada-in-investigation-of-outbreak-linked-to-oysters/#.Wu3Y4IjRXcs</a></p>\n",
    "parent": 0
  },
  {
    "id": 406099,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-05-05T12:14:21",
    "content": "<p>Norovirus outbreaks linked to BC oysters a sign of water pollution &#8230;<br />\nCBC.ca-16 hours ago<br />\nOysters contaminated with norovirus in British Columbia have become a costly problem and the issue magnifies a broader failure to keep oceans clean, says the provincial shellfish growers association. Darlene Winterburn, the executive director of the B.C. Shellfish Growers Association, said the latest &#8230;<br />\n<a href=\"http://www.cbc.ca/news/canada/british-columbia/norovirus-oysters-april-2018-1.4649715\" rel=\"nofollow ugc\">http://www.cbc.ca/news/canada/british-columbia/norovirus-oysters-april-2018-1.4649715</a></p>\n",
    "parent": 0
  },
  {
    "id": 406098,
    "author": "Jim Wainwright",
    "authorUrl": "http://none",
    "date": "2018-05-05T11:43:09",
    "content": "<p>Get non-working Americans to pick the crab meat&#8230; We do not need immigrants to further burden or bog down our social services. Period!</p>\n",
    "parent": 0
  }
]