[
  {
    "id": 423378,
    "author": "Thomas Walker",
    "authorUrl": "",
    "date": "2021-10-03T19:25:33",
    "content": "<p>Stan. Wrong. 100% wrong. There are job fairs in every port.  In the Ports of Philadelphia and New Jersey you walk into a hiring hall in the morning and work that afternoon. We can&#8217;t find enough people. It&#8217;s 24/7 every week. So before you make such a stupid comment do some research first</p>\n",
    "parent": 0
  },
  {
    "id": 423337,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-09-29T18:03:41",
    "content": "<p>Agreed Stan</p>\n",
    "parent": 0
  },
  {
    "id": 423328,
    "author": "Stan",
    "authorUrl": "",
    "date": "2021-09-28T21:01:59",
    "content": "<p>Where can I apply for these jobs? I make $40 an hour. If they are so desperate I would to be a longshoreman. I’m well qualified and I hold a TWIC card. I bet they don’t want to hire anyone, they just want to complain and make their existing workers work 80 hours a week because they refuse to hire any new people. Prove me wrong.</p>\n",
    "parent": 0
  },
  {
    "id": 423322,
    "author": "ws",
    "authorUrl": "",
    "date": "2021-09-28T13:23:58",
    "content": "<p>According to the market forecasting firm IndexBox, just 7.5 percent of Americans&#8217; bathroom tissue is imported. &#8230; Unlike with other categories of consumer goods, Americans don&#8217;t rely on foreign toilet paper because its domestic production is so strong.</p>\n",
    "parent": 0
  },
  {
    "id": 423318,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-09-27T18:30:52",
    "content": "<p>According to the drivers I have talked to?  The problem lays with the port authority.  Plenty of trucks standing by waiting to haul the goods.  Port Authority is dragging their feet about moving the backlog.  Port authority needs to start clearing truckers faster.  Instead they want background checks on drivers already cleared.</p>\n<p>We whom turn miles to supply your toilet paper are ready to work.</p>\n",
    "parent": 0
  }
]