[
  {
    "id": 410086,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-04-01T16:23:49",
    "content": "<p>The USS Cod is still in Cleveland firing her gun, sometimes.</p>\n",
    "parent": 0
  },
  {
    "id": 410076,
    "author": "Erik Abranson",
    "authorUrl": "",
    "date": "2019-04-01T07:08:28",
    "content": "<p>Being a harder-line wildlife defender than the _Sea Shepherd&#8217;s_ bunch, I would have been interested if this sub were in proper working order and with full torpedo racks. This not being the case&#8230; 😉</p>\n",
    "parent": 0
  },
  {
    "id": 410066,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-03-31T13:17:47",
    "content": "<p>Or maybe Bolivia or Paraguay as it is already land-locked.</p>\n",
    "parent": 0
  },
  {
    "id": 410063,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-31T12:08:21",
    "content": "<p>I dont see how something that is on loan can be offered.  It seems to me if it is owned by the russians, perhaps they should come and reposess it.  Or better yet, send it to Peru?</p>\n",
    "parent": 0
  },
  {
    "id": 410062,
    "author": "Harry T Scholer",
    "authorUrl": "http://aol",
    "date": "2019-03-31T09:09:08",
    "content": "<p>Yes there are others like USS Ling berthed in the Hackensack River in New Jersey. The last WW II submarine that was not &#8220;guppyised&#8221; ie: enclosing the periscope etc in a housing. Spent many a pleasant afternoon with my then young son, taking excellent tours given by former Navy submariners. Now she sits, partially flooded, in the mud at her berth. The operators of these &#8220;tribute&#8221; sites should not be let off the hook when their exhibits go south. Ling was a fine boat and does not deserve the hand that she has been dealt. I am a past president of the National Vietnam War Museum and we have a PBR, Vietnam era and an A-4 Skyhawk also Vietnam era. We had to satisfy the US Navy periodically as to the status of the above or risk losing same. How do these people escape their duty when it comes to preservation?</p>\n",
    "parent": 0
  },
  {
    "id": 410059,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-03-31T05:21:54",
    "content": "<p>Thanks for the offer but we&#8217;ve already got a rusting ex-Russian sub on the River Medway 🙂<br />\nIt is amazing that planners fail to think about future removal/dry-docking/slipping of vessels which are rapidly approaching end of life. The Earl of Zetland, now a restaurant, is another case in point. It is in the Royal Quays Marina at North Shields on the River Tyne and has no means of being extracted since they reduced the size of the dock access.<br />\nThere must be others?</p>\n",
    "parent": 0
  }
]