[
  {
    "id": 436132,
    "author": "ws",
    "authorUrl": "",
    "date": "2023-07-29T13:00:03",
    "content": "<p>I find this hard to believe The ship owners said: No Zero None EV’s </p>\n<p>I suspect foul play</p>\n<p>If we can’t trust the ship owner’s who can we trust </p>\n<p><a href=\"https://auto.hindustantimes.com/auto/electric-vehicles/over-500-electric-cars-from-bmw-mercedes-possibly-charred-on-board-burning-cargo-ship-off-dutch-coast-41690540316926.html\" rel=\"nofollow ugc\">https://auto.hindustantimes.com/auto/electric-vehicles/over-500-electric-cars-from-bmw-mercedes-possibly-charred-on-board-burning-cargo-ship-off-dutch-coast-41690540316926.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 436030,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2023-07-17T17:19:25",
    "content": "<p>Strangely they allow electric powered vehicles to travel on the cross-channel tunnel shuttle train between UK and France but not those with LPG tanks. Are they waiting for another incident (they have already had one big fire) before they employ joined up thinking?</p>\n",
    "parent": 0
  },
  {
    "id": 435991,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2023-07-12T20:13:07",
    "content": "<p>So far, all the reports are that there were no EVs o hybrids aboard the ship when the fire broke out.</p>\n",
    "parent": 435977
  },
  {
    "id": 435979,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2023-07-11T17:08:45",
    "content": "<p>Land-based fire fighting has a fall-back position of containment that is not available to ships, particularly ships at sea.  The mantra &#8220;Locate, Confine, Extinguish&#8221; was drummed into the 1959 first year class of RCN(R) cadets in our ABCD (Atomic, Biological, Chemical, Damage Control) course, where the first activity was to suit up, team up, and then find and extinguish the smoke grenades that had been tossed into a metal framework designed to replicate the compartmented structure of a ship. The exercise was realistic in that nobody expects a fire at sea, there is no fire department aboard, and you don&#8217;t know until you&#8217;ve tried it how little you can see when you are wearing a sweaty breathing face piece that is fogged up by your own breath, as you attempt to move under your ill-fitting fire helmet, in heavy protective clothing designed one-size-fits nobody, in a confined smoke-filled space.<br />\nI feel for all those involved in the Newark fire, and I hope the industry learns from their experience.</p>\n",
    "parent": 0
  },
  {
    "id": 435977,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2023-07-11T13:25:11",
    "content": "<p>There is a real problem with lithium batteries in electric vehicles spontaneously combusting. In the open, a standard car takes four fighters and 100 gallons of water to extinguish. Electric vehicles take 30,000 gallons and a lot of fire fighters to deal with one car, if this spreads to other vehicles, the problem grows exponentially. This phenomena is a growing problem n electric vehicle delivery by sea.</p>\n<p>Some research published recently suggest that the salt water atmosphere in vehicle transportation ships is part of the problem.</p>\n",
    "parent": 0
  }
]