[
  {
    "id": 405440,
    "author": "Mike Lee",
    "authorUrl": "",
    "date": "2018-02-08T05:48:52",
    "content": "<p>Thanks for posting this fine film. I grew up in East Anglia and sailed small boats up and down the coast, and into all the old barging creeks. I well remember sailing through little fleets of barges, anchored up waiting for the tide, breathing out the rich smell of stockholm tar, warm pitch and cutch ( the tanning mix for the sails.) Ominously they often flew a red flag, warning that they were carrying explosives. One barge was said to be carrying phosphorous when she sprang a leak. Her skipper and mate rowed like madmen for the shore before their ship went up. More peaceful were the &#8216;stackies&#8217;, which appear briefly in the film. These sailed up the Thames with a haystack on deck, the mate standing on top to con the ship. ( as can be seen on the film.) Bob Roberts was a well known skipper. His Cambria would deliver timber to the warf in our small town. The old retired bargemen would sit in the sun on benches outside the local sailmakers loft, a wonderful source of history and gossip.<br />\nThe most interesting thing about Thames barges was how well they sailed. Not, of course, when so deeply laden that their decks were almost awash, but half loaded in a good breeze, they were astonishingly quick, overtaking you with a roar and rush.<br />\nWonderful to see them still going and the names I remember still carried in gold letters on their transoms.</p>\n",
    "parent": 0
  },
  {
    "id": 405439,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-07T16:45:40",
    "content": "<p>Another wonderful film about life in Faversham Creek. The film makers didn&#8217;t expand on the fact that the River Medway and other local rivers were shaped, literally, by the bricks that were used to build London because much of the mud used in the brickmaking was dug from the saltings and creeks of the estuary. Perhaps there will be another film about that. Keep &#8217;em coming.</p>\n",
    "parent": 0
  },
  {
    "id": 405428,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2018-02-04T18:53:06",
    "content": "<p>Thanks for posting Rick.  Its extremely costly to keep these unique barges going, especially the wooden ones.  There are about 20 left in total many of which are steel built, known as &#8216;Tin Pots&#8217; and unliked by crews being cold and damp in winter down below.</p>\n",
    "parent": 0
  }
]