[
  {
    "id": 414870,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-06-16T06:44:29",
    "content": "<p>Along with all the failures by the company and crew, no real accounting can be made until you figure in the absolute disregard for common sense panicked passengers can have in hampering any effort to quench the fire or get people off the ship safely.  Exactly why the US Navy and USCG (and probably every other Navy and CG in the world) are reluctant to put people onboard stricken vessels for fear of losing crew to the mob.</p>\n<p>I assisted in the the rescue of a load of Haitian boat people in the 80s and watched in horror as a USCG rescue swimmer was lowered and then damned near drowned as 8-10 people jumped on him.  If the pilot of the helo hadn&#8217;t broken away and yanked the swimmer away from the mob no telling if he would have survived.  Thus ended any attempts to pull them to safety off their sinking vessel by helo.  We eventually got the sub maneuvered into a position where we could pull them up the side safely.</p>\n",
    "parent": 0
  },
  {
    "id": 414866,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-06-15T21:03:41",
    "content": "<p>Extraordinary litany of failure in the report:</p>\n<p><a href=\"https://www.dco.uscg.mil/Portals/9/DCO%20Documents/5p/CG-5PC/INV/docs/documents/Slocum.pdf\" rel=\"nofollow ugc\">https://www.dco.uscg.mil/Portals/9/DCO%20Documents/5p/CG-5PC/INV/docs/documents/Slocum.pdf</a></p>\n<p>When people chafe about pesky, burdensome regulations, they need to step forward with a better solution to account for the lack of common sense leading to a compartment containing loose hay, various lubricating and lighting oils, a bench with a lit oil lamp on it while more lamps were being filled&#8211; while 1,350 passengers were along for the ride. </p>\n<p>Numbskulls nearly always drag somebody else down with themselves. This is the reason we have regulations.</p>\n",
    "parent": 0
  }
]