[
  {
    "id": 410899,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-06-12T17:34:07",
    "content": "<p>I cringed when young Ann slid down the rigging towards the end of the film.<br />\nShe must have blistered her hands, I know because I have foolishly done the same thing.</p>\n",
    "parent": 0
  },
  {
    "id": 410896,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-06-12T14:46:26",
    "content": "<p>Thirteen Atlantic crossings between 1929 and 1936? That is impressive.</p>\n",
    "parent": 410894
  },
  {
    "id": 410895,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2019-06-12T13:32:48",
    "content": "<p>Thanks for the wonderful video of this voyage. I can&#8217;t wait to show my grandchildren the sea creatures and antics of the youngest crew members!<br />\nWhat a great record of life under sail!</p>\n",
    "parent": 0
  },
  {
    "id": 410894,
    "author": "Erik C. Abranson",
    "authorUrl": "",
    "date": "2019-06-12T12:40:23",
    "content": "<p>&#8220;Commodore&#8221; Warwick M. Tompkins Jr (the 4-year old boy on the video) and his wife Nancy visited No.5 ELBE very recently this year at the Hvide Sand shipyard in Denmark, where she was terminating an extensive refit just before the terrible collision on the Elbe. He had already visited her in 2004, the year after her recommissioning under her present owning association. His sister Ann, the six year old monkey swinging aloft in the rigging, also visited her former schooner, in 2007. Happy kids, allowed to live without mother-hen rules, without TV, smartphones and school shootings&#8230;<br />\nTheir father, Warwick Tompkins Sr, bought the schooner, then named Wandervogel, in Germany in 1928, restored her in 1929 and made &#8220;several&#8221; transatlantic passages between then and departing for &#8216;Frisco by way of Cape Horn in 1936. For &#8220;several&#8221;, read THIRTEEN.<br />\nThere is a full-length, 28 min, HD video that can be watched on Vimeo (pay to stream or to buy; there is a &#8220;free&#8221; trailer):<br />\n<a href=\"https://vimeo.com/ondemand/capehornpassage\" rel=\"nofollow ugc\">https://vimeo.com/ondemand/capehornpassage</a><br />\nThis video was professionally edited in 2015 and includes some comments by a much older &#8220;Commodore&#8221;. The soundtrack and running comments are thankfully entirely different from the Youtube version!</p>\n",
    "parent": 0
  },
  {
    "id": 410893,
    "author": "Scott Andrew",
    "authorUrl": "",
    "date": "2019-06-12T10:09:08",
    "content": "<p>It looks like the younger Warwick spent the rest of his life on the seas.</p>\n<p><a href=\"https://lifeonthewater.us/warwick-tompkins/\" rel=\"nofollow ugc\">https://lifeonthewater.us/warwick-tompkins/</a></p>\n",
    "parent": 0
  },
  {
    "id": 410891,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-06-12T07:31:03",
    "content": "<p>What became of the kids? (If they survived they are in their 80/90s now.)<br />\nDid they swallow the anchor or carry on the famliy&#8217;s maritime lifestyle?</p>\n",
    "parent": 0
  }
]