[
  {
    "id": 406351,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-06-06T20:22:45",
    "content": "<p>Drake Sparkman, and the Stephens brothers (please note the correct spelling):   Olin J Stephens II and Roderick Stephens were the back bone of Sparkman and Stephens from the late 20&#8217;s to their retirements.   All are dead now but Olin and Rod were two of the most talented and creatives yacht designers (as well as vessels for the military and for commercial purposes) ever, and certainly at the very top of the list of American practitioners of that trade.    The LCVP figures prominently in the acclaimed TV series THE BOATS THAT BUILT BRITAIN starring Tom Cunliffe, which was a series created for the BBC back around 2009 or so.   I have a wonderful photo of Ian MacGillivray (a British sailor and friend of Tom&#8217;s) and Tom putting around in a &#8220;skip&#8221; (British for a dumpster) which had been motorized and fitted to act as a sort of landing craft&#8230;&#8230;&#8230;&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 406348,
    "author": "Will Thomas",
    "authorUrl": "",
    "date": "2018-06-06T17:07:20",
    "content": "<p>I see they fixed the last line. They&#8217;re hardly alone. I sometimes wonder if people ever read before they post.</p>\n",
    "parent": 0
  },
  {
    "id": 406347,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-06-06T15:55:09",
    "content": "<p>The famous S&amp;S yacht design studio run by the famous Stevens brothers.  Olin was well know for fast and beautiful racing yachts but Rod Stevens, his less acclaimed but equally talented brother, designed the DUKW &#8220;Duck&#8221;, a pretty handy vessel with a proven track record.</p>\n<p>From Wikipedia:</p>\n<p>&#8220;The term DUKW is not an acronym, but rather the original GMC nomenclature designating the company&#8217;s manufacturing code for the military wheeled amphibious landing-craft — with D standing for 1942, U for utility (amphibious), K for all-wheel drive, and W for 2 powered rear axles.&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 406345,
    "author": "Will Thomas",
    "authorUrl": "",
    "date": "2018-06-06T09:00:17",
    "content": "<p>Can you say &#8220;editor&#8221;?<br />\nRead the last line, &#8220;More than 20,000 Higgins boats were built by Higgins Industries and licensees.ere built by Higgins Industries and licensees,&#8221; very carefully.</p>\n",
    "parent": 0
  }
]