[
  {
    "id": 405492,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-02-16T16:21:54",
    "content": "<p>Going way back, there was the loss of the London the Thames in 1665 due an explosion.</p>\n",
    "parent": 0
  },
  {
    "id": 405491,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-16T15:37:24",
    "content": "<p>We had a similar disaster on the River Medway in SE England. HMS Bulwark exploded on her mooring with tremendous loss of life in 1914. Then a few months later the HMS Princess Irene also exploded whilst loading munitions, again with many lives lost.<br />\nHMS Bulwark is a war grave but for some reason HMS Princess Irene is not. Maybe because she sank in the vicinity of what is now a container port and they wanted to dredge the site.</p>\n",
    "parent": 0
  },
  {
    "id": 405490,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-02-16T12:27:06",
    "content": "<p>The Maine had been outfitted with Worthington steam pumps. Although lying on the bottom of Havana Harbor for fourteen years these pumps were found to be still operational, and were subsequently used to raise the ship.[</p>\n",
    "parent": 0
  },
  {
    "id": 405489,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2018-02-16T10:50:26",
    "content": "<p>There was a bronze porthole from the &#8220;Maine&#8221; punched through a wall of one of the rooms of the Officers&#8217; Club on Governors Island in New York Harbor. We saw it during our son&#8217;s wedding reception that was held there in the early &#8217;90s. As I remember, it looked the worse for wear, with the bronze and glass scratched. I have no idea if it is still there, since G.I. is no longer a Coast Guard base, but a New York City park.</p>\n",
    "parent": 0
  },
  {
    "id": 405488,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-02-15T21:10:14",
    "content": "<p>The adorning casting of the Battleship Maine is on a monument in Bangor Maine.  A picture of it can be seen at<br />\n<a href=\"http://www.spanamwar.com/mainebowscrollfront.JPG\" rel=\"nofollow ugc\">http://www.spanamwar.com/mainebowscrollfront.JPG</a></p>\n",
    "parent": 0
  }
]