[
  {
    "id": 436438,
    "author": "Mary Ann O'Rourke",
    "authorUrl": "http://chicagomaritimemuseum.org",
    "date": "2023-09-10T19:30:34",
    "content": "<p>I met Bill layer in his life when he connected with the Chicago Maritime Museum to inspire young people with his adventures. Dream Big was his mantra and so many youngsters learned from him that there are no boundaries. I joined him when he was pronounced Hero of the Game at a 2022 Chicago White Sox game. A true Chicago treasure.</p>\n",
    "parent": 0
  },
  {
    "id": 436399,
    "author": "Richard Bailey",
    "authorUrl": "",
    "date": "2023-09-06T19:54:13",
    "content": "<p>I don&#8217;t recall when exactly I first met Bill Pinckney but I know that we sat together at the 1994 ASTA conference in Toronto. This was the conference where the key note speaker was longtime Connecticut state legislator William R. &#8216;Bill&#8217; Dyson, a long lean Black man whose Georgia birth was revealed by the cadences of his mellifluent accent. As he looked around the room his opening sentence was firm and to the point, &#8220;Ah see who&#8217;s heah&#8230;and ah see who&#8217;s not heah.&#8221; Maybe the room collectively squirmed a little; it was a sea of white faces. I was glad I was sitting with Bill.<br />\nLater at the same conference, Bill shared a nugget about fundraising: &#8220;You get money from corporate America in one of two ways, guilt or blackmail.&#8221; Within a year or two, Bill&#8217;s observation guided my strategy in winning a quarter of a million dollars from a wobbling corporate supporter. It was the blackmail part of his advice that I employed, but that&#8217;s a story for another time.<br />\nA few years later in February 2000, we found ourselves at OpSail New York&#8217;s Washington DC mini-conference and briefing for Tall Ship captains who would be bringing their ships to the forthcoming July 4th event in New York Harbor. There were dinners, meetings and briefings at Decatur House just by the White House. Part of the event was a private White House tour for the two dozen or so captains. Bill and I lagged at the end of the group. At the Green Room, we stopped to ponder a strange, seemingly out of place, painting on the far wall. It seemed to be mountains, painted in an almost child-like manner. As we laughed and joked between ourselves, a Secret Service agent approached (probably to move us along) and seeing what we were looking at, helpfully said, &#8220;Oh that&#8217;s a new Georgia O&#8217;Keefee Mrs. Clinton just added to the collection.&#8221; Bill and I laughed and agreed, we were not qualified art critics.<br />\nI guess Amistad and Rose did some additional port visits together. I know we anchored Rose in the Mystic River just off the shipyard as the new Amistad was launched in the early spring of 2000.<br />\nOur lives drifted apart as we grew older. An occasional email passed between us. Now Bill joins the ranks of friends lost who we will wish we had seen more of.</p>\n",
    "parent": 0
  },
  {
    "id": 436369,
    "author": "chris roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2023-09-02T16:18:43",
    "content": "<p>I met captain Bill on Goree Island at the Slave House after flying into Dakar Senegal to join AMISTAD`S crew for her Atlantic crossing, there I saw him with a large group of mostly young un`s eating out of his hand as he explained &#8220;There are more in unpaid servitude today than there ever were in the days of slavery&#8221; `(black slavery` Bill was a hypnotic speaker a wonderful man. and a member of that select group The Cape Horners the IACH.<br />\nChris</p>\n",
    "parent": 0
  },
  {
    "id": 436368,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2023-09-02T10:41:02",
    "content": "<p>I was gifted with the opportunity to meet him years ago. May he find calm seas and friendly ports wherever his new voyage takes him.</p>\n",
    "parent": 0
  },
  {
    "id": 436359,
    "author": "Stuart Reininger",
    "authorUrl": "",
    "date": "2023-09-01T16:39:26",
    "content": "<p>Thanks for the lousy news. Bill Pinkney was one cool guy. I was his guest board Amistad and he was mine when I skippered Sabino in 2006. Now Pinkney is dead and the Sabino is electric. Two cultural icons gone.</p>\n",
    "parent": 0
  }
]