[
  {
    "id": 416175,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2020-09-16T01:39:06",
    "content": "<p>The British were awarded one of the 5 sisters at the end of the Second World War.   It was used as an ammunition storage bunker and then sunk as a target ship.  A great many folks were upset by that.  I am disappointed for NY that they lost a magnificent piece of history but I know that Hamburg will give her the attention she deserves.   My wife and I were married on her in 1998.</p>\n",
    "parent": 0
  },
  {
    "id": 416047,
    "author": "curt bovee",
    "authorUrl": "",
    "date": "2020-09-12T07:23:29",
    "content": "<p>Thanks,Rick. I have read your offerings for many years. Peace to all. Greetings from Maine.</p>\n",
    "parent": 0
  },
  {
    "id": 416034,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-11T16:28:18",
    "content": "<p>You are right. I am entirely wrong. The Peking was the Arethusa II between 1933 and 1974. The two windjammers were moored next to each other at South Street for s many years, I am getting them confused. Thanks for the catch.</p>\n",
    "parent": 416032
  },
  {
    "id": 416032,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-11T15:54:00",
    "content": "<p>@Rick I think you are mistaken, The Arethusa was, and now again is the Peking and was sadly neglected in America. Nothing to do with the Wavertree?</p>\n",
    "parent": 0
  },
  {
    "id": 416022,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-11T11:57:24",
    "content": "<p>The South Street Seaport has also done a great job with the restoration of the Wavertree, which was the Arethusa.</p>\n",
    "parent": 416002
  },
  {
    "id": 416021,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-09-11T09:04:27",
    "content": "<p>Speaking for Cape Horners of the past era they would be proud of what the Germans have achieved if only we British could see beyond our noses bow to our great maritime history and do the same with FALLS OF CLYDE. It looks very much like the restoration and imaginative display that will no doubt accompany the big barque will inspire at least the Germans who are rightly proud seafarers.</p>\n",
    "parent": 0
  },
  {
    "id": 416006,
    "author": "Ginny Jones",
    "authorUrl": "",
    "date": "2020-09-10T19:05:21",
    "content": "<p>What a joyous occasion, and what a wonderful sequence of photos.   If you follow the thread you can find more about PEKING and the Flying P Line.  On another topic,  I hope to see photos of ELBE V x WANDERBIRD x ELBE V Back soon as well.</p>\n",
    "parent": 0
  },
  {
    "id": 416002,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-09-10T16:55:08",
    "content": "<p>When the then Arethusa which had been moored at Lower Upnor on the River Medway for many years left for the USA they just dropped her mooring warps into the river. Some time later the Upnor Sailing Club had to build a longer access pontoon to reach mean low water because the lack of the large ship was changing the geography of the river bed. A pile driving barge was contracted to lay a line of piles for our floating pontoons and all was going well until one of the furthest from the bank piles would not drive in. It was eventually discovered after much &#8216;mudlarking&#8217; that the pile was positioned right over one of the dropped steel hawsers and was just bouncing back with each punch. Arethusa was gone but not forgotten!</p>\n",
    "parent": 0
  }
]