[
  {
    "id": 409493,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-02-18T16:31:01",
    "content": "<p>Thanks for the clarification. I also agree. The people at Discovery Channel/Canada are top notch. They were committed to getting the stories right and telling then well. Very impressive.</p>\n",
    "parent": 409478
  },
  {
    "id": 409478,
    "author": "Robert Ford",
    "authorUrl": "",
    "date": "2019-02-17T22:14:41",
    "content": "<p>Just to clarify, I was not an investigator for this accident. I was an investigator for the NTSB from 2001 to 2006. I provided background information and knowledge as to how investigations are, or should be, conducted. I was a sea-going mariner when the Marine Electric sank. Discovery Channel/Canada, which has produced this series, contacted me to discuss another accident.  I was the investigator for a Liberian flagged vessel that sank (Ice-ship/Explorer) in Antarctica. I would like to add, the people at Discovery Channel/Canada  should be applauded for this. They were professionals at every level and, hopefully, this exposure will shed some light which will save lives.</p>\n",
    "parent": 0
  },
  {
    "id": 409452,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-02-16T12:14:05",
    "content": "<p>That&#8217;ll be the rust from having the paint rubbed off by tugs and docking by ear*<br />\n*similar to some car drivers parking by ear &#8211; keep going till you hear a crunch. Some manage it even with proximity sensors. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 409408,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-02-14T11:07:25",
    "content": "<p>It is probably just me.  Yet that picture of the boat looks like it has seen a fire.  The orange areas being where the paint had been cooked off from excessive heat.  Just saying</p>\n<p>Yup, these shows are great for those whom can get them.  Or if you have the money to subscribe to their channel online and stream their show directly over the internet</p>\n",
    "parent": 0
  },
  {
    "id": 409396,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-02-13T18:36:16",
    "content": "<p>I gave up cable a few years ago, do I miss it, sure, but there is more than enough over the air TV, &#8220;IF&#8221; your antenna is high enough and pointed to the TV transmitters.</p>\n<p>Ours are mostly located in one city, south east of me about 20-25 miles away.</p>\n<p>I&#8217;m 90+ feet up.</p>\n",
    "parent": 0
  }
]