[
  {
    "id": 408882,
    "author": "Flavio Mendonça",
    "authorUrl": "",
    "date": "2019-01-11T17:38:55",
    "content": "<p>Even if not caring about navigational accuracy, the issue is far more complex. First, only considering geographical and not political lines, whem crossing the &#8220;date-line&#8221; from west to east, one has to subtract 1 day (remember &#8220;Around the World in 80 Days&#8221;?) Being so, on one minute before midnight, on Dec 31, on west side of the line, it will be one minute before midnight, Dec 30, on east side. Two minutes later, it will be Jan 01 on the west side and Dec 31 on the east side. Both side ARE on the same hour, but in different days, because the date line runs in the middle of the 12 hour time zone, west side being +12 and east side being -12.<br />\nBut, to be true, nowadays, the issue is even more complex, once the political date line is far from a straight line. By the Equator, on the south side, Kiribati has brought the date line some 2 hours to the west. Total mess&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 408686,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2019-01-01T13:49:51",
    "content": "<p>A perfect New Year’s story on New Year’s Day!<br />\nThanks Rick! Keep them coming!</p>\n",
    "parent": 0
  },
  {
    "id": 408676,
    "author": "Malcolm Monroe",
    "authorUrl": "",
    "date": "2019-01-01T00:54:43",
    "content": "<p>Even this charming story is true, it is basically a waste of time.  My astronomer friends all ask: &#8220;Why do we have to explain this again every 100 years?&#8221;  Since we don&#8217;t start calendars with a year zero, starting on 1 January year 01 instead, the first decade ends at the END not the BEGINNING of year 10. Similarly, the first century ends at the END, not the BEGINNING of the year 100, and the pattern persists!  It therefore follows that like all centuries and millennia, the century in question turned not at the beginning of the year 1900, but the end of 1900, from 31 December 1900 to 01 January 1901, and the Warrimoo was a year early.  Apparently people get so excited by multiple zeros that they lose their ability to count time, and always want to celebrate early.  As an aside, on the actual turn of the current millennium, I spent New Years Eve, 31 Dec 2000 in the Marshall Islands, and on New Years Day, 01 Jan 2001, I got on an airplane and flew to Honolulu, arriving there on New Years Eve, 31 Dec 2000 again, able to celebrate the true turn of the millennium twice.  In any case, a happy New Year 2019 to all.</p>\n",
    "parent": 0
  }
]