[
  {
    "id": 405386,
    "author": "Robin Denny",
    "authorUrl": "",
    "date": "2018-01-24T11:59:52",
    "content": "<p>The fate of the Preussen: Built at Techlenborg&#8217;s Yard in Germany in 1901, 482ft. long, she was capable of 20 knots.<br />\nNear Midnight on 5th.November, 1910, en route for Chile, she was sailing South-West down the English Channel at some 16 knots when she was hit by the Denny built 273ft. turbine steamer Brighton, which completely misjudged her speed in the dark, carrying away her bowsprit, part of her foremast and much of her steel cable rigging. The Brighton returned to Newhaven to summon assistance. The tug Alert towed Preussen 60 miles to anchor off Dover Harbour. In a rising gale both anchor chains parted and she was driven ashore near Crab Bay, South Foreland where sadly she broke up. Her hull can still be seen at low water Springs.<br />\n      In 2014 the cruise ship Saga Sapphire had to anchor off South Foreland. On weighing the anchor it was found to have snagged a long 2 inch steel cable. Could it have been one of Preussen&#8217;s forestays?</p>\n",
    "parent": 0
  },
  {
    "id": 405339,
    "author": "Old Pete",
    "authorUrl": "",
    "date": "2018-01-15T06:23:47",
    "content": "<p>Is the the Peking, recently returned to Hamburg, related Preusen?</p>\n",
    "parent": 0
  },
  {
    "id": 405335,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-01-14T02:11:28",
    "content": "<p>Considering that the old world of sail was killed as much by (1) intensive labor and all the complications that come with people as it was by (2) modest speed and (3) slightly uncertain arrival times, it&#8217;s exciting to see us circle back and have another go with updated machinery. Take away any of those three problems and suddenly some proportion of cargo is sail-compatible. </p>\n<p>Plus of course having a decent auxiliary engine means no more waiting for days to claw out of some bight, firth or estuary.</p>\n",
    "parent": 0
  },
  {
    "id": 405331,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-01-13T10:35:15",
    "content": "<p>I think the primary reason that the mizzen and jigger masts were used is because they are roughly over the engine room. If the wind is light and the vessel is motoring, the apparent wind will be forward of the beam and carry the smoke away aft.  I think the main goal in using the mast as uptakes is to try to get the exhaust as high above the deck and away from the rigging and sails as possible.</p>\n",
    "parent": 0
  },
  {
    "id": 405330,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2018-01-13T01:19:15",
    "content": "<p>As a square-rigger, with winds from astern or on the quarter, wouldn&#8217;t it<br />\nmake more sense for engine exhaust to vent from the Foremast. Or are passengers restricted from the aft end of the ship so that works better?</p>\n<p>Do the masts need stays or shrouds, or have them for a more realistic appearance?</p>\n",
    "parent": 0
  }
]