[
  {
    "id": 419490,
    "author": "Erik ABRANSON",
    "authorUrl": "",
    "date": "2021-01-27T14:09:47",
    "content": "<p>« Statsraad Lehmkuhl &#8230; the “largest three mastered barque from Norway.”<br />\n— Do the masters rotate watches, 4 hours on, 8 hours off or do they split the cruises between them? In any event, she must be the only three-mastered three-masted barque in the world&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 419399,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-01-24T18:41:56",
    "content": "<p>ENERCON&#8217;s EShip 1 is similar to the SC Connector but with 4 shorter Flettner rotors. I wonder how she did in the Southern Ocean winds. Cousteau developed a ventilated wing sail that looks similar to the Flettner rotor but acts more like a conventional sail. The Dutch firm eConowind is developing an updated version.</p>\n<p><a href=\"http://www.oldsaltblog.com/2019/09/dutch-shipowner-investing-in-new-ventifoil-wind-assist-technology/\" rel=\"nofollow ugc\">http://www.oldsaltblog.com/2019/09/dutch-shipowner-investing-in-new-ventifoil-wind-assist-technology/</a></p>\n",
    "parent": 0
  },
  {
    "id": 419397,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2021-01-24T16:49:35",
    "content": "<p>Hi; STRATSRAAD LEHMKUHL is in fact a barque as she is the base from which all barques come subsequent will have 4 or 5 masts. That is the correct description she happens to be the largest sailing ship of any description in Norway, they also maintain the ships SORLANDET, CHRISTIAN RADICH and GEORGE STAGE all four are square riggers.</p>\n<p>When we were in the southern oceans on the approach to Cape Horn in EUROPA 2015 we cam across ENERCON which looked not unlike SS CNNECTOR she was also in the trade of transporting parts for windfarms, I understand these vessel types are descendants of the Fletnor Rotor ship of the 1920s the ahead of its time and an unsuccessful type, I believe the Cousteau organisation had a foray into this are some years ago.</p>\n",
    "parent": 0
  },
  {
    "id": 419389,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-01-24T11:08:07",
    "content": "<p>The link to the Statsraad Lehmkuhl shows a three-masted barque.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Statsraad_Lehmkuhl\" rel=\"nofollow ugc\">https://en.wikipedia.org/wiki/Statsraad_Lehmkuhl</a></p>\n",
    "parent": 419369
  },
  {
    "id": 419369,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-01-23T17:17:54",
    "content": "<p>So the story says “largest three mastered barque from Norway.”<br />\nYet the pictures and video show ships with two.  A cut and paste with out proof reading?  Just curious</p>\n",
    "parent": 0
  }
]