[
  {
    "id": 412494,
    "author": "Rose",
    "authorUrl": "",
    "date": "2019-10-15T19:06:56",
    "content": "<p>I would point out that the container ships would be going where they&#8217;re going anyway. The passenger is really just paying for a cabin that would be taking the trip empty otherwise. Seems to me that that&#8217;s about as close to carbon neutral as you can get&#8211;and it&#8217;s not cheap! You pay $100 a day and it takes a lot longer as you have to go as slowly as the container ship does.</p>\n",
    "parent": 0
  },
  {
    "id": 412419,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-06T22:30:45",
    "content": "<p>The modern 18 wheeler puts out a tablespoon of emmisions in comparison to trucks built pre2000.  Mega fleets are doing everything they can to make todays Class 8 trucks more fuel efficient.</p>\n<p>I am a railroad buff myself.  Yet trains can no longer compete with the truck industry.  That of which you get cheaply at your stores was delivered by a truck.  If trucks were removed?  That of which you enjoy to get to the stores or comes in the mail would take weeks to get to you as opposed to days.  A single tractor trailer hauls 20 ton of freight in that 53&#8242; box.  Like a small freight train, to stop a truck that is going 55 mph will take a quarter mile.</p>\n<p>At current an average Class 8 truck can average 8.5 miles per gallon.  That is up from pre 2000 when trucks only got 5 mpg.  Yet something to think about?  Those monolithic campers you see on the road?  They average about 6 mpg.  Worse if they are pulling a trailer or car.</p>\n",
    "parent": 0
  },
  {
    "id": 412385,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-10-05T10:01:44",
    "content": "<p>Another reminder:    There was an ad from the rail freight company CSX that they could move a ton of freight by train for a gallon of fuel.  Of course you cannot cross the ocean on a train, but the train is far more economical too.    This really sunk in once when I was on the train between Boston and Seattle.   We passed numerous trains loaded with containers (double stacked west of Chicago).   I was going to Seattle to join my son and others for a sailboat passage from Port Townsend, WA to San Diego, via San Francisco.   We were in Alameda for a day or two and there I watched as the huge container unloading apparatus unloaded one container at a time onto am 19 wheeler.   Moving a 40 foot shipping container one by one and then out onto the highway was NOT fuel efficient!  It really brought that point home, in spades!</p>\n",
    "parent": 0
  },
  {
    "id": 412382,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-10-05T08:53:59",
    "content": "<p>Laugh all you want. On a per ton basis, cargo ships have a far lower carbon footprint than airplanes.</p>\n",
    "parent": 412379
  },
  {
    "id": 412379,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-04T18:49:48",
    "content": "<p>LOL, so much for a green commitment.<br />\n&#8220;Others are booking passages home on cargo ships – seen as a much more sustainable way to travel if you can’t sail.&#8221;</p>\n",
    "parent": 0
  }
]