[
  {
    "id": 422541,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-08T10:42:30",
    "content": "<p>Even if the Captain is a tyrant I would still make a unilateral effort to save the boat and possibly lives. Its going over &#8211; let the sheets fly!<br />\nDon&#8217;t just stand about waiting for orders that may never come and then drown. (My tip for the day)</p>\n",
    "parent": 0
  },
  {
    "id": 422532,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-07T15:53:36",
    "content": "<p>Problem*</p>\n",
    "parent": 0
  },
  {
    "id": 422531,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-07T15:52:27",
    "content": "<p>Unless the captain is the top of the list and requires crew to wait until comanded.  Proben to be the wrong atmosphere to have in many companies (industrial supervision)</p>\n",
    "parent": 0
  },
  {
    "id": 422525,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-07T12:47:20",
    "content": "<p>I&#8217;m not sure what else it could be. How many of the crew were actually sailors and how many were hospitality? When things start going wrong you need enough people who know what they are doing to act quickly.<br />\nA good crew will notice immediately if there is a problem and start doing the necessary even as, or before, the skipper starts giving instructions.<br />\nBut we have to wait for the investigation report to get an accurate assessment.</p>\n",
    "parent": 0
  },
  {
    "id": 422512,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-06T12:22:57",
    "content": "<p>So operator error.</p>\n",
    "parent": 0
  },
  {
    "id": 422510,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-06T08:58:01",
    "content": "<p>The difference between running down river and turning to tack back up our river is often two reefs in a fresh breeze. The apparent wind increases by the boat speed through the water down wind plus velocity made good upwind.<br />\nSo a 20 knot breeze which appears to be 14 knots down wind becomes 24 knots on the return, plus gusts and the increase caused by the pressure zone around the buildings of the power station which also changes the wind direction.<br />\nJust an example of estuary sailing.</p>\n",
    "parent": 0
  },
  {
    "id": 422509,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-06T08:43:51",
    "content": "<p>Maybe the reporter in your link missed out on some of Pete Norlander&#8217;s view of the incident. Between the end of the first para below and the start of the second.</p>\n<p>He says the first half of the boat ride down the Kennebec River Friday was amazing. But as they turned back up river, the wind picked up.</p>\n<p>“The wind was against us then,” said Norldlander. “So the captain turned on the engine. So we were sailing, but we were also using the engine.”</p>\n<p>He says as they came around a bend, the wind picked up, causing the ship to go much faster.</p>\n<p>When the captain turned the sails to change the ship’s course, it capsized.</p>\n",
    "parent": 0
  },
  {
    "id": 422482,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-05T07:42:10",
    "content": "<p>Thought it read he put the engine on during a lull of wind.  Came around the point and had too much wind.</p>\n",
    "parent": 0
  },
  {
    "id": 422480,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-05T07:30:05",
    "content": "<p>When the wind increased the skipper put the engine on?</p>\n",
    "parent": 0
  },
  {
    "id": 422464,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-04T18:21:09",
    "content": "<p><a href=\"https://bangordailynews.com/2021/08/03/news/midcoast/passenger-recounts-capsizing-of-historic-maine-schooner/\" rel=\"nofollow ugc\">https://bangordailynews.com/2021/08/03/news/midcoast/passenger-recounts-capsizing-of-historic-maine-schooner/</a></p>\n",
    "parent": 0
  },
  {
    "id": 422463,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-04T18:16:56",
    "content": "<p>Local news hasnt updated yet.  It may be a month plus before anything is known</p>\n",
    "parent": 0
  },
  {
    "id": 422458,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-08-04T07:39:44",
    "content": "<p>It can get very difficult and messy if the mast gets stuck in the mud. I have watched such shenanigans happening to racing dinghies in my home river.<br />\nGood job by the rescuers and salvage crew, that is quite a major incident.<br />\nWas it caused by a white squall?</p>\n",
    "parent": 0
  },
  {
    "id": 422451,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-03T15:49:01",
    "content": "<p>Mind you she had heeled over in deep water as the channel is used by newly constructed naval vessels</p>\n",
    "parent": 0
  },
  {
    "id": 422450,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-03T15:47:08",
    "content": "<p>She was upside down at time of incident.  She had to be righted to set on the shore</p>\n",
    "parent": 0
  },
  {
    "id": 422445,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-08-03T13:27:15",
    "content": "<p>Given the vessel&#8217;s history, just a minor setback! Deck barely awash&#8230;</p>\n<p>Excellent that everybody was safety recovered.</p>\n",
    "parent": 0
  }
]