[
  {
    "id": 412585,
    "author": "Doug Bostrom",
    "authorUrl": "https://skepticalscience.com",
    "date": "2019-10-28T18:27:44",
    "content": "<p>Willy, a helpful way to think of this is in terms of ratios of cold weather to warm weather. While it&#8217;s true that temperature swings up and down and in fact we&#8217;re still setting record cold temperatures (in part because records are not necessarily long for a given location) there&#8217;s a <i>trend</i> to the swing. </p>\n<p>See this helpful article, in particular the graphic showing the changing relationship of record cold temperatures to record warm temperatures.</p>\n<p><a href=\"https://skepticalscience.com/global-warming-cold-weather.htm\" rel=\"nofollow ugc\">https://skepticalscience.com/global-warming-cold-weather.htm</a></p>\n<p>It&#8217;s another feature that goes against our intuition.</p>\n",
    "parent": 0
  },
  {
    "id": 412584,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-10-28T15:36:20",
    "content": "<p>Sorry, that should be &#8220;losing&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 412583,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-10-28T15:34:12",
    "content": "<p>Commander Pat Paterson, U.S. Navy (Retired) must be loosing his marbles.<br />\nAs a Navy man he should know that Spring Tides happen approximately fortnightly, not weekly.</p>\n",
    "parent": 0
  },
  {
    "id": 412581,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-10-28T11:00:42",
    "content": "<p>Either new technology will address the man-made problem of global warming or we will destroy ourselves. There is no shortage of clean energy. We just need the will and vision to tap into it.</p>\n",
    "parent": 412578
  },
  {
    "id": 412578,
    "author": "James Cook",
    "authorUrl": "",
    "date": "2019-10-28T10:30:27",
    "content": "<p>If wish to limit man&#8217;s impact on the world, you must limit man. This can be done in 1 of 2 ways. The first is limit mans numbers. Historically humans had large families to compensate for high mortality rates among children, especially infants. Thanks to modern medicine we no longer need to have large families. Most modern countries have lower birth rates, but too many countries do not so the population continues to grow. </p>\n<p>The second way to limit man impact is to impoverish us. Energy is wealth. It is the ability to transform low value items into high value items. Unfortunately our leaders seem to prefer to impoverish us as it makes us more controllable.</p>\n",
    "parent": 0
  },
  {
    "id": 412577,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-28T06:47:48",
    "content": "<p>Thankyou Doug.</p>\n<p>The Bay of Foundy may be warming.  Yet that heat hasnt gone to Frenchman&#8217;s Bay.  Frenchman&#8217;s Bay does influence our weather.  On average the bay makes the surrounding towns 10 degrees warmer in the winter as opposed to inland temps.  Yet in the summer we are 10 degrees cooler.  You can feel it if your arm is outside in the open air in the summer.  Drive route one going north out of Ellsworth.  Cross the bridge from Hancock to Sullivan and the sensation is immediate.</p>\n<p>Yet I am still not sold on the climate change.   There are some places that have been warmer.  Alas it could be 80F in Indianna.  Yet we are still at 35F.  To me, climate change means everyones temp goes up.  Right now in the midwest from the eastern side of Washington through to Wyoming they have an early winter.  Yet it is autumn weather here in the northeast.  Normal weather for us.  Nope, if there is truly climate change?  Everyone will be posting warmer temps at the same time everywhere.</p>\n",
    "parent": 0
  },
  {
    "id": 412573,
    "author": "Doug Bostrom",
    "authorUrl": "https://skepticalscience.com",
    "date": "2019-10-28T03:05:03",
    "content": "<p>+++ to Hank, who got it right. </p>\n<p>Sea level rise rates vary everywhere for a number of reasons, but it&#8217;s a net gain/loss situation. Overwhelmingly it&#8217;s gain, not loss, but Maine is a special case. </p>\n<p><i>Supposing</i> for a moment that Greenland lost most of its ice, sea level immediately around Greenland would actually <i>fall</i>, because the gravitational attraction of all that ice that has been converted to water is gone. </p>\n<p>Sea level isn&#8217;t necessarily intuitive.</p>\n",
    "parent": 0
  },
  {
    "id": 412565,
    "author": "Hank Burchard",
    "authorUrl": "",
    "date": "2019-10-27T17:44:26",
    "content": "<p>Maine isn&#8217;t experiencing flooding because that region is rising at nearly the same rate as the oceans, rebounding from the melting of miles-thick ice that depressed the land during the last ice age. Willy could look it up.</p>\n",
    "parent": 0
  },
  {
    "id": 412564,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-10-27T17:38:42",
    "content": "<p>Willy,</p>\n<p>Sea levels rise at different rates in different locations. The Chesapeake is rising faster than most. If your area&#8217;s sea level is not, good. On the other hand, Maine&#8217;s waters are heating up faster than 99% of the ocean. Rising water temperatures are a threat to the fisheries on which Maine&#8217;s economy depends. So, you can call BS all you want. It doesn&#8217;t change a thing. </p>\n<p><a href=\"https://eos.org/features/why-is-the-gulf-of-maine-warming-faster-than-99-of-the-ocean\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Why Is the Gulf of Maine Warming Faster Than 99% of the Ocean?</a></p>\n",
    "parent": 412552
  },
  {
    "id": 412563,
    "author": "Hank Burchard",
    "authorUrl": "",
    "date": "2019-10-27T17:23:57",
    "content": "<p>Hampton Roads and Virginia Beach have been flooding steadily deeper at spring tide for years, and even normal tides come up in the towns when the wind is foul. Annapolis, and especially the adjacent Naval Academy, are bailing furiously and mostly fruitlessly. Richmond&#8217;s getting damn damp, and the National Mall will go back to being a marsh unless wholly unholy sums are spent pretty speedily. But hey nonny nonny, this is God&#8217;s country, and we trust in the Lord, and what the Hell anyway, this is the End Times.</p>\n",
    "parent": 0
  },
  {
    "id": 412557,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-26T20:35:40",
    "content": "<p>Phil?  Read the first post.  It is there.  Look at the last line of the first post.</p>\n<p>Ginny?  Erosion doesnt mean the sea is rising.  Erosion happens because no one has stabilized the soil to erosion.  IE beach grasses or riprap stonrs are also good to stop erosion.</p>\n",
    "parent": 0
  },
  {
    "id": 412556,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-10-26T18:39:06",
    "content": "<p>How fortunate you are to live so far north in Maine.    Alas that the rest of Maine seems to be sining while Sorrento rises&#8230;&#8230;&#8230;&#8230;where I live (on an island offf Massachusetts, erosion is wiping our island away and the rising ocean is doing its share.    Our summers have been hotter and more humid as well as total dought except that this summer we did have enough rain to sustain Mother Nature.   Winters are definitely milder.   I&#8217;m an old woman now and memories extend back to the early 40&#8217;s.   Climate change is not a hoax; it is real and it will get worse. Ninety seven percent of the scientists who study such things probably aren&#8217;t wrong!</p>\n",
    "parent": 0
  },
  {
    "id": 412555,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-10-26T16:38:30",
    "content": "<p>Willy,<br />\nWhere are you?<br />\nWhere do you live?<br />\nOnly 2 questions!</p>\n",
    "parent": 0
  },
  {
    "id": 412553,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-26T10:23:07",
    "content": "<p>I should point out.  Since I cant edit the above post.  I moved here in 1985.  Yet we were summer folk since I was a child in 1960.  There is a boulder on the shore that I can watch to see where high tide is.  Boulder is about 4 ton.</p>\n",
    "parent": 0
  },
  {
    "id": 412552,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-10-26T10:19:23",
    "content": "<p>It may be happening up north.  Yet it isnt happening here in Maine.  The snows are deeper.  The winter is longer.  Contrary to the reports of some places being milder.  It just isnt happening for those of us in the northeast usa.  In 1985 to 1995 our winters ended in April with us seeing May flowers.  The last 5 years I have kept track of have us starting to see open ground in May.  This last summer we only had 6 weeks of temperatures above 70F.  June alone was very cold and our crops did not grow as much of them died from nights still in the thirties.</p>\n<p>Climate change maybe in some parts.  Yet it isnt a reality for everyone.  Rising sea level?  At most since 1985 when I moved here from California we have only lost a half inch of average high tide.  So pardon me while I say BS to the scientific data.  Some one is making it up!</p>\n<p>Resident of Sorrento Maine</p>\n",
    "parent": 0
  }
]