[
  {
    "id": 418770,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-31T07:22:50",
    "content": "<p>The only concern I see is that the bivalves arent in a reef yet.  It is presumed that the bivalves survived being out of water from the time of harvest to the time they are washed overboard.  Then the other head ache is the bivalves are just littering the floor.  No attempt was made to allow them to start the bonding thus creating the reef.</p>\n<p>The article to me suggests that the bivalves are just going to magnetically attach and become a win-win.  An awful lot of presumptions.</p>\n",
    "parent": 0
  },
  {
    "id": 418761,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-12-30T19:32:54",
    "content": "<p>Reseeding receding reefs!</p>\n<p>Love it!</p>\n",
    "parent": 0
  },
  {
    "id": 418760,
    "author": "Ginny Jones",
    "authorUrl": "",
    "date": "2020-12-30T19:26:49",
    "content": "<p>I should have mentioned that RIck Karney grew up in New Jersey, has consulted all over the world on shell fish propagation and is highly respected!    Particularly by those of us who have been privileged to work with him.</p>\n",
    "parent": 0
  },
  {
    "id": 418759,
    "author": "Ginny Jones",
    "authorUrl": "",
    "date": "2020-12-30T19:23:56",
    "content": "<p>One fact that was mentioned, but not the reason that is so significant is that oysters filter nitrogen out of water, and so the fact that an oyster can filter as much as 50 gallons of water in a 24 hour period is incredibly important.   Nitrogen is one of the contaminants in a water body and can result from poor management practices on coastal farms and water bodies, or faulty septic systems, etc.   We need to clean up our water bodies and Working with Mother Nature and responsible natural processes to do so is pure common sense.    There is so much to be learned but using oysters (for instance) (and using the oyster shells from restaurants and fish markets, processing them to kill of pathogens and then using them as a substrate for growing oyster cultch is a huge plus.   .   There is a very successful shellfish hatchery here on the Vineyard where many oysters are raised from tiny seed each year and are provided to local oyster farmers and fishermen.  Transferred to grow out tanks and bags we have a very productive fishery and a very nutritious source of potential food.   I am a bit dubious about the weight of the oysters that can be carried on a barge of that size.   I hope that some one will check the weights and numbers and confirm.</p>\n<p>The Hatchery is supported by all six towns on the Vineyard and founding (I believe) by now semi retired scientist Rick Karney and the current director Emma Green Beach, Has been an incredible resource for this island and the aquaculture as well as wild oyoster fisheries.</p>\n",
    "parent": 0
  }
]