[
  {
    "id": 409035,
    "author": "Willie",
    "authorUrl": "",
    "date": "2019-01-20T14:43:59",
    "content": "<p>Perhaps if all members of our government lived up to the creed of the Coast Guard, we would have a more succinct functioning government.</p>\n<p>Coast Guard Creed of The United States Coast Guardsman.</p>\n<p>I am proud to be a United States Coast Guardsman.<br />\nI revere that long line of expert seamen who by their devotion to duty and sacrifice of self have made it possible for me to be a member of a service honored and respected, in peace and in war, throughout the world.<br />\nI never, by word or deed, will bring reproach upon the fair name of my service, nor permit others to do so unchallenged.<br />\nI will cheerfully and willingly obey all lawful orders.<br />\nI will always be on time to relieve, and shall endeavor to do more, rather than less, than my share.<br />\nI will always be at my station, alert and attending to my duties.<br />\nI shall, so far as I am able, bring to my seniors solutions, not problems.<br />\nI shall live joyously, but always with due regard for the rights and privileges of others.<br />\nI shall endeavor to be a model citizen in the community in which I live.<br />\nI shall sell life dearly to an enemy of my country, but give it freely to rescue those in peril.<br />\nWith God&#8217;s help, I shall endeavor to be one of His noblest</p>\n<p>Semper Paratus<br />\nUSCG, BMCS Retired</p>\n",
    "parent": 0
  },
  {
    "id": 409012,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-01-19T18:31:42",
    "content": "<p>Yes, the USCG is part of the Homeland Security (an oxymoronic term) rather than the Department of Defense, or even the Treasury Department where it used to be.    When i was writing yesterday I was thinking of the RNLI, which is an organization that I think the world of, and send a contribution every year (despite being American and no longer sailing) &#8212; when I sailed all around Ireland and up into the Hebrides and the western UK, I saw many of the RNLI vessels &#8212; all so sensibly designed and outfitted &#8212; and I&#8217;ve watched more than a few videos of them at work.   Their crews are superb, and yes, mostly volunteers.   As such, however, they have other sources of income and do not perform the very diverse range of activities that our USCG does such as drug and smuggling interdictment, vessel safety, mariner credentials, dealing with refugees, and on and on it goes.<br />\nWe know that the Coast Guard crews will get paid eventually but why shouldn&#8217;t the get paid on time and in full (and the rest of the government employees as well) as they should be.<br />\nNow Bonehead has suggested a swap (which has to be approved by Congress and isn&#8217;t in &#8220;the gift&#8221; of the Frumpster) &#8212; he will allow for the DACA folks to stay if Congress approves the $5 Bn plus for his ridiculous wall.    What happens when the wall costs billions more (as is estimated) than the master of bricks, mortar Chinese steel and bankruptcy says?   A much more equitable and sensible proposal was made some time ago (and rejected by Mitch McConnell and the Frumpster) which was to open government back up and debate just the wall part of the budget.<br />\nWe are already the laughing stock of the world and this just heaps more shame onto an already disgraceful situation.</p>\n",
    "parent": 0
  },
  {
    "id": 409009,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-19T15:01:40",
    "content": "<p>Poor third world country having to receive food donations from Canadian air traffic controllers 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 409008,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-01-19T13:06:25",
    "content": "<p>The USCG is now under Homeland Security, not the military and no longer under the Treasury Dept.</p>\n<p>Article here from NewsNet5 in Cleveland, people are helping them out:</p>\n<p>How local businesses, organizations are helping government workers during the shutdown<br />\nPosted: 1:40 PM, Jan 10, 2019  Updated: 2:58 PM, Jan 16, 2019<br />\n<a href=\"https://www.news5cleveland.com/news/local-news/cleveland-metro/how-cleveland-businesses-are-helping-government-workers-during-the-shutdown\" rel=\"nofollow ugc\">https://www.news5cleveland.com/news/local-news/cleveland-metro/how-cleveland-businesses-are-helping-government-workers-during-the-shutdown</a></p>\n",
    "parent": 0
  },
  {
    "id": 409006,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2019-01-19T12:02:02",
    "content": "<p>The Coast Guard doesn&#8217;t deserve this, our country doesn&#8217;t deserve this. Open the government back up and then talk!</p>\n",
    "parent": 0
  },
  {
    "id": 409005,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-19T09:49:09",
    "content": "<p>As a foreign national I want to know how this ridiculous situation where the military get paid and the coastguard don&#8217;t came about in the first place?<br />\nAlso a vote of thanks to the lifeboat men and women in the UK (the ones who do the dangerous stuff) who are mostly unpaid volunteers unlike their shore based administrators. <a href=\"http://www.indeed.co.uk/cmp/Rnli/salaries\" rel=\"nofollow ugc\">http://www.indeed.co.uk/cmp/Rnli/salaries</a></p>\n",
    "parent": 0
  },
  {
    "id": 408997,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-01-18T23:38:38",
    "content": "<p>As a foreign national, I and many more cannot understand why any government employee is not paid. Surely, they will be paid regardless of the rest of the budget as and when it is approved? So why not pay them now?</p>\n",
    "parent": 0
  },
  {
    "id": 408994,
    "author": "Capt. J. Vincent Collins",
    "authorUrl": "",
    "date": "2019-01-18T22:19:51",
    "content": "<p>The shutdown has closed all Regional Exam Centers. All scheduled test dates   have been cancelled, all processing of credentials has ceased. They have extended credential expiration out a few months to March.</p>\n<p>The renewal of my Master Oceans 1600 Ton credential is sitting in the Boston REC (Regional Exam Center). I completed and met all requirements for renewal, it just needs to be sent to West Virginia for issuance.<br />\nSo I currently have an expired credential awaiting renewal. </p>\n<p>I think it is going to be a quite a while before the shutdown is lifted or some other solution is implemented so that the USCG administrative employees can return to their duties. The backlog of renewal, testing and issuance paper work must be enormous by this time, I just wonder how many months it is going to take to process all this paperwork. I am not expecting issuance of my credential for many months. </p>\n<p>This situation if not resolved in short order is going to create an enormous problem for USCG credentialed Master,mates, pilots, AB&#8217;s etc.</p>\n<p>Keeping my fingers crossed for a timely solution to this problem for myself and all the other seamen effected by the shutdown.<br />\nworking seamen</p>\n",
    "parent": 0
  },
  {
    "id": 408991,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-01-18T20:03:07",
    "content": "<p>This is something that I&#8217;ve been thinking about (since I live on an island and we have an active CG station here with two 47&#8242; boats) &#8212; for an amazing example of what the Coast Guard does, watch the 11 min plus video of the Search and Rescue helicopter and crew rescuing the crew of the BOUNTY some years ago.   Watching the rescue swimmer in the water, listening to the co-pilot giving navigational directions to keep the copter on target, listening to the robotic voice warning as the copter slips in altitude, and as I believe I remember, knowing that the man on the wire had dislocated his shoulder, and in between hoists was trying to get it back in the socket&#8230;&#8230;&#8230;.well it is an extraordinary display of unimaginable bravery and skill.    And the Coast Guard does that day in, day out.    And now, without pay because a petty bully has his knickers in a knot.   Keep in mind that Colonel Bone Spurs has now managed to turn our great country into an international disgrace, by having the most corrupt and regressive, administration in memory (I am old) if not ever.     The Coast Guard&#8217;s informal motto is &#8220;You have to go out, you don&#8217;t have to come back.&#8221;   The Frumpster is unworthy of even licking their boots.    BTW, the BERNARD WEBBER (Sentinel Class Cutter) mentioned above is named after CWO Bernard Webber, the Coxwain of the life Boat 36500 famed for the incredible rescue of crew from the PENDLETON off Chatham, MA back in the 50&#8217;s &#8212; the rescue that is dubbed The Coast Guard&#8217;s FINEST HOUR.   Well perhaps now is the Coast Guard&#8217;s finest hour as it continues to serve, without pay, in perilous circumstances and perilous times.</p>\n",
    "parent": 0
  }
]