[
  {
    "id": 425697,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-02-02T20:05:53",
    "content": "<p>Oui Jean-Pierre &#8211; c&#8217;est la vie !!</p>\n",
    "parent": 0
  },
  {
    "id": 425696,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-02-02T16:50:27",
    "content": "<p>Peter&#8217;s &#8220;expensive delay&#8221; should make a few lawyers even more wealthy.</p>\n",
    "parent": 0
  },
  {
    "id": 425695,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2022-02-02T16:48:30",
    "content": "<p>Admiral Farragut redux &#8211; Damn the rockets, full speed ahead!</p>\n",
    "parent": 0
  },
  {
    "id": 425692,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-02-02T11:31:52",
    "content": "<p>Found this incident by Royal Caribbean to be indicative of careless operation of a vessel which is not very encouraging for those sailing with this cruise line.  Over the years I have been on several cruise ships observing launchs without any problems whatsoever.  USCG instructions were observed on each and every occasion.<br />\nOne doubts, since SpaceX is a private company, if much will be done by the US Authorities.  Thankfully other than an expensive delay nothing serious happened.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 425691,
    "author": "Capt. J. Vincent Collins",
    "authorUrl": "",
    "date": "2022-02-02T10:19:13",
    "content": "<p>Back in the eighties I was delivering a yacht to Florida.<br />\nThe coast guard posted notice to mariners of the launch and defined the exclusion area, this being an area based on Canaveral Light starting at 0400 hours from 005 degrees (T) through 210 degrees, I can’t remember the exact range.<br />\nI wasn’t able to transit the area before the closure time so I decided to attempt to enter Ponce Inlet figuring we would be in the ICW and could make it through the area or anchor up in the ditch, then be on our way.<br />\nIt was starting to breeze up E, NE, and I had only been in that inlet a few times, it was a dark night a bit of heave on and the small ATONS were poor radar targets and difficult to define visually in the surf with the spotlight. It’s a small inlet, shifting sands and shallow bars.<br />\nNot wanting to put her on the bar or the beach I deemed it prudent to stand off and reassess the situation until sunrise.<br />\nAfter plotting the closure area it was obvious I could run down the 005 degree line, (185 degree bearing to the light) and anchor right up almost on the beach in about 15 feet of water, the wind laid down at sunrise and we awaited the show of the launching of the shuttle.<br />\nUpon setting the hook I determined through visual and radar bearings I was definitely outside of the closure area.<br />\nIt was then military helicopters came out to have a look at my vessels position. Their concern was that I might be in the closure area and this would cause a delay of the launch of the shuttle.<br />\nI established coms with Navy and USCG on the VHF. The navy commanded that I move my vessel immediately. I told them I was in compliance with the Notice to Mariners exclusion zone established by the USCG and that they should confer with them to verify that I was in compliance.<br />\nLong story but in the end the USCG determined I was in compliance and the launch would not be delayed.</p>\n<p>Being very close to the launch pad the view of the launch was quite dramatic, the sound and the pressure wave thundered and shook the boat dramatically. The colors of the gases and enveloping cloud of smoke was incredible, then after what seemed like minutes the shuttle emerged through the smoke and slowly, very slowly began its successful battle against gravity and the earth released its bonds on the craft as it attained altitude.</p>\n<p>All of this was covered with video on CNN and the owner of the vessel watched the whole event on TV while having breakfast!<br />\nSide note, the owner was a veteran Pan AM pilot and Goodyear blimp pilot.<br />\nA new closure area was defined after this incident.</p>\n",
    "parent": 0
  },
  {
    "id": 425686,
    "author": "Pat",
    "authorUrl": "",
    "date": "2022-02-01T19:07:41",
    "content": "<p>Did Schettino get out of prison?</p>\n",
    "parent": 0
  }
]