[
  {
    "id": 410412,
    "author": "D. Peter Boucher, Kt. SMOM, Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log",
    "date": "2019-05-05T12:03:14",
    "content": "<p>Jean-Pierre I very much doubt it as the ship is reserved for the members of Scientology not really the general public.  I did not mention that she was originally the MS Boheme of Wallenius Line built for Commodore Cruise Line.  Also she was the first cruise ship built by Finland at Turku yard who nowadays build many of these huge complex floating resorts called &#8220;cruise ships&#8221; for passengers called &#8220;guests&#8221; and yes they are still good at filing lawsuits !!</p>\n",
    "parent": 0
  },
  {
    "id": 410406,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-05-05T06:21:10",
    "content": "<p>Will the rest of the passengers bring a class action against the person with the disease for spoiling their holiday because he/she should have taken reasonable precautions?<br />\nAmericans are good at this sort of thing.</p>\n",
    "parent": 0
  },
  {
    "id": 410387,
    "author": "D. Peter Boucher, Kt. SMOM, Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log",
    "date": "2019-05-03T10:34:50",
    "content": "<p>It was with considerable amusement that one visited the MS Freewinds website.  The pictures are beautiful and amongst her many &#8220;Master Mariners&#8221; is listed L. Ron Hubbard as Commodore no less.  Well he may have been &#8220;commodore&#8221; but never was he a Master Mariner.  When the ship was new I was on board as 2nd. Officer for Commodore Cruise Lines.  Some years later when sailing in another cruise ship we were in port together.  On attempting to visit her I was refused permission after a consultation amongst the duty Officers who turned out to be Eastern Europeans.  Later the vessel was served an Admiralty Writ and the crew removed and the vessel placed under arrest.  This was around the time she was acquired by the Scientology Church.</p>\n",
    "parent": 0
  },
  {
    "id": 410385,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-05-02T16:25:33",
    "content": "<p>Serves the anti-right!</p>\n",
    "parent": 0
  },
  {
    "id": 410382,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-05-02T15:10:41",
    "content": "<p>Cant wait for the justification from Tom Cruise.</p>\n",
    "parent": 0
  },
  {
    "id": 410379,
    "author": "ws",
    "authorUrl": "",
    "date": "2019-05-02T09:44:10",
    "content": "<p>Buy Merck MRK!</p>\n",
    "parent": 0
  }
]