[
  {
    "id": 405582,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-03-03T21:28:19",
    "content": "<p>In revelations of the bible.  Even tho man shall hide in caves will not save him from judgement day.  Tho after judgement day man will return to earth with out want and the earth will have been reborn.</p>\n<p>All we need to do now is survive judgement day.</p>\n",
    "parent": 0
  },
  {
    "id": 405581,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-03-03T19:13:32",
    "content": "<p>What cheery news.    So Ok, I guess this could be termed the female perspective but how about having the lion (crouching, running, or whatever) sit down with the lamb.     The nations of the world have to learn to get along together because there is no Plan B if someone drops or shoots off the big one.    OF course we have so screwed up a lot of the world anyway, so what is another mass annihilation?  I am reminded of a bumper sticker (anything but PC) which says:   &#8220;Nuke a gay whale for Christ.&#8221;</p>\n<p>Folks, for the sake of all of us, and for our descendants please work for peace, otherwise only the rats and the cockroaches will survive.</p>\n",
    "parent": 0
  },
  {
    "id": 405577,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-03-03T11:47:20",
    "content": "<p>From BBC:<br />\nArticle &amp; video</p>\n<p>Putin&#8217;s nuclear slideshow<br />\nechoes Cold War<br />\n<a href=\"http://www.bbc.com/news/world-europe-43256488\" rel=\"nofollow ugc\">http://www.bbc.com/news/world-europe-43256488</a></p>\n",
    "parent": 0
  },
  {
    "id": 405576,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-03-03T10:40:24",
    "content": "<p>Like my friend said, &#8220;its election season in Russia&#8221;.</p>\n",
    "parent": 0
  },
  {
    "id": 405575,
    "author": "Total",
    "authorUrl": "",
    "date": "2018-03-03T10:39:55",
    "content": "<p>We don&#8217;t have a way to counter the threat of Russia&#8217;s *regular* nuclear weapons, so there&#8217;s nothing new here.</p>\n<p>And I&#8217;m pretty sure the ~4000 nuclear warheads they have at the moment would make the United States unlivable as well.</p>\n",
    "parent": 0
  },
  {
    "id": 405570,
    "author": "Carl E Ramsey",
    "authorUrl": "",
    "date": "2018-03-02T22:45:11",
    "content": "<p>Peter Wright shares my initial reaction. My other reaction is the motivation for saying such a thing. I was taught when a lion roars, look for the crouching lion. I also remember failures of Soviet technology in the past. They never successfully landed on the moon. Their conventional Naval arsenal in Europe blew up with such a bang, it was discovered by our Earthquake equipment. Their Mig 23 had fuel programs. Their aircraft carriers couldn&#8217;t go to sea without tugboats. They finally came up with a jump carrier the size of a cruiser. My closet friend in DC says their agents used to spend the beginning of each month trying to steal our latest patents. And the list goes on. I wouldn&#8217;t ignore the threat, but I can&#8217;t escape the idea of roaring lion and crouching lion.</p>\n",
    "parent": 0
  },
  {
    "id": 405569,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-03-02T21:49:19",
    "content": "<p>Did the Kremlin consider the ocean currents that will bring nuclear fallout back to their own shores?</p>\n",
    "parent": 0
  }
]