[
  {
    "id": 407603,
    "author": "al por",
    "authorUrl": "http://hotmail.com",
    "date": "2018-10-17T18:57:04",
    "content": "<p>Why stop with just a barrier. Build a bridge tunnel complex like the Chesapeake Bay Bridge tunnel.  To take this to an extreme build an artificial Island  in the middle and put an airport on it. Make it big enough to  replace Kennedy and LaGuardia Airports. The Island could be built out of a combination of incinerated garbage (which the city would have plenty of if it were not shipped out of state. As far as fish migration fish ladders could be built into the project. This would also ease interstate traffic congestion(start the road around Jones beach and consent it with the proposed Oyster Bay Rye bridge (Tunnel)</p>\n",
    "parent": 0
  },
  {
    "id": 407601,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-10-17T16:46:04",
    "content": "<p>This might be the real problem:</p>\n<p><a href=\"https://www.bbc.co.uk/science/horizon/2000/mega_tsunami_qanda.shtml\" rel=\"nofollow ugc\">https://www.bbc.co.uk/science/horizon/2000/mega_tsunami_qanda.shtml</a></p>\n",
    "parent": 0
  },
  {
    "id": 407585,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-10-16T17:27:59",
    "content": "<p>I guess the local topography and extent of the problem does not permit the use of a barrage that can be raised/lowered as need be.</p>\n<p>There&#8217;s so much money at stake in your region that I suspect we&#8217;ll see a might effort but it&#8217;s also the case that the general pool of money for SLR mitigation work will rapidly run out as we&#8217;re swamped in multiple locations. We can protect NYC but we can&#8217;t simultaneously handle Houston, Miami, LA etc., not if we project &#8220;unchecked emissions&#8221; which is the empirical record with no significant, plausible sign of change. </p>\n<p>So a lot of stuff is going to return to the new nature we&#8217;re creating, in our role  of playing &#8220;big dumb rock from space.&#8221; Some form of consolation, for folks interested in more than pavement?</p>\n<p>It&#8217;s really too bad we&#8217;re not better systems thinkers,  or much of this could have been avoided.  We had a grip on the basics beginning back in the &#8217;70s with the EOS system etc.</p>\n",
    "parent": 0
  },
  {
    "id": 407580,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-10-16T12:32:27",
    "content": "<p>The Dutch seem pretty genned up on this sort of thing, maybe Donald should give &#8217;em a call.<br />\nIn the UK we are breaking through the sea walls in some places to let  the saltings take up some of the surges again.</p>\n",
    "parent": 0
  }
]