[
  {
    "id": 414489,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log%20no%20longer%20published.",
    "date": "2020-05-13T11:17:22",
    "content": "<p>Some information has crossed my desk this morning possibly in response to this Post and my comments regarding crewmembers.  Several deaths as the result of apparent suicides have occurred during this quarantine.  In one of the several vessels anchored off Miami, Fl. a hunger strike by a group has been reported..<br />\nIt is very important that companies understand the relationships between the Officers hired and the crews hired.  Originally traditional maritime nations consisted of crews which understood this working relationship.  Perhaps one of the advantages of the colonial lifestyle.  Nowadays Officers and crews are multi-national and it was very clear in the cruise vessels I served in prior to retirement from seagoing, after 50 years, this relationship was not understood at all by either the companies or the ships Officers.<br />\nParticularly with Asian crews depression can hit quite suddenly and result in tragedy.   It is often necessary for an Officer to not be overly impressed with those gold stripes and sit with a crewmember and have a chat.  As an example I have personally seen an Indian seaman&#8217;s temperature change back to normal from a 105 degree fever by just spending a few minutes reassuring him.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 414480,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (Ret'd)",
    "authorUrl": "http://formerly%20Nautical%20Log%20no%20longer%20published",
    "date": "2020-05-12T09:53:35",
    "content": "<p>Further to my previous comment there is an article in Marinelink  under<br />\n&#8220;Manila Cruise Flotilla offers Crew confinement  in comfort&#8221; which illustrates how the Asians are being treated.  One should remember that a prison is a prison no matter how comfortable.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 414479,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (Ret'd)",
    "authorUrl": "http://formerly%20Nautical%20Log%20no%20longer%20published.",
    "date": "2020-05-12T09:39:18",
    "content": "<p>The ad mentioned in the previous comment is bait and switch as when those additional fees are added in the fare could triple which of course the corporation knows exactly.Carnival Group can only think of one side of the issue &#8211; money.  Nothing and nobody else matters to them.  Of course the corporation has arrangements with all the necessary local and Federal authorities in Miami-Dade County, Florida so there will be no objections.  This corporation is a prime example of corporate power at its most disgusting.<br />\nAs always my first thoughts are for the crews which mann these vessels particularly the Asians who are treated deplorably.  One can only hope that passengers will remember them and the hours they put in each day and week should people be unwise enough to fall for this corporate line and purchase a trip in these vessels.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 414472,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-05-11T19:29:33",
    "content": "<p><i>&#8230;five-day cruises from Galveston to Cozumel, Mexico, in early August starting at $139, plus taxes, fees, and port expenses.</i></p>\n<p>With a possibility of indefinite extension at no (monetary) cost to guests! Who could resist?</p>\n",
    "parent": 0
  }
]