[
  {
    "id": 405561,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-03-01T21:03:16",
    "content": "<p>It is true that some of the Right Whale deaths last year (2017) were caused by blunt force trauma, but many of the 17 or 18 were whales which had been entangled.   Some were so badly decomposed that the cause of death could not be determined.   We don&#8217;t know how many died without being found or identified.  </p>\n<p>A friend reminded me that sea turtles are also likely to be entangled by fishing gear.  It is important to remember that there are ways to modify gear (and not at great expense) to make it safer, allowing the fishermen to continue to fish and the marine creatures to safely traverse the oceans.</p>\n",
    "parent": 0
  },
  {
    "id": 405547,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-02-28T16:58:38",
    "content": "<p>Many of the<br />\nwhales found dead in<br />\nCanada this summer died<br />\nbecause of blunt force<br />\ntrauma.<br />\n<a href=\"https://news.nationalgeographic.com/2018/02/north-atlantic-right-whales-calving-season-extinction-spd/\" rel=\"nofollow ugc\">https://news.nationalgeographic.com/2018/02/north-atlantic-right-whales-calving-season-extinction-spd/</a></p>\n",
    "parent": 0
  },
  {
    "id": 405545,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-02-28T16:56:01",
    "content": "<p>PLASTIC!!</p>\n<p>29 Whales Found<br />\nDead – And We Did<br />\nIt<br />\n<a href=\"http://awesomeocean.com/whales/29-whales-found-dead/\" rel=\"nofollow ugc\">http://awesomeocean.com/whales/29-whales-found-dead/</a></p>\n",
    "parent": 0
  },
  {
    "id": 405544,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-02-28T16:51:04",
    "content": "<p>Maybe the parent whales decided to wait until Jan. or Feb. to mate?</p>\n",
    "parent": 0
  },
  {
    "id": 405543,
    "author": "dar",
    "authorUrl": "",
    "date": "2018-02-28T14:01:55",
    "content": "<p>ummm, this might have a bearing as well:<br />\nThe US Navy has permission<br />\nto use their deadly sonar in 75% of the world’s oceans and are doing so without filing the legally required Environmental Impact Statements.<br />\nIn the US alone, they are now legally allowed to cause 31 million instances of harm and thousands of deaths to cetaceans over the next 5 years despite the outcry of thousands of citizens.<br />\nLethal Sound (short version): Sonar Harms Whales<br />\nWatch this 1-minute preview narrated by Pierce Brosnan.<br />\n<a href=\"https://www.youtube.com/watch?v=57jshn7qpss\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=57jshn7qpss</a><br />\nClick here for the full movie (about 5 minutes) &#8230;<br />\n<a href=\"http://whaleanddolphinwatch.org/\" rel=\"nofollow ugc\">http://whaleanddolphinwatch.org/</a></p>\n",
    "parent": 0
  },
  {
    "id": 405537,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-02-27T20:57:09",
    "content": "<p>This is tragic, tragic news &#8212; not one baby this year.   None.    At the beginning of 2017 experts were theorizing that there were about 500 North Atlantic Right Whales remaining and then we had 17 or 18 deaths, including some carcasses which washed up on the shores of this island.   Forty years ago, when fishermen switched over from harpoons to long lines to catch swordfish (and other large fish) &#8212; I realized that it was  totally unsustainable because the long lines caught everything including immature fish and even babies.  Back then I decided to NEVER eat sword fish again and I never have.    Now I will never eat lobster again.  Please take the pledge because snow crab and lobster fishing gear are implicated in the deaths due to entanglement.   There are much safer options than the current fishing gear.    Vote with your voice, and vote with your money and stomach!</p>\n",
    "parent": 0
  }
]