[
  {
    "id": 411361,
    "author": "Karl Moens",
    "authorUrl": "",
    "date": "2019-07-16T10:36:07",
    "content": "<p>Yes, the vessel is back at sea on its way to Europe. It was reported its owners put up a bond for USD 50 million.</p>\n",
    "parent": 0
  },
  {
    "id": 411351,
    "author": "Chris Williams",
    "authorUrl": "",
    "date": "2019-07-16T02:52:49",
    "content": "<p>Why is the Cheif officers name &#8216;classified&#8217; information?</p>\n",
    "parent": 0
  },
  {
    "id": 411334,
    "author": "Steve N",
    "authorUrl": "",
    "date": "2019-07-15T08:32:12",
    "content": "<p>The boat is back at sea, makes you wonder how it went from being potentially conficated to being sent back to sea and on its way to the Netherlands.<br />\n<a href=\"https://www.marinetraffic.com/en/ais/home/shipid:5318625/zoom:6\" rel=\"nofollow ugc\">https://www.marinetraffic.com/en/ais/home/shipid:5318625/zoom:6</a></p>\n",
    "parent": 0
  },
  {
    "id": 411220,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-07-09T17:18:04",
    "content": "<p>Losing $1.3 billion is not good business even for the richest drug lords. And 400,000 tons would sink the ship several times over.</p>\n",
    "parent": 411217
  },
  {
    "id": 411217,
    "author": "The Man Who Cares",
    "authorUrl": "",
    "date": "2019-07-09T15:27:33",
    "content": "<p>Sure seems strange that nobody has given any thought that this ship was suppose to be caught. Why? Obviously. To hide the fact that another shipment was also in play. Reasoning. It was supposed to be caught. Why? So the Mother Load could get through. Mega Tons. How much? Well let&#8217;s just say this was a drop in the bucket to what was really allowed to get through. I&#8217;m talking a WHOLE ship load. 400,000 tons. Think about it. Yeah, I&#8217;m way above the rest in thinking critically. You all seriously think this is all that&#8217;s involved? Think again.</p>\n",
    "parent": 0
  },
  {
    "id": 411059,
    "author": "D. Peter Boucher, Kt.SMOM, International Master Mariner",
    "authorUrl": "",
    "date": "2019-06-27T09:38:36",
    "content": "<p>CAPT. Parani&#8217;s gracious reply is thoughtful and an example which could be well followed by many of how to respond on these occasions.  Perhaps his absence from MSC is being felt by them.  One hopes his comments are taken to heart by MSC and these negative incidents are indeed the last heard.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 411046,
    "author": "Captain VS Parani",
    "authorUrl": "http://parani.org/",
    "date": "2019-06-26T08:32:47",
    "content": "<p>Peter,</p>\n<p>This discussion thread was brought to my attention by a friend. Please allow me to respond.</p>\n<p>First of all, thank you for reading Golden Stripes- and I can see that you&#8217;ve read it until the last page. That&#8217;s great.</p>\n<p>I worked with MSC for over 15 years and I can say that I&#8217;m proud of the hard working men and women who were my colleagues and friends. What happened is a shame for all seafarers and I hope this is the last we hear of such cases.</p>\n<p>I am unable to comment further on what happened as I&#8217;ve moved on from MSC the last few years. I&#8217;m reachable on my email below in case you&#8217;d like to discuss the book or the leadership styles that you&#8217;ve commented upon.</p>\n<p>Regards<br />\nParani</p>\n",
    "parent": 0
  },
  {
    "id": 411026,
    "author": "Michael K.",
    "authorUrl": "http://Gomsah9@comcast.com",
    "date": "2019-06-23T18:33:31",
    "content": "<p>My view point is from having worked both in vessel ops and on the commercial side of the maritime business in export management.</p>\n<p>From a vessel ops perspective, if the crew&#8217;s story of taking the drugs on board at sea, there is no way the ship&#8217;s captain could not have know at some point that &#8220;it was stopped at sea.&#8221;  If the captain knew, then the ship&#8217;s operator would have know as well.  The bridge&#8217;s telegraph keeps a written log of all engine room transactions, and this log is reviewed by the company operating the ship.</p>\n<p>From a commercial point of view and as one person has claimed; if the drugs were loaded on shore; why would the crew have any knowledge at all of the cargo.  The crew would never open any cntrs on board unless in an emergency.  All they have to go on is what is written in the ship&#8217;s manifest.  So how would they know about the drugs in the first place?  They would not know, is the answer.</p>\n<p>My money is this is a systemic trafficing operations.</p>\n",
    "parent": 0
  },
  {
    "id": 411013,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "",
    "date": "2019-06-22T09:13:00",
    "content": "<p>Willy you might be interested to know that during my cruise ship service we dived and swept the underwater hull while in port.  There were cases of limpets being found on the hulls of vessels.  Rykehaven is no doubt correct it is a very strange story, one noted the crew names seem to be Serbo-Croat a language which is spoken by my in-laws family. </p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 411011,
    "author": "Rykehaven",
    "authorUrl": "",
    "date": "2019-06-22T04:36:18",
    "content": "<p>Occam&#8217;s Razor dictates that 16-30 tons of cargo was not transferred at sea, but was transferred as part of routine onloading in port.  Logic also dictates that the operator was complicit.  It is also a simple case that the crew were given a prepared story in case they got caught &#8211; and would be thus given full legal support in the event of being arrested; it&#8217;s normal procedure for drug cartels and their mules.</p>\n<p>All and all, not so &#8220;Bizzare&#8221;, except to the uninitiated.</p>\n<p>The crew are lying, and in lying to protect their superiors from sanction, their families get paid while they take the heat and do time.</p>\n",
    "parent": 0
  },
  {
    "id": 411005,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-06-21T14:22:18",
    "content": "<p>Yup very weird to be loading the ship out of port.  To me it seems like it would be easier to have some form of submarine type barge that would attach itself to a hull.  Stay there until what ever ship got close to its destination. let go and be retrieved at a later date.</p>\n<p>But it is just my opinion that my warped imagination came up with.</p>\n",
    "parent": 0
  },
  {
    "id": 411002,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-06-21T11:02:35",
    "content": "<p>Even though MSC is the second largest container ship operator in the world, MSC appears to actually own and operate very few ships. The MSC Gayane and MSC Desiree, the two ships on which cocaine was seized in the past few months in Philadelphia, are both owned and managed by the Norwegian SinOceanic Shipping. SinOceanic owns container ships which it puts on long-term charters and also operates a ship management firm based in Bermuda. </p>\n<p>The increasingly compartmentalized nature of shipping makes it a bit easier to understand how crews employed by a third party ship manager might be targets for recruitment by smugglers.</p>\n",
    "parent": 410999
  },
  {
    "id": 410999,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "",
    "date": "2019-06-21T10:18:34",
    "content": "<p>It was with a high degree of amazement that one read this post.  Once again a MSC vessel was in the negative maritime news.  It seems both the passenger and cargo vessels of this Swiss based company cannot stay out of trouble.<br />\nIn the bookcase beside my desk is a book &#8220;Golden Stripes, leadership on the high seas&#8221; by Captain V.S. Parani.  This highly educated gentleman from the Andaman Islands obtained his first command at age 29 and is currently a Senior Executive with MSC and even has a ship named after his family by that company.  His book lays out a leadership protocol for a modern vessel and in my opinion is very much from an Asian point of view.  My training was in the British Merchant Navy Apprenticeship practical method, rather different from CAPT. Parani&#8217;s protocol, which was applied to a 50 year career at sea from Cadet to Master.<br />\nOne has to wonder therefore at the selection and behavior of the international crews and operations of MSC apparently following CAPT. Parani&#8217;s protocols.  It should be of great concern to fellow mariners and maritime authorities that considering the size of current vessels having some 8000 persons aboard in the case of passenger vessels and the huge container ships with only minimum crews to mann them that this pattern of negative maritime incidents is all too regularly occurring in MSC.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  }
]