[
  {
    "id": 441491,
    "author": "Rosemary Soule",
    "authorUrl": "",
    "date": "2025-03-28T14:46:10",
    "content": "<p>It&#8217;s a beautiful thing! Instead of destroying or dismantling this ship, put it to use. The coral reef that protect the coastline and give us beauty and homes for many different species of fish</p>\n",
    "parent": 0
  },
  {
    "id": 441467,
    "author": "Ian Roy Worrell",
    "authorUrl": "",
    "date": "2025-03-25T23:38:39",
    "content": "<p>Even if she were just cosmetically restored for the 260th birthday of America, and then had landfill placed around her, to make her into a land based building of sorts, that would be more acceptable than sinking her and restricting access yto just divers.</p>\n",
    "parent": 0
  },
  {
    "id": 441466,
    "author": "Ian Roy Worrell",
    "authorUrl": "",
    "date": "2025-03-25T23:34:12",
    "content": "<p>Everyone should write to the President of the United States and ask why American tax dollars are spent on a regular basis to preserve the former British ship QUEEN MARY, but the United States is facing total loss. With the 250th birthday of America approaching ,this is most un-acceptable.</p>\n",
    "parent": 0
  },
  {
    "id": 441465,
    "author": "Ian Roy Worrell",
    "authorUrl": "",
    "date": "2025-03-25T23:31:54",
    "content": "<p>I have written to the President of the United States and asked him to take some kind of action to preserve the ship at least cosmeticallly. It is a damned shame that American tax payer dollars are spent to save the former BRITISH LINER, QUEEN MARY, while the United States is facing total loss. Especially with the 250th birthday of America fast approaching. Perhaps if enough people were to write to the President and Gov. Ron Desantis, the ship could be saved. She is the last remaining symbol of America&#8217;s once proud and mighty passenger maritime heritage. America, was born because of maritime adventure.</p>\n",
    "parent": 0
  },
  {
    "id": 441397,
    "author": "J.R.M.",
    "authorUrl": "",
    "date": "2025-03-20T18:33:35",
    "content": "<p>The conservancy dropped the ball by allowing the ship to sit in Philly and deteriorate all these years. The longer something is neglected, the more it takes to restore (house, building, car, ship, etc.). It&#8217;s really a shame that so few people even knew this was happening until it was too late to do anything about it. I would love to see it as a museum or event venue. Sadly, that would take a lot of money that no one is willing or able to spend. I think Okaloosa County saw a cheap, easy way to make money off it. I&#8217;m not convinced that there are all that many divers who will travel across the country or globe to dive it. Seems dangerous to me. It wouldn&#8217;t hurt my feelings if Okaloosa County loses their shirt over this project. An artificial reef is merely a more palatable way of saying &#8220;pollute the Gulf&#8221;. She is now sitting in my home state to be prepared for sinking. Tourists have been flocking to Mobile the past couple of weeks to see her one last time. Sad ending. I wasn&#8217;t born yet when the USS Alabama was saved from the scrap yard after WWII and brought to its permanent home in Mobile, AL. However, it&#8217;s widely known here that school kids sent in their coins to help cover the cost of towing back to Alabama. Obviously, it didn&#8217;t cost nearly as much to do something in that era. My point is that people cared about saving history. Now, not so much. Just my 2 cents worth. I&#8217;m not a billionaire, just a working class guy with a love for history.</p>\n",
    "parent": 0
  },
  {
    "id": 441360,
    "author": "Harry Prothero",
    "authorUrl": "",
    "date": "2025-03-17T21:11:17",
    "content": "<p>The time for a refurbishment was 30 years ago when she was first brought into Philadelphia and left to rot there. She is way beyond saving. It&#8217;s the scrapyard or a reef for her. Those asking President Trump to save her are wasting their time. We are trying to cut unnecessary expenses (DOGE) and don&#8217;t need a $ billion plus to save a ship that&#8217;s way past her life. She&#8217;s lucky she wasn&#8217;t scrapped years ago. A reef is a very good end for such a grand lady. Now the only question is where to sink her and in how deep water. You want to make her safe for navigation but accessible for many divers.</p>\n",
    "parent": 0
  },
  {
    "id": 441331,
    "author": "OneHeartDove",
    "authorUrl": "",
    "date": "2025-03-12T21:05:45",
    "content": "<p>A lot of World war I and two ships are either gone or been turned into museums. It would be nice if the SS United States could be saved but hopefully everything goes well and it can turn into a refuge for the fish that really need it.</p>\n",
    "parent": 0
  },
  {
    "id": 441330,
    "author": "Peter Buckley",
    "authorUrl": "http://none",
    "date": "2025-03-12T19:45:08",
    "content": "<p>Less start thinking about it great to say let sink this really big ship as the most richest country in the world and technology and a we can do attitude that might be questionable and all we can think of is for the ship to be sunk off the cost as a artificial reef and for divers can enjoy exploring it just a few people might do a little research would start realization that we have enough sinking ships in the world oceans doing form world wars and apparently from cheapest way to get rid of others ships including military one so far it&#8217;s looking like let&#8217;s see we can sink even bigger ships maybe a aircraft carrier what a great reef that would make and the divers would love it what a novelty idea and while we are at it we can make the oceans a bigger garbage dumpster that we have already have we have dumped some the most damaging toxic materials in the oceans plastics are killing the oceans slowly and not mention about what it&#8217;s doing to the polluters us the people  but who cares so let&#8217;s just keep sinking ships in the oceans (OUT OF SIT OUT OF MINE).</p>\n",
    "parent": 0
  },
  {
    "id": 441329,
    "author": "Yvonne Bagaman",
    "authorUrl": "",
    "date": "2025-03-12T19:34:14",
    "content": "<p>It is sad to see that this beautiful ship will be sunk.<br />\nBut considering the other option, a scrap yard, I would rather see her become a reef for many fish to call home.<br />\nShe is a beautiful ship; even unkempt as she is, she has style. Cruise ships look like floating casinos now, no grace to their lines.</p>\n",
    "parent": 0
  },
  {
    "id": 441328,
    "author": "Mike Kasdorf",
    "authorUrl": "",
    "date": "2025-03-12T19:10:18",
    "content": "<p>Every ship has its day. They have had over 40 years to make It happen to this ship. Look to the future.  Build a new  ship named the US. This ship han have  a second life that will support sea life, act as a new reef and promote tourism</p>\n",
    "parent": 0
  },
  {
    "id": 441327,
    "author": "Phillip R Kaspar",
    "authorUrl": "",
    "date": "2025-03-12T18:46:03",
    "content": "<p>At Second Thomas shoal</p>\n",
    "parent": 0
  },
  {
    "id": 441326,
    "author": "Phillip Kaspar",
    "authorUrl": "",
    "date": "2025-03-12T18:42:19",
    "content": "<p>The SS United States should be used for diplomacy given to the Philippines to be parked next to the BRP Sierra Madre. It should be forever parked and manned as a outpost of the Republic she represents as a diplomatic message to tyrants in Aisa.</p>\n",
    "parent": 0
  },
  {
    "id": 441324,
    "author": "Pieter L.Bezemer",
    "authorUrl": "http://Accu%20ll%20Development%20Corporation",
    "date": "2025-03-12T14:47:24",
    "content": "<p>Our family emigrated from Holland to Canada&#8230;via South Hampton UK and Ellis Island on this awesome ship April,1953</p>\n",
    "parent": 0
  },
  {
    "id": 441322,
    "author": "Scott Ballschmieder",
    "authorUrl": "",
    "date": "2025-03-12T12:09:56",
    "content": "<p>There comes a time where it very important to save our history and that time is now this beautiful ship that&#8217;s perfectly sea worthy is going to be scuttled and sunk in the gulf of America and if you ask me its a waist of a perfectly good ship it&#8217;s retro world War 2 vintage and its the fastest ship to cross the Atlantic Ocean she&#8217;s sitting in the ocean perfectly level and in her hull is bone dry no leaks she needs a good blasting and primer and paint she transported our troops and had to be painted over then and out ran the U boats from Germany I want to see her preserved more than half her weight is alu.inum what ship of her size can go 50mph none a small town in California can save the queen Mary and our own country isn&#8217;t restoring our flag ship it&#8217;s a total disgrace she won&#8217;t take long to restore wake up America WAKE UP&#8230;..</p>\n",
    "parent": 0
  },
  {
    "id": 441319,
    "author": "John Bianchi",
    "authorUrl": "",
    "date": "2025-03-12T09:43:24",
    "content": "<p>We need to be real about this. It was sad to see her deteriorating at the dock in Philly,talk is cheap about refurbishing. Rather than scraping her I think it makes sense to turn her into a reef and a habitat for sea life. Also anyone who drives on her can enjoy her for all time. There are many historical ships in the ocean sadly not many of them can be seen by divers.</p>\n",
    "parent": 0
  },
  {
    "id": 441298,
    "author": "Vince Martell",
    "authorUrl": "http://Vince%20Martell.com",
    "date": "2025-03-10T22:31:44",
    "content": "<p>Save This Great American Icon of American ingenuity and perfection.vSink something else. Do not desecrate this great example of American Engineering! This Great Ship Represents to many Americans our History!  It. Still holds the World Speed Record for crossing the Mighty Atlantic Ocean, the coveted Blue Riband! The people who have sailed on Her is a Who&#8217;s Who of American Theatre and Culture! Marlon Brando, Marilyn Monroe, John Wayne, President Harry Truman and Mrs Truman, President Dwight D.Eisenhower and Mrs Eisenhower, Cary Grant, Carlton Heston, Gary Cooper, Katherine Hepburn, Lawrence Olivier, Red Skeleton and many more!  Save This Great American Ship!</p>\n",
    "parent": 0
  },
  {
    "id": 441268,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2025-03-07T19:25:42",
    "content": "<p>Robby, what do you suggest? The SS United States has not been in service for 56 years and now there is effectively nothing left to save. The interior has been gutted. The power plant is trashed. The hull has suffered from a half century of rust. Six owners attempted to either restore the ship as cruise ship or as a dockside facility. All failed. Since she was moved to Philadelphia in 1996, docking costs alone have exceeded $20 million. Estimates to put the ship back into service are over $1 billion. Will you write that check?</p>\n",
    "parent": 441267
  },
  {
    "id": 441267,
    "author": "Robby harverson",
    "authorUrl": "",
    "date": "2025-03-07T12:04:06",
    "content": "<p>It&#8217;s a disgusting desecration of America to destroy desecrate a iconic American ocean liner in post I have seen whear destruction actions for a historic ship is a 20 yrs sentence I hope all involved who raise a cutting tool or saw or pump to destroy desecrate the ship gets a full sentence</p>\n",
    "parent": 0
  },
  {
    "id": 441265,
    "author": "Richard (Dick) Wilkens",
    "authorUrl": "",
    "date": "2025-03-07T10:25:54",
    "content": "<p>Certainly the end of an era.  I worked for Farrell Lines (another U.S. flag operator) in Norfolk, VA during the 80s, 90s and beyond and had the pleasure of seeing her daily during her stay at Norfolk International Terminals.  Marine life and divers will love her as well when see finally rests.</p>\n",
    "parent": 0
  }
]