[
  {
    "id": 417522,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-11-11T06:46:13",
    "content": "<p>@Phil The keel is lead weighted, my previous boat had an iron keel bolted on and it was a constant maintenance problem. It was one of the reasons I chose a boat built at the transition period to grp where they hadn&#8217;t started messing with weight reduction by using less material.</p>\n",
    "parent": 0
  },
  {
    "id": 417512,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-11-10T18:22:32",
    "content": "<p>Jean,</p>\n<p>Even encapsulated keels have their own problems!</p>\n<p>If your boat has an encapsulated iron keel, don’t get lulled into believing that you are completely free of keel worries. Although you are generally better off than sailors with exposed iron keels, you still have to carry out routine maintenance and inspection, and be aware of the warning signs of water intrusion, which could lead to bigger problems.<br />\n<a href=\"https://www.practical-sailor.com/blog/caring-for-encapsulated-ballast-keels-2\" rel=\"nofollow ugc\">https://www.practical-sailor.com/blog/caring-for-encapsulated-ballast-keels-2</a></p>\n",
    "parent": 0
  },
  {
    "id": 417505,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-11-10T12:15:37",
    "content": "<p>@Capt.JVC<br />\nChasing after wildlife and poking it repeatedly with a pointy thing just for the heck of it is a bad thing to do and could see you in a lot of trouble depending on where you are.</p>\n",
    "parent": 0
  },
  {
    "id": 417504,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-11-10T12:11:04",
    "content": "<p>Moral of the story: Sail in a slow yacht with an encapsulated keel. My Nicholson 32 is ideal.</p>\n",
    "parent": 0
  },
  {
    "id": 417501,
    "author": "Capt. J. Vincent Collins",
    "authorUrl": "",
    "date": "2020-11-10T09:12:43",
    "content": "<p>Easily differentiated from a shark, the long floppy dorsal flops back and forth like a broken windshield wiper.<br />\nAlthough they appear to be slow and lazy they can actually swim very fast, are surprisingly agile and can breach leaping into the air several feet.<br />\nI observed this several times when swordfishing on harpoon boats here in New England.<br />\nI came across a small sunfish (about 400 lb) that swam into Sakonnet Harbor RI.<br />\nI was following it around the basin in my 20 foot center console. I poked at it a few times with a boat pole when all of a sudden it breached, coming out of the water about 6 feet and then swam away very quickly.</p>\n<p>Without a doubt one of the strangest designs nature has come up with.</p>\n",
    "parent": 0
  },
  {
    "id": 417500,
    "author": "Peter Bradford",
    "authorUrl": "",
    "date": "2020-11-10T09:06:40",
    "content": "<p>I saw one in Cape Cod canal! No mistaking it fir sure.  A big flat disk in the water with fins!!  An unusual large creature !!</p>\n",
    "parent": 0
  },
  {
    "id": 417497,
    "author": "Allan Smith",
    "authorUrl": "",
    "date": "2020-11-10T08:02:08",
    "content": "<p>WTF!?. I have been sailing the Caribbean these past four years and all I really worried about was half sunken cargo containers. Until now. Not telling the wife</p>\n",
    "parent": 0
  }
]