[
  {
    "id": 413014,
    "author": "Jim Scheld",
    "authorUrl": "",
    "date": "2019-12-12T19:20:21",
    "content": "<p>In his book, Castles of Steel,  Massie claims that the Royal Navy had a pretty good handle on the WW 1 German Navy code.  He claimed it was a failure to pass on to Jellicoe and Beatty critical German ship movement information that led to the Royal Navy&#8217;s failure to meet the German as a combined force.</p>\n",
    "parent": 0
  },
  {
    "id": 412983,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-12-10T11:18:24",
    "content": "<p>Trying to read the tea leaves of history can be fascinating. A good argument can be made for believing that Spee was tricked into attacking the Falklands. On the other hand, Spee appeared to be acting opportunistically and had just won battles at Papeete and Coronel. He could have simply blundered into an attack on the Falklands wanting to add another victory on his way home.</p>\n",
    "parent": 0
  },
  {
    "id": 412979,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2019-12-10T04:33:20",
    "content": "<p>In background for his book,  Bodyguard of Lies,  Anthony Cave Brown goes through a whole litany of reasons British intel didn&#8217;t share what they knew mostly to avoid leaks that they had broken the Germans naval code.  While he does not mention the Falklands specifically, he does consider the WWI code breaking a key to the later successes in WWII.  Morison calls it the second biggest mistake in naval history because Admiral Spee had no reason to go near the Falklands on his way home.  Not really sure what Morison considered the first biggest mistake?</p>\n",
    "parent": 0
  },
  {
    "id": 412974,
    "author": "John Paul Jones",
    "authorUrl": "",
    "date": "2019-12-09T12:57:32",
    "content": "<p>Correction. The last line of my previous comment ought to name Sturdee as kept in the dark by the Admiralty.</p>\n",
    "parent": 0
  },
  {
    "id": 412973,
    "author": "John Paul Jones",
    "authorUrl": "https://law.richmond.edu/faculty/jjones/",
    "date": "2019-12-09T12:53:03",
    "content": "<p>In his essay at the Wavell Room, Reflections on the Battle of Jutland, <a href=\"https://wavellroom.com/2019/11/28/reflections-battle-jutland-broad-questions-from-a-narrow-selection-of-the-secondary-literature/\" rel=\"nofollow ugc\">https://wavellroom.com/2019/11/28/reflections-battle-jutland-broad-questions-from-a-narrow-selection-of-the-secondary-literature/</a>, Ralph Hitchens wrote recently that, “by the spring of 1916 the Royal Navy was reading the verbatim text of German naval wireless traffic.” He does not offer to prove this, but it seems to be widely agreed. That the Admiralty withheld Hipper’s escape route from Jellicoe for reasons of OPSEC suggests a plausible explanation for why the Admiralty kept in the dark about Von Spee’s approach to the Falklands.</p>\n",
    "parent": 0
  }
]