[
  {
    "id": 412739,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-13T16:45:05",
    "content": "<p>Willy,</p>\n<p> I&#8217;ll be dead by the time it happens, so who cares?<br />\nWhen our sun explodes in a few billion years, we better be on another planet far, far, far away, or it won&#8217;t matter.</p>\n<p>In billions of years our black hole in the Milkyway may swollow us up anyway.</p>\n",
    "parent": 0
  },
  {
    "id": 412723,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-11-12T18:06:41",
    "content": "<p>As a kid I used to think I was born in the wrong time.  That I should have been able to see the radical ideas of the turn of the century.  Yet we live in a world that is far grander than that of the 19th century.  The computer/internet age is far more interesting.  No I dont put any belief in cold fusion.  I dont see people becoming unemployed on the &#8220;if&#8221;.  If it did happen?  People are slow to change.  Some will grasp at the new immediately.  Yet history is filled with change that takes decades to occur.</p>\n<p>Maybe it will happen.  Who knows.  Yet we arent out of power yet.  Super science isnt quite here yet.  Yet it is interesting to see what pipe dreams abound.</p>\n",
    "parent": 0
  },
  {
    "id": 412718,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-12T16:32:06",
    "content": "<p>Sorry:</p>\n<p>Should read &#8220;All the patents that Edison filed, he either stole or bought!</p>\n",
    "parent": 0
  },
  {
    "id": 412717,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-12T16:27:24",
    "content": "<p>IF, IF, it worked, the government would never allow it&#8217;s use. Why, it would cost power companies money and put many out of work from coal, gas, nuclear rod makers, nuclear mines would close as well as coal mines, drilling rig operators and all the workers.</p>\n<p>Almost anyone can file a patent, even if it shows a small bit of the ability to work.</p>\n<p>All the parents To. Edison filed, he either stole or bought!</p>\n",
    "parent": 0
  }
]