[
  {
    "id": 411607,
    "author": "Kyle Stubbs",
    "authorUrl": "",
    "date": "2019-07-25T13:31:08",
    "content": "<p>I find it interesting that the Mallows Bay ghost fleet gets widespread recognition, yet several other sites of abandoned WWI surplus Ferris and related-type ships never get mentioned.</p>\n<p>At Everett, Washington, half a dozen of the probably most intact surplus ships form a breakwater at the mouth of the Snohomish River.</p>\n<p>Near Gig Harbor, Washington, at least a dozen were burned, with their remains still visible in the sand at the mouth of Minter Creek.</p>\n<p>At Orange, Texas, at least another dozen were burned, still visible in the Sabine River on the backside of Pavell Island.</p>\n<p>At Baltimore, Maryland, another dozen are still visible where they were sunk as a breakwater at the mouth of Curtis Bay.</p>\n<p>The provenance is a little less clear in other cases, but similar &#8220;ghost fleets&#8221; that may descend from the Emergency Fleet also exist at Portland and Astoria, Oregon, a couple of locations on San Francisco Bay, on the James and Elizabeth Rivers in Virginia, Tottenville, NY and at Portland, Maine among, I would imagine, many other locations.</p>\n",
    "parent": 0
  },
  {
    "id": 411521,
    "author": "glenwood weather",
    "authorUrl": "https://www.glenwoodwashington.info",
    "date": "2019-07-21T09:34:01",
    "content": "<p>Thank you for this history.  I am really enjoying learning about the Ghost Fleet of Mallows Bay.</p>\n",
    "parent": 0
  },
  {
    "id": 411519,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-07-21T08:52:48",
    "content": "<p>Thanks for the information. the pics in the previous post were excellent.<br />\nWe still have our own Liberty Ship remains at the mouth of the river Medway in the Thames estuary. The Robert Montgomery is monitored regularly because much of her cargo of munitions is still in her holds and it is not considered safe to remove them.</p>\n",
    "parent": 0
  }
]