[
  {
    "id": 414126,
    "author": "Bob Koski, ABECS(AW), USN",
    "authorUrl": "",
    "date": "2020-04-06T23:45:30",
    "content": "<p>I&#8217;m a retired Navy Senior Chief (ABECS(AW)USN, Ret.).  Over the course of a 20 year Active Duty career, I served onboard five different carriers.  One of my proudest tours was onboard the Pre-Commissioning Unit of the USS Theodore Roosevelt.  I was on the Catapult Test Team that certified her for aircraft ops.  I am a Plankowner, and what&#8217;s more, I was one of the first (and last) of her first crew to be initiated at sea as a Chief Petty Officer.  </p>\n<p>I am sickened to imagine what the Command Climate onboard what once was America&#8217;s Big Stick must have sunk to since Captain Crozier took command.  His actions are so far over the top of what is acceptable for anyone that high up in the chain of command, I am amazed that he was able to politic his way into command of one of America&#8217;s most major assets.</p>\n<p>Just the fact that his four page screed made it into the pages of his home-town newspaper, the San Francisco Chronicle, before his own onboard two star Admiral had a chance to comment on it says all I need to know about his qualifications for command at sea.</p>\n<p>I also fully support SecNav&#8217;s comments to both the crew and about the Captain.  Either Crozier was too stupid or to naive to be in command of a carrier.  </p>\n<p>The damage he has done will take years to repair.</p>\n",
    "parent": 0
  },
  {
    "id": 414113,
    "author": "Hal Weiner",
    "authorUrl": "",
    "date": "2020-04-06T09:56:35",
    "content": "<p>I totally agree with Doug Bostrom&#8217;s entry above&#8230;. This is NOT the Navy I served in&#8230;&#8230;&#8230; that&#8217;s what happens when you put cohorts of the Commander in Thief in charge of the military and get rid of generals and admirals like General McMasters and Admiral Stavrides who don&#8217;t have their heads up their butts. And replace them with sycophants who are gonna suck up to him for an extra star on their shoulder before retirement. If I were a parent of a sailor on the Roosevelt I would Kiss Capt Crozier&#8217;s butt in Times Square. He deserves a medal, not a reprimand. Tragically he has tested positive for the virus.</p>\n",
    "parent": 0
  },
  {
    "id": 414110,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-04-05T23:09:15",
    "content": "<p>Chain of command doesn&#8217;t work when there are carpetbaggers at the top. And at this late date, it&#8217;s nearly all opportunists &#8220;in charge.&#8221;</p>\n",
    "parent": 0
  }
]