[
  {
    "id": 418916,
    "author": "Boca Jim",
    "authorUrl": "",
    "date": "2021-01-05T20:53:08",
    "content": "<p>There was no year zero. A century has 100 years, from 1 to 100. The first century started at the year 1 ad, and ended at the end of the year 100 ad. The second century started with the year 101 ad. Accordingly, the last year on the 19th Century was 1900, not 1899. The first year of the 20th Century was 1901, not 1900.</p>\n",
    "parent": 0
  },
  {
    "id": 418865,
    "author": "Bill Ramsden",
    "authorUrl": "",
    "date": "2021-01-04T13:36:11",
    "content": "<p>At the north pole, there are no east or west only north and south. North is straight down and all directions to the side are south. Time still exists with the 24 hour clock overhead, marked by the noon sun constantly rotating around the horizon.</p>\n",
    "parent": 0
  },
  {
    "id": 418795,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2021-01-01T13:27:08",
    "content": "<p>Interesting post and perspective on time and cardinal direction. It’s all relative, as far as I can see.</p>\n<p>“Time is but the stream I go a-fishing’ in.”</p>\n",
    "parent": 0
  },
  {
    "id": 418789,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-01-01T09:04:59",
    "content": "<p>Thankyou for the clarifications</p>\n",
    "parent": 0
  },
  {
    "id": 418786,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2021-01-01T07:43:33",
    "content": "<p>Willy, that is the Magnetic North Pole which indeed moves and at some point will change places with the south pole which will make things difficult for migrating species.In 1900 it was 1200 nm, 080deg from the Geographical North Pole, in 2020 it was 400nm, 180deg moving at about 30nm per year.It is not to be confused with the Geomagnetic North Pole which is the theoretical position from a model of the Earth&#8217;s magnetic field. It is about 1100nm, 075deg from the Geographical North Pole</p>\n<p>Weeman talks about the Geographic North Pole which is a theoretical point on a straight line running through the North and South Poles which the earth rotates on based upon the shape of the earth which is not terribly symetrical being an oblate spheroid whose shape changes with the continual upheaval of plate tectonics and the gravitational effect of the sun, moon and planets all pulling in different directions but very occasionally all together at the same time.The line does not run through the actual centre of the Earth due to this continually change of shape</p>\n",
    "parent": 0
  },
  {
    "id": 418785,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2021-01-01T07:07:11",
    "content": "<p>@Willy haha 🙂<br />\nBy the way, its the magnetic pole that is shifting but I expect you meant that.<br />\nAt least we in UK don&#8217;t have to worry about variation for a short while.</p>\n",
    "parent": 0
  },
  {
    "id": 418777,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-31T17:29:27",
    "content": "<p>It should also be reported that tthe north pole has moved its location.  Airports set their runways by the degrees of a compass.  It was noted recently that the north pole has shifted its location.  When this happened airports realized they needed to realign their runways with their new true heading.</p>\n",
    "parent": 0
  }
]