[
  {
    "id": 413446,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-02-05T17:08:55",
    "content": "<p>Google NEWS search: Mini iceage</p>\n<p>Scientist Warns Of Mini Ice Age As Sun Hibernates During Solar Minimum</p>\n<p><a href=\"https://www.ibtimes.com/scientist-warns-mini-ice-age-sun-hibernates-during-solar-minimum-2915068\" rel=\"nofollow ugc\">https://www.ibtimes.com/scientist-warns-mini-ice-age-sun-hibernates-during-solar-minimum-2915068</a></p>\n",
    "parent": 0
  },
  {
    "id": 413444,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-02-05T16:45:19",
    "content": "<p>Short video: World of Change: Global Temperatures, NASA<br />\nWith article.<br />\n<a href=\"https://earthobservatory.nasa.gov/world-of-change/global-temperatures\" rel=\"nofollow ugc\">https://earthobservatory.nasa.gov/world-of-change/global-temperatures</a></p>\n",
    "parent": 0
  },
  {
    "id": 413436,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-02-04T20:24:29",
    "content": "<p>Yup its warming.  And scientists are wasting dollars trying to tell us that we already know it is happening.  Not in denial.  We just dont need some one to say what we already know</p>\n",
    "parent": 0
  },
  {
    "id": 413435,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-02-04T14:23:33",
    "content": "<p>I know that this is a waste of time. Deniers are going to deny or ignore the facts to buy into their own crackpot notions. Nevertheless&#8230;</p>\n<p><a href=\"https://climate.nasa.gov/scientific-consensus/\" target=\"_blank\" rel=\"noopener noreferrer nofollow ugc\">Scientific Consensus: Earth&#8217;s Climate is Warming</a></p>\n",
    "parent": 0
  },
  {
    "id": 413434,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-02-04T14:21:17",
    "content": "<p>Take a glass of water.  Fill said glass with water to near the top.  Gently put a ice cube in that glass of water.  Did you get a quarter inch of elevation change?  I am guessing the water only raised about a thirty second of an inch.  Anyone remember this science project in school?  That full glass of water with an ice cube?  That the water level lowered when the cube melted.  Amazing how scientists are willing to overlook that part of tthe story here.</p>\n<p>The oceans are vast.  The glacier is tiny in comparison to the ice cube in the glass of water.  The glacier will drop in.  Then the scientists will go and scream the sky is falling about another glacier.  Yet that 10 foot of elevation will become redereck with chest beating and other bits of manure.</p>\n",
    "parent": 0
  },
  {
    "id": 413433,
    "author": "John",
    "authorUrl": "",
    "date": "2020-02-04T14:16:07",
    "content": "<p>Nothing to do with the 138 volcanoes under Antartica identified by scientists, but not mentioned on the BBC? Link here: <a href=\"https://sp.lyellcollection.org/content/specpubgsl/461/1/231.full.pdf\" rel=\"nofollow ugc\">https://sp.lyellcollection.org/content/specpubgsl/461/1/231.full.pdf</a>  Abstract:The West Antarctic Ice Sheet overlies the West Antarctic Rift System about which, dueto the comprehensive ice cover, we have only limited and sporadic knowledge of volcanic activityand its extent. Improving our understanding of subglacial volcanic activity across the province isimportant both for helping to constrain how volcanism and rifting may have influenced ice-sheetgrowth and decay over previous glacial cycles, and in light of concerns over whether enhanced geo-thermal heatfluxes and subglacial melting may contribute to instability of the West Antarctic IceSheet. Here, we use ice-sheet bed-elevation data to locate individual conical edifices protrudingupwards into the ice across West Antarctica, and we propose that these edifices represent subglacialvolcanoes. We used aeromagnetic, aerogravity, satellite imagery and databases of confirmed volca-noes to support this interpretation. The overall result presented here constitutes afirst inventory ofWest Antarctica’s subglacial volcanism. We identified 138 volcanoes, 91 of which have not previ-ously been identified, and which are widely distributed throughout the deep basins of West Antarc-tica, but are especially concentrated and orientated along the &gt;3000 km central axis of the WestAntarctic Rift System</p>\n",
    "parent": 0
  },
  {
    "id": 413432,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-02-04T14:10:39",
    "content": "<p>Australia burned.  Increasing the carbon in the air worse than man would do in 5 years.  There will be fires.  They will warm the atmosphere more than man does.  Yet scientists say it is the cause of using internal combustion as the leading source of climate change.  </p>\n<p>It is going to happen no matter what.  It doesnt matter that builders have found a way to cool the earth if we really wanted.  In Salt Lake City Utah, the city decided that they wanted to stretch a black fabric some 30 feet above the surface of a park.  They found that this mere fabric was able to lower the temperature in that area of the city by 10 degrees F.  Where is the story in that?  Forgotten as it is more important for the &#8220;professionals&#8221; to scream that we arent doing anything.</p>\n<p>The situation is that people are not scientists and dont want to be scientists.  People enjoy a warmer earth.  All this chest beating of we must act now to save the earth.  It is falling on deaf ears.  </p>\n<p>Yup the glacier will fall into the see someday.  Yet man wont cease to exist because of it.  To have a glacier drop into the ocean, of which is no longer in the ocean according to above.  It will happen.</p>\n<p>Tho I tend to think when it does?  It will probably maybe an eighth of an inch of sea level rise.  Not the spouted 10 feet.  Just my opinion.</p>\n",
    "parent": 0
  },
  {
    "id": 413431,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-02-04T13:57:04",
    "content": "<p>At this point in our history, the denial of climate change and of science is just dumb.</p>\n",
    "parent": 0
  },
  {
    "id": 413430,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2020-02-04T11:29:35",
    "content": "<p>I would just say that once, bleeding patients was the sovereign cure; phrenology was a &#8216;settled science&#8217;; the earth was flat; the sun orbited the earth;  the gods resided on Olympus.  All these irrefutably true.</p>\n<p>No doubt the glacier melts, no doubt the water is warmed by volcanic action on the ocean floor, no doubt this is all in the natural order of things, no doubt Monsanto and Dupont made a killing off banning refrigerants; and the hundreds of thousands of dead, victims of mosquito borne disease are grateful for the wisdom in banning DDT.  Engineering is real, science is<br />\na political football.</p>\n",
    "parent": 0
  },
  {
    "id": 413429,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-02-04T10:18:09",
    "content": "<p>What is nonsense is denying the settled science. Denial ain&#8217;t just a river in Egypt.</p>\n",
    "parent": 413428
  },
  {
    "id": 413428,
    "author": "Paul",
    "authorUrl": "",
    "date": "2020-02-04T09:07:32",
    "content": "<p>It’s all nonsense&#8230;the planet weather cycles &#8211; ice ages, warming, ice age, etc&#8230;</p>\n<p>A whole industry of climate change has formed&#8230;it is a cult&#8230;nothing man does affects the weather&#8230;if he could, he certainly would affect the weather, stopping hurricanes, drought etc</p>\n",
    "parent": 0
  },
  {
    "id": 413426,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2020-02-04T08:31:28",
    "content": "<p>Its hard to digest the figures e.g.:<br />\n&#8220;As warmer water pools underneath the glacier, it can hollow it out from beneath. Researchers found exactly this situation at Thwaites last year, when they discovered a cavern two-thirds the size of Manhattan and nearly a thousand feet tall underneath the glacier.&#8221;<br />\nFrom &#8211; <a href=\"https://www.extremetech.com/extreme/305718-rising-seas-water-thwaites-glacier-grounding-line-above-freezing\" rel=\"nofollow ugc\">https://www.extremetech.com/extreme/305718-rising-seas-water-thwaites-glacier-grounding-line-above-freezing</a></p>\n",
    "parent": 0
  }
]