[
  {
    "id": 408673,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-12-31T20:15:38",
    "content": "<p>Bob, that is just stupid. You apparently believe the Orange Oaf&#8217;s lies about an immigration invasion, when in fact, cross-border immigration is at close to 50-year lows. You are apparently also unaware that more Mexicans have been leaving this country than entering for several years now. If you really cared about freeloaders you would oppose the shameless handouts to the wealthy by the Republicans. No one is opposed to border security. Most Americans, however, are opposed to wasting taxpayer money to build a border wall to feed the ego of a clown and a traitor.</p>\n",
    "parent": 408672
  },
  {
    "id": 408672,
    "author": "Bob Winfrey",
    "authorUrl": "http://www.shipmodelsuperstore.com",
    "date": "2018-12-31T19:56:32",
    "content": "<p>I call satire bull crap. If the Mexican government did a better job of taking care of their people they probably wouldn&#8217;t want to leave and get all the Freebies they get when they treck across the border with almost nothing to stop them. I am tired of my tax money being given away to the trash and free loaders on gubment programs. The coast guard does a great job at intercepting  the drugs and scumbags trying to get in by water but you can&#8217;t catch them all. We still need something on the border and not something that has to be redone in 3 or 5 years.</p>\n",
    "parent": 0
  },
  {
    "id": 408664,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2018-12-31T15:33:41",
    "content": "<p>Pathetic. Surreal is the right word, and you don&#8217;t need drugs for this experience, folks. My son spent thirteen years in the Coast Guard, the smallest and proudest of the services. To see the men and women in this vital branch being denied their pay as they continue to perform their duty with dedication and honor makes my blood boil.</p>\n",
    "parent": 0
  },
  {
    "id": 408661,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-12-31T11:11:52",
    "content": "<p>Trump is holding the government hostage over his needless vanity wall. The shutdown is on him. </p>\n<p>Claiming that Trump cares about anyone or anything other than himself is idiotic.</p>\n",
    "parent": 408659
  },
  {
    "id": 408659,
    "author": "glenwood weather",
    "authorUrl": "",
    "date": "2018-12-31T11:00:35",
    "content": "<p>President Trump stayed in Washington.  Congress left on vacation.<br />\nThe Coast Guard gets their scheduled paycheck for December.<br />\nWho really cares about the Coast Guard?</p>\n",
    "parent": 0
  },
  {
    "id": 408658,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-12-31T10:56:17",
    "content": "<p>Like Bass fishermen&#8217;s Catch and release!<br />\nGood for Job security too!</p>\n",
    "parent": 0
  },
  {
    "id": 408648,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-12-30T23:01:10",
    "content": "<p>Yeah, good luck on the drug sale.  Tho I wouldnt put it past Trump to try and do just that.</p>\n",
    "parent": 0
  },
  {
    "id": 408645,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-12-30T17:29:33",
    "content": "<p>Which leads on to the legalization of cannabis and the navies of the world on drugs patrols seizing dhows full of the stuff, maybe to sell on?</p>\n",
    "parent": 0
  },
  {
    "id": 408642,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-12-30T15:02:03",
    "content": "<p>News reports they get one last paycheck at the end of December.<br />\nTighten your belts!</p>\n<p>Got my USCG pension Friday plus a $30 dollar COLA raise.<br />\nNext month, ?</p>\n",
    "parent": 0
  }
]