[
  {
    "id": 426778,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-04-13T17:55:02",
    "content": "<p>I may have got that wrong.</p>\n",
    "parent": 0
  },
  {
    "id": 426777,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-04-13T17:53:01",
    "content": "<p>Of course everyone is totally honest about the contents of their box as we well know.<br />\nSo those who have declared their container of Rolex watches as scrap paper might be a bit miffed with themselves.</p>\n",
    "parent": 0
  },
  {
    "id": 426772,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-04-13T10:06:33",
    "content": "<p>Yes. Before attempting to pull the ship free, two clamshell dredgers worked to dig out the bow.</p>\n",
    "parent": 0
  },
  {
    "id": 426771,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-04-13T09:51:28",
    "content": "<p>Perhaps I missed a report was there a dredging operation before all this lightering was decided upon?  If so it appears to have been unsuccessful.</p>\n<p>There is very little experience in lightering in US ports and it will be an enormous expense.  No doubt a decision of desperation !!</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 426770,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-04-13T09:47:43",
    "content": "<p>A couple of points. GA assessments are proportional to the value of the cargo, so a container load of scrap paper pays a fraction of the assessment of that of a box loaded with flatscreen TVs.</p>\n<p>Also, many shippers buy GA insurance specifically to avoid the time and expense of litigation that follows most GA claims. Noy all GA claims hold up in court.</p>\n<p>Lastly, I am not an admiralty lawyer, so if I am getting any of this wrong, I will be happy to be corrected by someone who knows better.</p>\n",
    "parent": 0
  },
  {
    "id": 426760,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2022-04-12T19:43:29",
    "content": "<p>What a great concept. </p>\n<p>Further to total loss Rick mentions with its resulting return to &#8220;owners don&#8217;t pay,&#8221; I wonder if it&#8217;s been tested in court whether there&#8217;s a certain small fraction of successful recovery short of total loss below which owners of surviving cargo may get some kind of relief? </p>\n<p>In the extreme case, a single container from 10,000 being recovered could end up veering back into &#8220;unfair&#8221; for owners of that container&#8217;s contents?</p>\n",
    "parent": 0
  },
  {
    "id": 426759,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-04-12T18:34:03",
    "content": "<p>If the salvage ends in a constructive total loss, my understanding is that GA does not apply. When the container ship MV Rena ran aground and broke up off the coast of New Zealand, there was no declation of GA.</p>\n",
    "parent": 0
  },
  {
    "id": 426757,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-04-12T18:18:58",
    "content": "<p>So, under the third element, if they remove all the cargo but it still won&#8217;t budge and they have to cut up the ship general average does not apply?</p>\n",
    "parent": 0
  }
]