[
  {
    "id": 419684,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-02-08T14:44:21",
    "content": "<p>Thanks. Very interesting.</p>\n",
    "parent": 419663
  },
  {
    "id": 419663,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2021-02-07T12:58:31",
    "content": "<p>You all might like to read this useful addition</p>\n<p>Soon May The Wellermen Come. The song is not a sea shanty, (a shanty is a work song and only a work song in which there is a call and response and is used for hauling and heaving) Dates from around the 1860s; refers to the Wellermen and Joseph Weller one of the supply ships owned by the Weller Brothers who ran shore whaling stations on South Island New Zealand in the 1830s and 40s. Its chorus contains lines such as – “And bring us sugar and tea and rum,” &#8211; and illustrates the Weller Bros as major suppliers to the shore whaling stations, it relates as what today we would call a company song. The workers at these bay-whaling stations were not paid wages as such; they were paid in kind/slops, clothing, spirits, tobacco and other necessities of life, in the UK this would have been called tommy.<br />\nThe song was originally collected around 1966 by New Zealand-based music teacher, folk song collector and writer Neil Colquhoun and published in his book “Songs of a young country” Folkestone UK 1972 he had the song from one F. R. Woods. Woods, who was in his 80s at the time, he had heard the song, and another “John Smith A.B”, from his uncle. The latter was printed in a 1904 issue of “The Bulletin”, where it was attributed to one D.H. Rogers. It is possible that Rogers was the uncle of Woods, who worked as a young sailor/shore whaler in the early-mid 19th century and had composed both songs in his later years, eventually passing them on to his nephew as an old man.<br />\nThe song has been frequently sung in Folk Clubs and by sea shanty singers it is a sea song rather than a shanty and was never in the cannon of the sea shanty which is a deep water work song with call and refrain such as “Blow the man down” or “Serafina”.</p>\n<p>Chris Roche:</p>\n<p>I have edited corrected, collated and added to what I have found web wise, I am at a loss as to where I have put my copy of Neil Colquhoun`s book “Songs of a young country” published curiously enough  on the Bayle at Folkestone, Kent, UK. My home town also from where the Weller family migrated to Sydney Australia. For the record my Daughters married name is Weller a Kentish  name of long standing.<br />\nThe text given is the most complete that I have.</p>\n<p>Soon May The Wellermen Come</p>\n<p>There once was a ship that put to sea,<br />\nAnd the name of that ship was the Billy o&#8217; Tea.<br />\nThe winds blew hard, her bow dipped down,<br />\nBlow, me bully boys, blow. </p>\n<p>CH:\tSoon may the Wellermen come<br />\n        To bring us sugar and tea and rum,<br />\n        One day, when the tonguin&#8217; is done<br />\n        We&#8217;ll take our leave and go.</p>\n<p>We had not been two weeks from shore,<br />\nWhen down on us a right whale bore.<br />\nThe captain called all hands and swore,<br />\nHe&#8217;d take that whale in tow. </p>\n<p>Before the boat had hit the water,<br />\nThe whale&#8217;s tail came up and caught her.<br />\nAll hands to the side, harpooned and fought her,<br />\nWhen she dived down below. </p>\n<p>A line we dropped all in pursuit,<br />\nShe raised her tail, a last salute.<br />\nBut the harpoon lodged there&#8217;s no dispute,<br />\nShe dived down below.</p>\n<p>No line was cut, no whale was freed,<br />\nThe Captain&#8217;s mind was not on greed.<br />\nBut he belonged to the walerman’s creed,<br />\nShe took the ship in tow.</p>\n<p>For forty days, or even more,<br />\nThe line went slack, then tight once more.<br />\nAnd boats were lost (there were only four),<br />\nBut still the whale did go. </p>\n<p>As far as I know, the fight’s still on,<br />\nThe line’s not cut and the whale’s not gone.<br />\nThe Wellerman makes his regular call,<br />\nTo the Captain, crew, and all.</p>\n<p>Chris Roche <a href=\"http://www.capehorners.org\" rel=\"nofollow ugc\">http://www.capehorners.org</a> January 2021</p>\n",
    "parent": 0
  }
]