[
  {
    "id": 408918,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-01-14T01:58:12",
    "content": "<p>Calm down, Roger, that&#8217;s not the same study you&#8217;re talking about. </p>\n<p>As well, Nic Lewis played a bit part in that; most of the criticism of the Scripps analysis came from the mainstream scientific community, not the 3% who can&#8217;t cross the hurdle of 19th century thermodynamics. </p>\n<p>And as usual, we see that when there&#8217;s a significant problem with scientific conclusions they get sorted out by the most skeptical audience of all: other scientists practicing in their own disciplines. </p>\n<p>Willy&#8217;s remarks are &#8220;not even wrong,&#8221; as the old saying goes. Sounds like repetition of a recitation of a recap of a misunderstanding, losing information all the way.</p>\n",
    "parent": 0
  },
  {
    "id": 408912,
    "author": "Roger Crossland",
    "authorUrl": "http://www.dreadnaughts-bluejackets.com",
    "date": "2019-01-13T19:09:47",
    "content": "<p>Not so fast.  There&#8217;s been a mistake in the math.  Princeton, etc., are walking back their flawed calculations in response to errors observed by Nic Lewis.</p>\n<p><a href=\"https://www.sandiegouniontribune.com/news/environment/sd-me-climate-study-error-20181113-story.html\" rel=\"nofollow ugc\">https://www.sandiegouniontribune.com/news/environment/sd-me-climate-study-error-20181113-story.html</a></p>\n<p>This rush to conclusions of man-induced global warming is getting tiresome.  Yes, man has altered his environment to his detriment from time to time, but Chicken Little was nothing but a bore.</p>\n",
    "parent": 0
  },
  {
    "id": 408909,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-01-13T18:23:35",
    "content": "<p>&#8220;SEEN ON TV&#8221;!<br />\nRead it too, on another site.</p>\n",
    "parent": 0
  },
  {
    "id": 408905,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-13T14:48:34",
    "content": "<p>Interesting excerpts of the story.  Missing from the story above was that the recordings of raised temperatures wer not globally, yet in fact were taken off a few detectors that showed higher than normal readings.  So either the detectors were needing to be checked/replaced.  There was no reason why the sensors were off.  Yet the story on CNN also pointed out that the smapling of the sensors was limited to only the sensors with above normal readings.  That the sensors read did NOT include the surrounding sensors that read normal temps.</p>\n<p>Thankyou for the hype</p>\n",
    "parent": 0
  }
]