[
  {
    "id": 420120,
    "author": "Robert Kennedy",
    "authorUrl": "",
    "date": "2021-03-14T13:25:52",
    "content": "<p>Yet another example of international cruise lines not caring for or adhering to the environment or environmental laws.</p>\n",
    "parent": 0
  },
  {
    "id": 420044,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-03-06T14:27:03",
    "content": "<p>A good cheap alternative than asbestos is a space age glass composite called fiber frax</p>\n",
    "parent": 0
  },
  {
    "id": 420043,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-03-06T14:25:39",
    "content": "<p>Thought modern ships no longer used asbestos</p>\n",
    "parent": 0
  },
  {
    "id": 420042,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-03-06T12:15:09",
    "content": "<p>As I understand it there is no control or regulation of asbestos and its disposal in India.</p>\n",
    "parent": 0
  },
  {
    "id": 420041,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2021-03-06T10:25:01",
    "content": "<p>Marco Polo a well travelled ship one of the more friendly cruise/adventure ships.<br />\nMy son was in Bangladesh several years ago for the world cricket he was taken by a local into the shipbreakers and carefully looked after because of what he saw and how they broke up ships working bare foot with only gas torches, spanners, hammers and chisels. Stephen said it was horrendous to look at and photographs were not encouraged he only got a couple of shots, after he was taken to a local tea house in Chittagong the streets were alleys barely the width of a man and when they were in the tea house dozens of locals came to have a look at this foreigner/Englishman just to see him in their midst.</p>\n",
    "parent": 0
  },
  {
    "id": 420038,
    "author": "John.",
    "authorUrl": "",
    "date": "2021-03-05T21:44:39",
    "content": "<p>Very interesting. Where does one apply for  a charter?</p>\n",
    "parent": 0
  }
]