[
  {
    "id": 422969,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-09-01T15:53:51",
    "content": "<p>Hmm, I wonder if those bladeless cooling fan gadgets could be made to work backwards? Or would they just get blocked up with shellfish like power station cooling water outlets?</p>\n",
    "parent": 0
  },
  {
    "id": 422952,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-09-01T06:40:36",
    "content": "<p>Pardon my foopah.  I was speaking in general of what would happen if it were to be tried elsewhere.</p>\n<p>Locals here is Maine seem to think these things would act like macerators and chew all things living.  Regardless of what science can prove.</p>\n",
    "parent": 0
  },
  {
    "id": 422950,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-09-01T05:06:02",
    "content": "<p>Back in the 1960s our rivers were so polluted that there were no fish and little need to antifoul boat bottoms to prevent weed growth. Also, when the wind was from the south we got covered in dust from the cement works chimneys and if it turned to the North we got coal dust from the power station covering everything.<br />\nNow we have fish and seals and dolphins/porpoises and of course weed and barnacles on the boat hull. I can live with that.<br />\nWe just need the farmers to stop using phosphates and for the water company to stop releasing raw sewage during heavy rainfall. Oh, and for the trawlermen to stay out of the river and let the fish grow.</p>\n",
    "parent": 0
  },
  {
    "id": 422939,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2021-08-31T19:58:24",
    "content": "<p>Not in the East River.  No fishing there if you like living.  Any wildlife, if there is any, in the East River is not anything you want to be around anyway.  Even the Fulton Street Fish Market moved.</p>\n",
    "parent": 0
  },
  {
    "id": 422930,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-08-31T07:58:39",
    "content": "<p>Now for the onset of the worriers.  Fouled fishing gear.  Blades that shed plastic to be ingested by wildlife.  Blades will destroy fish like a blender.  You get the idea.  Nature conservancies of america will find some reason why these things should not be erected.</p>\n",
    "parent": 0
  }
]