[
  {
    "id": 423260,
    "author": "Peter",
    "authorUrl": "",
    "date": "2021-09-21T14:30:11",
    "content": "<p>Willy, in regards to your post, isn&#8217;t it the logical answer that these sites would already be marked out via oceanographic surveys, inclusion on the respective charts and ENCs, etc.?</p>\n<p>It would seem to me that this is the logical dissemination method (along with USCG local notices to mariners), unless I am missing something?   (Asks the guy that provided IT support to Coast Survey for a bit)</p>\n",
    "parent": 0
  },
  {
    "id": 423016,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-09-04T08:34:12",
    "content": "<p>Seals may have the common sense to avoid the turbines but back in 2013 a sailing vessel managed to hit one in Strangford Lough in Ireland. Fortunately the three crew were rescued by other vessels after being thrown into the water. The vessel was not holed but was dismasted.<br />\nI am guessing it was a sailing dinghy and it may be that it was carried on to the superstructure of the turbine by the tide rather than being struck by one of the blades.<br />\nThe article I read was a bit short on facts.</p>\n",
    "parent": 0
  },
  {
    "id": 423015,
    "author": "Willy",
    "authorUrl": "",
    "date": "2021-09-04T08:27:40",
    "content": "<p>Drop a lobster trap on one side and tell me what happens when the turbine gets snarled with the buoy rope.  As well as how many ropes can it handle until it stops working.  </p>\n<p>Or what will happen when a muscle dragger gets fouled in a turbine?  Will it sink the boat?  Or will the boat become part of a circuit and rip up the cables?</p>\n<p>Will there be fan guards on the rotating blades because the urchin divers didnt pay attention and found the turbine platform the ideal spot to catch urchins?</p>\n<p>These are the usual concerns that fishermen will raise and get any tidal turbine projects axed while still in the planning stage.</p>\n<p>Currently in Frenchman&#8217;s Bay is a desire to create a fish factory.  The group wants to set up a series of pens to grow fish.  Blue signs now dot the small towns around Frenchman&#8217;s Bay declaring &#8220;Say NO to the factory&#8221;.  As some one is stirring up the locals with a smog generationg smoke stack and visions of past trawlers that destroyed the ecoology in the past.</p>\n",
    "parent": 0
  }
]