[
  {
    "id": 414726,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-06-04T05:33:31",
    "content": "<p>&#8220;Now, the Ministry of Defence is offering to pay £5 million ‘danger money’ to any company prepared to hack off the rusting masts of the ship&#8221;</p>\n<p>It sounds like World War I where the brave generals operated from behind solid oak desks hundreds of miles from the front.</p>\n<p>If it is £5 million per person on top of the price of the job, there might just be some interest.</p>\n",
    "parent": 0
  },
  {
    "id": 414700,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-06-01T14:33:57",
    "content": "<p>2013 survey report <a href=\"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/488870/MCA_Summary_Report_2013.pdf\" rel=\"nofollow ugc\">https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/488870/MCA_Summary_Report_2013.pdf</a><br />\nand an interesting discussion in the non-elected division of the UK houses of parliament <a href=\"https://www.theyworkforyou.com/lords/?id=2019-07-03a.1499.0\" rel=\"nofollow ugc\">https://www.theyworkforyou.com/lords/?id=2019-07-03a.1499.0</a></p>\n",
    "parent": 0
  },
  {
    "id": 414693,
    "author": "Michael",
    "authorUrl": "",
    "date": "2020-05-31T12:53:06",
    "content": "<p>As a recovery of masts, there are a number of potentially viable methods available. Willy, I know a number of sonar surveys were made about 10 years ago and I think &#8220;Britain at War&#8221; magazine published an article with some. Sorry, I know they exist, just not where.</p>\n",
    "parent": 0
  },
  {
    "id": 414692,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-05-31T08:39:53",
    "content": "<p>Thankyou for the updates. It is most informative.  </p>\n<p>Too bad no one wants to do a side scan (like national geographic has done) on this ship to see what if anything is actually left of this ship.</p>\n<p>On a side note I guess the nearby residents are grateful the area doesnt have seismic activity.</p>\n",
    "parent": 0
  },
  {
    "id": 414688,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-05-31T05:40:07",
    "content": "<p>Up to about 50 years ago guys used to tie up to the masts and climb on to them for a nice stable platform whilst &#8216;wreck fishing&#8217;.<br />\n@Willy there is a build up of sand all around the wreck so, even though it is just yards away from the main shipping channel into the River Medway, there is little risk of any ship being able to crash into it. Which is comforting as there is a dock for two gas carriers just upstream.<br />\nA good day sail for us if leaving on a falling tide is out into the estuary and around the wreck and back to Chatham.<br />\nThe River Medway has previous for large explosions on ships, check out the HMS Bulwark and the HMS Princess Irene</p>\n",
    "parent": 0
  },
  {
    "id": 414685,
    "author": "Mike",
    "authorUrl": "",
    "date": "2020-05-31T05:06:14",
    "content": "<p>As kids, I fear about 70 years ago, we were told exactly the same things &#8211; if it goes it will drown half the Medway and blow all the windows out in Southend.<br />\nUndaunted by this adult pessimism, we frequently sailed our dinghies round and through the masts which stuck up at full size then. The hope is that the sea will gradually eat everything away and a the mud will bury it. I don&#8217;t think even &#8216;terrorists&#8217; would risk messing with this. Nil visibility, fierce tides, cargo filled with silt and mud, shells and explosives containers corroded to paper thin. Just hope it slowly fades away. Certainly wouldn&#8217;t sail round it now!</p>\n",
    "parent": 0
  },
  {
    "id": 414681,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-05-30T19:23:43",
    "content": "<p>Sounds only like a bandaid to remove the masts.  Something will eventually plow into the wreck.  </p>\n<p>On a side note with all the terrorists out there.  I am some what surprised no one has bothered to go after the munitions *</p>\n<p>*I am not in favor of such actions nor do I wish to participate in any such actions.</p>\n",
    "parent": 0
  }
]