[
  {
    "id": 409077,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-22T14:48:10",
    "content": "<p>Just because the moon moves away doesnt make the moon new.  It is still just a moon.  Just now there is more hype about something that  has existed for 5 million years.  Tomorrow it will be a moon.  It will be a moon in a year.  AND it will still be the same moon.  The today generation that feels everything must have a change is willing to look at the king whom has no clothes, and say he has something he doesnt.  He is still stark naked and just a moon.  Nothing new no matter how you want to gloss it over.  It is still</p>\n<p>the moon.</p>\n",
    "parent": 0
  },
  {
    "id": 409073,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-01-22T12:38:31",
    "content": "<p>Willy,</p>\n<p>Not really the same Moon, it is slowly moving away from Earth every year.</p>\n<p>For the last few billion years the Moon&#8217;s gravity has been raising tides in Earth&#8217;s oceans which the fast spinning Earth attempts to drag ahead of the sluggishly orbiting Moon. The result is that the Moon is being pushed away from Earth by 1.6 inches (4 centimeters) per year and our planet&#8217;s rotation is slowing.Jan 22, 2007<br />\nEarth&#8217;s Moon Destined to Disintegrate &#8211; Space.com<br />\n<a href=\"http://www.space.com/3373-earth-moon-destined-disintegrate.html\" rel=\"nofollow ugc\">http://www.space.com/3373-earth-moon-destined-disintegrate.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 409072,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-01-22T09:35:06",
    "content": "<p>Oh look its the moon.  Its not like we have looked at the moon before have we?  It is only new because some one said it was.  It is still just a moon folks.  It will still be a moon tomorrow.  It will still be tthe same moon in 20 years.  At least in 20 years it might have residents.  Maybe  </p>\n<p>Yet it is still a moon.  The same moon the Earth has had since man started measuring time.  The moon has passed many a time through the earths shadow before.  It is nothing new.  Only the hype that was put into it has changed.</p>\n",
    "parent": 0
  },
  {
    "id": 409064,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-01-21T13:20:31",
    "content": "<p>I didn&#8217;t bother to go outside last night, too cold out during the storm, surprised we didn&#8217;t loose power.</p>\n<p>Map of the area it coverd is below.<br />\nHow to Watch the January 2019 Lunar Eclipse<br />\n<a href=\"https://www.popularmechanics.com/space/moon-mars/a23745748/next-lunar-eclipse-january-2019/\" rel=\"nofollow ugc\">https://www.popularmechanics.com/space/moon-mars/a23745748/next-lunar-eclipse-january-2019/</a></p>\n",
    "parent": 0
  },
  {
    "id": 409063,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2019-01-21T12:38:35",
    "content": "<p>Thanks Rick cos I missed it. I did look out at 03.30ish gmt but it was not in view and wasn&#8217;t due to be at full eclipse for another couple of hours.<br />\nHaving seen a total eclipse of the sun when offshore of Northern France, an eclipse of the moon is a bit second rate.</p>\n",
    "parent": 0
  }
]