[
  {
    "id": 413961,
    "author": "Richard Bailey",
    "authorUrl": "",
    "date": "2020-03-25T12:40:32",
    "content": "<p>One wonders how Patrick O&#8217;Brian missed this delicate detail&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 413896,
    "author": "Ed Minch",
    "authorUrl": "",
    "date": "2020-03-23T08:02:01",
    "content": "<p>The structural area protruding out the front of the hull is called the beakhead, later the head.  Its original purpose was to hold down the bowsprit which was there to keep the mast fro falling backward.  They later hung a sail on, put a small mast at the ned of it, then stuck jibs and staysails on it.  Since it was right next to the area that the sailors lived &#8211; the forecastle or fo&#8217;c&#8217;sle &#8211; it was a handy place to put the toilet.  In Master and Commander there is shot of them rounding the horn in the snow with an old sailor shivering on the head</p>\n",
    "parent": 0
  },
  {
    "id": 413887,
    "author": "Herbert Conner",
    "authorUrl": "http://Mr.",
    "date": "2020-03-22T18:00:20",
    "content": "<p>@Willy<br />\nIt is called &#8216;the head&#8217; or more properly &#8216;the heads&#8217; because that term describes the construction of the bow of wooden ships in which the planks are/were steamed and bent to fit the narrowing of the frame, and thus attached to the rabbet of the prow or stem. When the &#8216;bows&#8217; starboard and port are attached, one can go the &#8216;heads&#8217; on either side, or to the head is only one side has the seat as in the video.<br />\nSource: Adm. WHSmythe Word Book ca. 1867</p>\n",
    "parent": 0
  },
  {
    "id": 413884,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2020-03-22T14:45:07",
    "content": "<p>Shit gets real. Thanks for sharing what people (sailors) did for centuries before toilet paper was invented! There is more than one way to clean an ass. (Is this too much foul language?)</p>\n",
    "parent": 0
  },
  {
    "id": 413881,
    "author": "L Naismith",
    "authorUrl": "",
    "date": "2020-03-22T13:28:14",
    "content": "<p>Back in the day, while sailing with a number of 27&#8242; whalers down the Trent Canal, the problem was solved by towing the person himself. Not so eco-friendly but it did serve the purpose. No facilities were handy when natural demanded immediate attention.</p>\n",
    "parent": 0
  },
  {
    "id": 413877,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-03-22T08:05:13",
    "content": "<p>Thanks Rick<br />\nI will be able to amaze my friends with this wonderful information, probably several times until they threaten injury 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 413874,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-03-21T22:54:36",
    "content": "<p>So is this why bathrooms are often called &#8220;head&#8221;.  Because on the ship the seat was found at the head?  Granted officers may have had someplace seperate.</p>\n<p>BTW?  The link to the vid no longers works at the time of this posting.<br />\nAn error occurred. Please try again later. (Playback ID: 5g2E7owrxBpqpn02)</p>\n",
    "parent": 0
  }
]