[
  {
    "id": 443741,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2025-12-29T17:43:49",
    "content": "<p>Please be so kind as to give me a break. Referring to the Trump cabal as a criminal clown circus regime seems overly polite to me. The US Coast Guard has been doing a good job interdicting drug smuggling boats and arresting drug boats crews to be taken for trial for decades.  </p>\n<p>Instead General BoneSpurs violates domestic and international law by blowing up boats and murdering mariners without any due process or ongoing war. The penalty for drug running is not summary execution unless you support outright dictatorship and hate the rule of law. </p>\n<p>The criminal thuggery of the Trump gang only puts our own soldiers and sailors at risk. I guess you did not notice that the governments of the UK, Canada, the Netherlands, and Australia have stopped sharing intelligence with the US over the illegal targeting of the Venezuelan and Colombian boats. </p>\n<p>In nominal control of this horror show is Bonespurs himself trying to look macho, supported by a Navy Secretary who is a hedge fund manager with no naval experience and Fox media personality with history of public intoxication and not bright enough to hold a secure group chat. They sure look like a criminal clown circus to me.</p>\n",
    "parent": 443598
  },
  {
    "id": 443602,
    "author": "Roger Eastman",
    "authorUrl": "",
    "date": "2025-12-03T21:11:06",
    "content": "<p>I agree drug runners are despicable and cause our citizens who chose to partake of the drugs tremendous harm. The issue here is that we should go after them following legal precedents and protocols. What this administration &#8211; and I agree it is more of a three ring circus than a well functioning government- is doing appears to be illegal.</p>\n",
    "parent": 0
  },
  {
    "id": 443598,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2025-12-03T17:10:08",
    "content": "<p>Criminal clown circus regime?  That’s way too far.  What do you call the previous clown regime?  Or the ones causing wars including covering running drugs?  Or the ones rotating drug cartels as favored nations?   Who brought drugs into our country and under what presidents?   How many of us were poisoned by known biochem warfare and used as guinea pigs without ever being told and what regimes were in place then?   I can go on a long time.  I was there and then I investigated &#8211; after being brought back numerous times to help out.  Reporting is one thing &#8211; throwing garbage out like that is unnecessary and legally incorrect.   How many people in our country and elsewhere get destroyed by drugs along with their families?   No, you play you pay.   No sympathy for drug runners &#8211; they aid and abet death.</p>\n",
    "parent": 0
  }
]