[
  {
    "id": 406566,
    "author": "Harriette Goldmeer",
    "authorUrl": "",
    "date": "2018-07-10T13:00:08",
    "content": "<p>Horrendous, when they are gone, they are gone. When the animals ate gone so shall humans perish. What is wrong with people who can&#8217;t  protect the helpless creatures of our planet? It is all about money. Let them eat money she declared.</p>\n",
    "parent": 0
  },
  {
    "id": 406565,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-07-10T09:33:41",
    "content": "<p>Spare me. Even though the regulation was proposed and still supported by the fishing industry, the fraud in the White House feels the need to undo everything done by the previous administration. In this case, the victims are endangered species of whales and turtles. Ultimately, the real victims are the American people.</p>\n",
    "parent": 406564
  },
  {
    "id": 406564,
    "author": "Mike",
    "authorUrl": "",
    "date": "2018-07-10T09:28:21",
    "content": "<p>Wow, talk about click bait!</p>\n<p>President Trump did not cancel protection for endangered species. NOAA recognized that the regulations already in place are effectively and significantly reducing the by-catch of the species identified. The pending regulation was essentially an all or nothing proposition with the loss or injury of 2 animals over a two year period closing the fisheries. NOAA acted responsibly to protect the livelihood of hard working fishers who have made great strides in reducing the side effects of meeting the demand we create for seafood.</p>\n<p>Rick, you have a great site. This headline is disappointing and unnecessary &#8211; as suggested even by your posted comment.</p>\n",
    "parent": 0
  },
  {
    "id": 406560,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-07-09T14:37:26",
    "content": "<p>Government by trolling. If it annoys the &#8220;opposition,&#8221; do it, even if it&#8217;s self-harming.</p>\n<p>Evolved version of McConnell&#8217;s &#8220;whatever they&#8217;r for, we&#8217;re against not matter what.&#8221; Not a prescription for success, for any of us. </p>\n<p>Remember, whatever our disagreements as Americans, we come together to vote. Please join the party this November.</p>\n",
    "parent": 0
  },
  {
    "id": 406558,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-07-09T09:18:22",
    "content": "<p>The number of gillnetters has apparently dropped from over 100 to around 20. The canceled rule was a compromise between regulators and the fishing industry. It wasn&#8217;t an outright ban but had a similar impact if the gillnetters caught endangered mammals or turtles.</p>\n",
    "parent": 406557
  },
  {
    "id": 406557,
    "author": "Harry T Scholer",
    "authorUrl": "http://AOL",
    "date": "2018-07-09T08:34:05",
    "content": "<p>Trump this, Trump that. How about banning the gill nets?</p>\n",
    "parent": 0
  },
  {
    "id": 406554,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-07-08T20:01:41",
    "content": "<p>Trump decides by what or whom pays him.  I will not be surprised when he leaves office to find out Putin has given him a swanky villa somewhere.</p>\n",
    "parent": 0
  },
  {
    "id": 406553,
    "author": "Ginny (USA)",
    "authorUrl": "",
    "date": "2018-07-08T19:33:33",
    "content": "<p>May Trump and all his ilk be placed on a melting ice floe with several hungry Polar Bears and left to the fate they so richly deserve.   </p>\n<p>The whole lot of them are such arse wipes.   As I think about Endangered North Atlantic Right Whales and their risk of death from gear entanglement I made a vow to never eat lobster or snow crab again.   Fifty years ago I made a similar vow to never eat swordfish caught by long lines.    The long line industry wiped out so many sexually immature swordfish and how long can a species survive is you eliminate the breading members from the numbers?    Maybe someone should remove all security around the administration members and facilitate the elimination of Trump and all his administration from the gene pool because they just don&#8217;t get the concepts of conservation of species and protection of the environment (and all creatures).   that would be precisely what he has done.    Think elephants and rhinos (and endangered types of giraffes, etc.) and many other species, including us.</p>\n",
    "parent": 0
  },
  {
    "id": 406550,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-07-08T14:18:49",
    "content": "<p>Trump really makes me mad some time, this was a stupid decision!</p>\n",
    "parent": 0
  }
]