[
  {
    "id": 418336,
    "author": "james mccoy",
    "authorUrl": "http://www.bccftools.com",
    "date": "2020-12-13T08:10:27",
    "content": "<p>UFO&#8217;S &#8211; this brings two things to mind.. maybe 3..<br />\n1) find the containers if that is what they may be and fine the shipping companies for damages.<br />\n2) Prior to next Vendee globe employ the USA Navy to go a hunting with subs and destroy alien objects.<br />\n3) Put word out to salvage&#8217;s that there is pure gold in the containers..<br />\n4) Possibly a fourth solution, can anyone say &#8220;SONAR&#8221;? We build a multi-million dollar boat and are aware that this is a major hazard and fail to fit it with a protective system.(autosail out of way of hassard?!!) come on it is not that hard, my fish finder will do that.</p>\n",
    "parent": 0
  },
  {
    "id": 418153,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-06T09:21:45",
    "content": "<p>Containers full buoyant material such as balsa wood or plastic bottles etc would still float and what about the containers with hazardous materials inside?<br />\nMake sure they stay afloat and fit mob trackers perhaps. But because trackers are expensive there would be another excuse for misdeclaring the contents.<br />\nTags on all fishing nets coded to the vessel would help but so many illegal ships&#8230; China I mean yours.</p>\n",
    "parent": 0
  },
  {
    "id": 418152,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-12-06T00:28:07",
    "content": "<p>It might not be great for aerodynamics, but sounds like these boats need &#8220;cow catchers&#8221; like the old locomotives had. </p>\n<p>If you could avoid damage from a UFO you at least have a better chance to finish the race.</p>\n",
    "parent": 0
  },
  {
    "id": 418150,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-05T20:26:01",
    "content": "<p>It wouldnt be hard to retrofit containers.   Lobster fishing in Maine already are required to install &#8220;ghost doors&#8221;.  The idea being if the trap isnt tended a door dissolves rendering the trap not a trap at all. </p>\n<p> Yet as a previious post mentioned.  The boat snagged some ghost netting.  Ghost netting isnt a container.</p>\n",
    "parent": 0
  },
  {
    "id": 418147,
    "author": "dennis beebe",
    "authorUrl": "",
    "date": "2020-12-05T11:29:08",
    "content": "<p>neat idea, mike!  i wonder though, how long it would take to retrofit all those existing containers . . . .</p>\n",
    "parent": 0
  },
  {
    "id": 418145,
    "author": "mike",
    "authorUrl": "",
    "date": "2020-12-05T06:22:35",
    "content": "<p>Would this idea work? All containers shipped by sea to have two small ports in the sides which dissolve after a weeks immersion. The sea would get in, the air would get out, the beasts would sink. The inclusion of these would be compulsory and omissions subject to fines and confiscation of the containers and contents. Carriers might then take less risks in stacking cargo dangerously high and fix everything more securely.<br />\nJust thinking.</p>\n",
    "parent": 0
  },
  {
    "id": 418141,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-12-04T22:03:16",
    "content": "<p>Jean-Pierre on another thread here: <i>I thought following the race was going to be a relief from all the political stupidity that is in the news but it is causing me even more stress and worry.</i></p>\n<p>Yeah, getting there. 🙂</p>\n",
    "parent": 0
  }
]