[
  {
    "id": 405783,
    "author": "Frank",
    "authorUrl": "",
    "date": "2018-03-27T22:21:26",
    "content": "<p>Thanks to the experienced comments for some further insight on both dry-docking methods.</p>\n",
    "parent": 0
  },
  {
    "id": 405777,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (Ret'd.)",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG",
    "date": "2018-03-26T11:17:18",
    "content": "<p>Not to belabor the point but if one enters &#8220;drydock disasters&#8221; in Youtube® there are a variety of illustrations of problems.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 405776,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (Ret'd.)",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG",
    "date": "2018-03-26T10:23:48",
    "content": "<p>Coming from &#8220;Phil&#8221; a prolific nautical affairs commenter one was very surprised that he had never heard of &#8220;floating drydocks&#8221;.<br />\nIt is the usual term used to distinguish them from the Graving drydocks common in UK, its Commonwealth countries and the EU.  Nowadays floating drydocks are common worldwide and while convenient Graving drydocks are much safer to use, in this seafarers opinion.<br />\nFloating drydocks are much more complex to use than a Graving drydock since one is putting a floating vessel into a floating vessel.  The problem is threefold. The stability of the floating drydock throughout the operation, the stability of the vessel throughout and the stability of the relationship between the two throughout.<br />\nDuring my 50 year career I had to do the calculations on several occasions and without computers one might add.  Working it all out using mathematic log tables was labourious work, I never felt comfortable using a &#8220;Ralston&#8221; Indicator.  The main points were preventing the loss of GM of both floating drydock and the vessel throughout and the &#8220;Uptrust&#8221; which is when the vessel entering actually touch&#8217;s the drydock blocks, usually stern first.  This latter is heart stopping when entered into a floating drydock as the ship is depending on the calculations of the floating drydock superintendent.  If not correct the two units may list violently and suddenly as has happened on occasions.  Well lecture over !!<br />\nGood Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 405775,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2018-03-26T09:04:31",
    "content": "<p>Huzzah for the &#8220;Eagle&#8221; &#8212; sail on!</p>\n",
    "parent": 0
  },
  {
    "id": 405773,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-03-25T14:47:21",
    "content": "<p>Never heard it called a &#8220;floating drydock&#8221;.<br />\nWe had drydocks at the ship yard that could be filled with water to sail the ship out.</p>\n",
    "parent": 0
  }
]