[
  {
    "id": 408338,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-12-14T22:55:47",
    "content": "<p>The VHF with English subtitles. Sobering.</p>\n<p><a href=\"https://www.youtube.com/watch?v=NYqGxbKF0AI\" rel=\"nofollow ugc\">https://www.youtube.com/watch?v=NYqGxbKF0AI</a></p>\n",
    "parent": 0
  },
  {
    "id": 408328,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-12-14T09:03:05",
    "content": "<p>At Dover when a vessel first communicates with vts the vessels details are pinned to its mark on the coastguard&#8217;s plotter and follow it as it moves. This does not appear to be the case with Norway&#8217;s vts otherwise they would have been instantly aware of the name of the Navy ship when asked by the tanker. I wonder why this did not happen?<br />\nAlso, if the Navy were supposedly monitoring the vts vhs channel why did they not comprehend that the tanker was now under way?<br />\nI await the final report with interest.</p>\n",
    "parent": 0
  },
  {
    "id": 408327,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-12-14T01:39:06",
    "content": "<p>At least by the public displays on offer it appears that  <i>Helge Ingstad</i>&#8216;s AIS did not come on until <i>after</i> the collision. or at least first appears with an <i>increasing</i> range from <i>Sola TS</i> hence post-collision. At best the warship&#8217;s AIS was switched on so close to the point of intercept that it was far too late to affect the tanker&#8217;s available choices. </p>\n<p>It&#8217;s probably true that public sources don&#8217;t have the recorded update frequency available to investigators but that&#8217;s not relevant to this situation; 1 or even 2 minutes of time-resolution is enough to dismiss AIS as being useful to <i>Sola TS</i> in this circumstance. </p>\n<p>AIS alone may not have been enough to avoid this conflict but the handling of the system is an indicator of some kind. </p>\n<p>Navigating a ship without functioning AIS is like driving a car at night without headlights. There are only very peculiar extenuating circumstances for such a choice and this was not one of them. It&#8217;s more akin to the situation of drowning while only yards from a PFD in a locker; deeply humiliating even while instructive.</p>\n",
    "parent": 0
  },
  {
    "id": 408326,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-12-13T22:32:38",
    "content": "<p>The fascinating thing I am finding out of this and the collision in Japan.  Is how vulnerable the military vessels are to being rammed by the bulbous nose of the tankers.  If a glancing blow is damaging this badly in peace time?  What is going to happen if they are torpedoed or shot at?  To be torn open so easily makes me wonder if the armor on these boats is even up to snuff!</p>\n",
    "parent": 0
  },
  {
    "id": 408325,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-12-13T21:32:48",
    "content": "<p>I think the key point is that the frigate ran into the tanker. The tanker attempted to signal by radio, as well as by signal lights. When they finally did reach the frigate by radio, they directed the frigate to change course. The tanker also altered course in an attempt to avoid the frigate. The problem is that frigate was traveling at 17-18 knots, roughly three times the speed of the tanker, and was far more maneuverable. The tanker at 113,000 DWT had 20 times the mass of the frigate. The frigate could have avoided hitting the tanker, but the tanker had no possible way to avoid being run down by the frigate.</p>\n",
    "parent": 408324
  },
  {
    "id": 408324,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2018-12-13T20:31:38",
    "content": "<p>Rick I conveyed your post to a colleague for comment who has come back with:<br />\n&#8220;But what of the fully laden tanker, the pilot on board that vessel had a lot of concerns about the oncoming frigate &#8230; yet, your post giving &#8216;another take&#8217;, makes no reference to the fact that the tanker was accompanied by tugs, could have stopped &#8211; been held by said tugs, or indeed as I have mentioned before &#8211; despatched either a tug or pilot boat towards the oncoming frigate &#8230; and why did she not make the signal to advise of danger and/or that she did not understand the intentions of the oncoming frigate by sounding ship&#8217;s siren/horn giving five rapid short blasts etc etc.&#8221;<br />\nA possible duplicate as my first did not appear.</p>\n",
    "parent": 0
  },
  {
    "id": 408323,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2018-12-13T20:23:53",
    "content": "<p>Rick I have copied your account to another on this side of the Pond and received the following comments:<br />\nBut what of the fully laden tanker, the pilot on board that vessel had a lot of concerns about the oncoming frigate &#8230; yet, your post giving &#8216;another take&#8217;, makes no reference to the fact that the tanker was accompanied by tugs, could have stopped &#8211; been held by said tugs, or indeed as I have mentioned before &#8211; despatched either a tug or pilot boat towards the oncoming frigate &#8230; and why did she not make the signal to advise of danger and/or that she did not understand the intentions of the oncoming frigate by sounding ship&#8217;s siren/horn giving five rapid short blasts etc etc.</p>\n",
    "parent": 0
  }
]