[
  {
    "id": 413227,
    "author": "Captain alain L.CONNAN",
    "authorUrl": "",
    "date": "2020-01-07T05:08:58",
    "content": "<p>And why not in France in a Port of Normandy with a French Captain&#8217;s Association<br />\nI was third mate in the 50th on Empire and Liberty<br />\nI have been Capt&#8217;n more than 25 years with several flags including US in 1985 in Baltimore and Cape Henry on the m/v Gondwana ( ex Maryland,Maryland Pilot Association)<br />\nMember of the &#8220;International Federation of  the Ships Masters Association&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 413198,
    "author": "Skeep",
    "authorUrl": "",
    "date": "2020-01-04T08:30:46",
    "content": "<p>How interesting I stumbled upon this because as a military family, we traveled to and from Europe in the late 50s aboard a Liberty Ship at least twice, and I&#8217;ve a Certificate from Neptune indicating I was aboard the Darby.   And I have encountered another person living nearby me who also traveled via a Liberty Ship in the same manner.  I&#8217;m glad they&#8217;re avid to maintain this ship for the record.</p>\n",
    "parent": 0
  },
  {
    "id": 413197,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-01-04T08:10:25",
    "content": "<p>I am not sure if there are costs involved with the permitting process and if so there are 7 agencies listed plus the ubiquitous &#8216;and others&#8217;.  Over regulation at its finest.  Let the Army Corps of Engineers be the lead and approving agency, with the listed (plus the &#8216;others&#8217;) work off the CoEs permit if questions or issues.</p>\n<p>I went through this same process on a much smaller basis trying to install a floating dock in a tidal basin in Rhode Island.  9 different agencies with 9 different sets of requirements, with 9 different inspectors.  It took 3 years to get all the permits for a 4&#8242; by 36&#8242; floating dock.</p>\n<p>I am glad the Project Liberty Ship people are optimistic about funding, because I dare say the permitting process will kill it.</p>\n",
    "parent": 0
  },
  {
    "id": 413162,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-01-02T19:15:39",
    "content": "<p>That&#8217;s a heavy lift in dollars. </p>\n<p>As artifacts for museum preservation ships are about as awkward as it gets. As we&#8217;ve seen too often, costs of continuing operations are frequently lethal to success. It&#8217;s easier to pay for starting a museum than to run it particularly when the museum&#8217;s display is esoteric. I&#8217;m thinking here of the I.K. Brunel museum I visited in London earlier this year, barely alive and dead were it not for volunteers willing to sit and freeze mostly alone, waiting for the occasional patron with a special interest. </p>\n<p>With several billion people on the global network, the idea of a &#8220;$1 per year&#8221; crowdfunding system for museums of all sorts surely (hopefully?) would be viable, or at least a rigorous test of our &#8220;heartfelt&#8221; commitment to preservation of whatever we may be interested in.</p>\n",
    "parent": 0
  },
  {
    "id": 413160,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-01-02T17:41:05",
    "content": "<p>Its too bad this ship cant find work to pay her own way.</p>\n",
    "parent": 0
  }
]