[
  {
    "id": 437946,
    "author": "JOSEPH WALKER",
    "authorUrl": "",
    "date": "2024-02-26T14:03:35",
    "content": "<p>Ron Johnston, we used to Christen crewmember&#8217;s babies in our Ship&#8217;s Bell. USS Koelsch DE / FF1049</p>\n",
    "parent": 0
  },
  {
    "id": 437879,
    "author": "Ron Johnston",
    "authorUrl": "",
    "date": "2024-02-21T17:58:37",
    "content": "<p>I am in possession of the USS Porter 1915 Destroyer bell. Purchased some years ago in San Diego. One of many bells in our<br />\n50+ years of collecting. A beautiful thing.</p>\n",
    "parent": 0
  },
  {
    "id": 437865,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2024-02-20T13:50:04",
    "content": "<p>Fascinating.  Thanks.</p>\n",
    "parent": 437861
  },
  {
    "id": 437861,
    "author": "Markus F Robinson",
    "authorUrl": "",
    "date": "2024-02-20T10:30:06",
    "content": "<p>The Jacob Jones had completed delivery of a convoy to Brest. Its Captain Lieutenant Commander David W. Bagley chose imprudently to perform artillery practice alone in the war zone on its way back to Queenstown.  The sound of its guns firing alerted Hans Rose to its presence and precipitated his attack.  Having been told by the two men that he&#8217;d rescued (Albert C. DeMello, Seaman 2nd class, and second class petty officer John Francis Murphy) that the Jacob Jones had not been able to send off its location after being attacked, Hans Rose sent his absolutely unprecedented, uncoded radio message to the American naval base at Land&#8217;s End: &#8220;UZAG on Land’s End. USS Jacob Jones torpedoed 4925 9622 at 8 p.m. Survivors on board three rafts still at large.&#8221;  Even after the war, the British Admiralty refused to acknowledge that Rose had radioed the Jacob Jones location. The Americans however acknowledged it was sent, and this precipitated the rescue. After the war US Admiral William Sowden Sims, supreme commander of all United States naval forces operating in Europe, wrote &#8220;Rose is one of the few German U- boat commanders with whom Allied naval officers would be willing today to shake hands. I have heard naval officers say that they would like to meet him after the war.&#8221;</p>\n<p>A detailed first person account of the U53&#8217;s attack on the Jacob Jones makes up the entire first chapter of the biography Der Kapitän &#8211; U-boat Ace Hans Rose, available on Amazon.  </p>\n<p>My grandfather, Frederich Joch was the artillery officer aboard U52; sister U-boat to Rose&#8217;s U53. Between missions, the two officers shared cabins on the mothership Sophia when back at base on the German fortress island of Heligoland. This connection caused Rose&#8217;s youngest son, Christopher Rose to open the family archives to us so that we could write the biography of this extraordinarily chivalrous German naval officer.</p>\n",
    "parent": 0
  }
]