[
  {
    "id": 414549,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-05-20T05:08:37",
    "content": "<p>Willy<br />\nthe reason behind all the lockdowns is to prevent the medical facilities from becoming overwhelmed if everyone gets sick at the same time.<br />\nSo please ease up on the negative vibes and help protect the care workers some of whom are dying on the job because of people like you.</p>\n",
    "parent": 0
  },
  {
    "id": 414531,
    "author": "ws",
    "authorUrl": "",
    "date": "2020-05-18T09:29:12",
    "content": "<p>It would be interesting to see, quantitatively, how the reinfected sailors tested for antibodies after their initial bout, and recovery from the COVID-19 virus..</p>\n",
    "parent": 0
  },
  {
    "id": 414525,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-05-17T19:50:42",
    "content": "<p>Willy, </p>\n<p>Spare me the stupidity. The virus in Maine, according to the state figures includes 1,687 total cases and 70 deaths, representing a mortality rate of over 4%. In the US overall there are close to 1.5 million cases and 90,000 deaths for an overall mortality rate of roughly 6%. So, if you want to be stupid and call concerns over the pandemic &#8220;paranoia&#8221; that is on you. I have seen too many die to put up with this idiotic garbage.</p>\n",
    "parent": 414523
  },
  {
    "id": 414523,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-05-17T19:33:07",
    "content": "<p>So in short.  One person died with a crew of 1400.  Seems like the paranoia of the covid is out of hand.  My family has already had it including my 90 year old father in law.  IT ISNT THAT LETHAL PEOPLE!  A study here in Maine found that the lethality of this is not 3%.  Yet instead it is closer to 0.3%.  You will contract it.  It doesnt matter if you cower in your home or hide behind a mask.  This isnt going to die off.  It is however the new norm to life.  When you get it, it is just like another flu.  Tho the cough was easier to deal with when taking mucinex.  Yes I have damaged my lungs with numerous bouts of pnuemonia.</p>\n",
    "parent": 0
  }
]