[
  {
    "id": 439499,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2024-08-06T06:06:52",
    "content": "<p>For much of our maritime heritage it is already one minute to midnight.I knew well Harold D Huycke who was one of the movers and shakers who got FALLS OF CLYDE to Honolulu in the first place he was a great friend of the late Adrian Small also a great traditionalist. It is a shambles that the project in Scotland came to nothing despite all their protestations the last of which seemed to be no more than blowing in the wind. True one of everything cannot be saved FALLS deserved better than her likely end and indeed she is special.</p>\n<p>Remember Jack Hayward who put up the funds to bring SS GREAT BRITAIN sunk down in the Falklands on an open barge towed by a tug home to Bristol UK or even the many man hours it took to jack hammer concrete out of JAMES CRAIG board her over with ply board get her to Hobart and wait for favourable weather to tow her to Sydney for her eventual rebuild to sailing condition again with personal funding. All credit to both of these groups.<br />\nChris</p>\n",
    "parent": 0
  },
  {
    "id": 439440,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2024-07-29T14:02:25",
    "content": "<p>Christopher Roche. I agree, there are so few opportunities left to maintain an incredible heritage but the reality lies with the next generations who I hope will wake up to the realities of heritage versus social media short term and populist themes. They might wake up too late.</p>\n",
    "parent": 0
  },
  {
    "id": 439427,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2024-07-28T16:21:39",
    "content": "<p>This shoyuld not have come to pass there has been much mismanagement over the intervening years, not helped by an over optomistic Clyde bid to obtainn the ship without the funding ever likely to be available to return her to the Clyde, It was such a shame that there was ever an expectation that she could be returned to sailing condition. The only time that has happened was when James Craig was dragged out of Recherch bay in Tasmania, what that project proved was that a complete rebuild to sailing condition of a 100 year old iron ship was possible when a sposor put up unlimited funding such sponsors are rare indeed. There is still time for that to happen here to Falls of Clyde if somewhere the right entreprenuer can be found but I fear that is now beyond hope. The world should be ashamed of itself!</p>\n",
    "parent": 0
  },
  {
    "id": 439425,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2024-07-28T14:21:05",
    "content": "<p>So sad that such an amazing piece of heritage will be lost but the reality is that it is not a viable option to save.</p>\n<p>It was proposed to bring her back to the Clyde but we already have three significant ships, the Glenlee, the Waverley (the most amazing last seagoing paddle steamer), and the Queen Mary which are stretching funds and fans.</p>\n<p>So very sad.</p>\n",
    "parent": 0
  }
]