[
  {
    "id": 439698,
    "author": "Christopher Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2024-08-26T04:58:32",
    "content": "<p>While all of the above is important we have to be aware of the decisions captains and skippers make. I saw on TV Captain Borner of &#8220;Sir Robert Baden Powell&#8221; the nearby Dutch traditional top`sl schooner saying &#8220;we saw the weather coming and prepared for it. </p>\n<p>I myself have numerous times mainly in the Pacific watched squalls coming at us and water spouts form from the sky down not always connecting with the sea and sometimes have tried to avoid bad weather in my time with only a radar, weatherfax and a captains intuition.</p>\n<p>Remember a few years back when &#8220;Marques&#8221; was overwhelmed in the Caribbean by a white squall she had her hatches open she was a shallow draft fruit schooner carrying a lofty barque rig she was never designed to carry. South Atlantic &#8220;Concordia&#8221; the Polish built barquentine was found to have had hatches open, again when a severe squall hit her when she was unprepared.</p>\n<p>Any sailing vessel I have been in does several things either at sea or anchor, keep a good lookout 24/7 in poor weather a radar watch and hatches closed or readied to be battened down, at anchor all of the above and an anchor watch. In addition a walk through to check for anything loose doubling as a fire watch on the hour every hour. Our watertight doors would be regularly tested and shut when weather deteriorated of looked like it would be getting really bad.</p>\n<p>The sailor of an earlier era would say compartment and survive I have stood in the open holds of several preserved sailing ships notably &#8220;Pommern&#8221; 4bk built 1905 and been amazed the only bulkhead being up forward the collision bulkhead and it being possible to see otherwise the full length of her hold and wonderful shape the open space is why so many old timers were lost even the &#8220;Titanic&#8221; may have survived if her bulkheads had been built up to her ceilings and not stopped short.</p>\n<p>Chris</p>\n",
    "parent": 0
  },
  {
    "id": 439682,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2024-08-25T12:13:44",
    "content": "<p>This Post was very helpful with the discussion on stability. The vessel&#8217;s system seems to have been largely experimental and problematic to operate.  Calculating stability is not particularly difficult even before the days of computers. During my long sea career I must have performed thousands using the Stability Booklet supplied by the Builders for vessel currently sailing in. This might explain the appalling statements from Perini Nav. they to be suffering from guilt of conscience.</p>\n<p>Naturally the Italian Authorities are conducting an investigation under Italian Law which I believe is based on Code Napoleon and they in turn have NOT made any statements.  In view of the Perini Nav. highly prejudicial ones it is well that this vessel is British registered and any legal action should take place under British Common Maritime Law in Admiralty Court in London.  The United Kingdom is no longer a member of the European Union and both the company owning and operating the vessel is British in addition to the vessel.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 439677,
    "author": "Allan Pickman",
    "authorUrl": "",
    "date": "2024-08-24T21:54:15",
    "content": "<p>If that is a correct Roger Long quote, I believe it.  He knows more about sailing ship stability than most.</p>\n",
    "parent": 0
  }
]