[
  {
    "id": 442339,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2025-06-13T06:09:25",
    "content": "<p>The following by the late Bob Watson is his comment on modern ships it is widely sung at Shanty events, I sand it off Cape Horn in 1991 from the deck of Soren Larsen.</p>\n<p>Shantyman (Bob Watson)</p>\n<p>Now modern ships carry mighty funny gear,<br />\nREF: And away, get away, you shantyman.<br />\nAin&#8217;t seen a halyard in many&#8217;s a year,<br />\nREF: An&#8217; they got no use for a shantyman.<br />\nSlick new fittings are all your style,<br />\nREF: And away, get away, you shantyman.<br />\nAll very clever, but it just ain&#8217;t right;</p>\n<p>CH: An&#8217; they got no use for a shantyman.<br />\nShantyman, oh, shantyman,<br />\nWho&#8217;s got a berth for a shantyman?<br />\nSing you a song of a world gone wrong,<br />\nWhen they got no use for a shantyman.</p>\n<p>Levers to jerk and buttons to press<br />\nAnd real live sailors they need them less;<br />\nPushing on the buttons and hauling on the levers<br />\nAnd they got no use for horny-handed heavers.</p>\n<p>The cargo is stored in a polythene pack,<br />\nRaised and lowered by a dry bollocks jack;<br />\nFloating computer dressed like a ship,<br />\nSkippered and crewed by a microchip.</p>\n<p>Soon they&#8217;ll be sailing by remote control,<br />\nAn&#8217; that&#8217;ll be pleasing to the owners&#8217; souls;<br />\nThey&#8217;ll send their ships from dock to dock,<br />\nAll sat upon their arses in an office block.</p>\n<p>New-fangled gear&#8217;s no use to you<br />\nWhen you&#8217;re off Cape Horn with your fuses blew;<br />\nThen&#8217;s the time for to curse the day<br />\nYou sent your shanty crew away.</p>\n<p>A sailor&#8217;s life it once was hard,<br />\nLaid out aloft on a tops&#8217;l yard;<br />\nNow it don&#8217;t matter if the winds blow high;<br />\nYou can take force ten with your feet still dry.</p>\n<p>Old-time ways are forgotten and gone,<br />\nFor no-one listens to a shantyman&#8217;s song.<br />\nThings no longer as they used to be;<br />\nIt&#8217;s the knacker&#8217;s yard for the likes of me.</p>\n<p>Listen at night and you might hear<br />\nA ghostly sound on the quiet air;<br />\nIs it a ghost from the distant past?<br />\nOr just a breeze in the radar mast?<br />\nBob has this to say about his song:</p>\n<p>&#8220;Somewhere about 1983 I heard Jim Lloyd on the BBC (Folk on Two) interviewing<br />\nThe Spinners, one of whom remarked that there was a demand for new sea songs written in the style of the old.  I remember thinking; &#8220;What on earth would one write new sea songs about?&#8221;  It took a year before any constructive ideas were formed and then suddenly a load of songs came pouring out of me.  Amongst them was The Shantyman, although I don&#8217;t know exactly what the inspiration behind it was. Most of my songs take a long time from first draft to finished version, sometimes years, but this song progressed faster because of the interest shown by Tony O&#8217;Neil when he saw a rough draft.  Tony liked the song, but not all the verses, so I went home and rewrote some of them.  This led to the song making its debut at Bracknell Folk Festival in 1984, sung by Tony, and its live recording is a treasured possession.  From that first performance other people heard it and have taken to singing it&#8230;&#8221;</p>\n<p>Text and notes are quoted from The Shanty Crew&#8217;s 1989 recording, Stand To Yer<br />\nGround (PROP 1885A)</p>\n<p>MD<br />\nOct 00<br />\nThanks to Mudcat for the Digital Tradition!</p>\n",
    "parent": 0
  }
]