[
  {
    "id": 415017,
    "author": "wordpress",
    "authorUrl": "http://web.com",
    "date": "2020-07-02T18:46:53",
    "content": "<p>Thanks for finally talking about &gt; Update: Golden Horizon, ex-Flying Clipper,<br />\nWorld&#039;s Largest Sailing Ship, to Sail from UK Next YearOld<br />\nSalt Blog &lt; Liked it!</p>\n",
    "parent": 0
  },
  {
    "id": 414998,
    "author": "Joseph Blair",
    "authorUrl": "",
    "date": "2020-06-30T12:57:48",
    "content": "<p>Thanks Rick, appreciate the response. I&#8217;ve not seen anywhere that the dispute had actually been settled. I have been following the news articles over recent years and was very much looking forward to enjoying this magnificent ship under the Star Clipper banner, but must admit to now being very cautious until I actually see any articles that confirms the status. As everybody knows the whole travel and especially cruise sector is under incredible strain due to this awful covid-19 situation and now would not be a good time to chance my hard earned cash with a virtually unknown company, formed only a few months ago. Perhaps if they weather the storms of current market uncertainty and any legal disputes the situation would be different. Here&#8217;s hoping for calmer waters ahead!</p>\n",
    "parent": 0
  },
  {
    "id": 414997,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-06-30T11:28:19",
    "content": "<p>The last I read in the media, the shipyard has a clear title to the ship. I cannot confirm that this is the case. About a year ago, there was some sort of arbitration going on, which apparently did not resolve the dispute.</p>\n",
    "parent": 414996
  },
  {
    "id": 414996,
    "author": "Joseph Blair",
    "authorUrl": "",
    "date": "2020-06-30T11:11:39",
    "content": "<p>Isn&#8217;t there a legal case still in progress as to the lawful owner of this vessel? If so, wouldn&#8217;t it be risky to consider making bookings until the matter is confirmed to be settled?</p>\n",
    "parent": 0
  },
  {
    "id": 414991,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-06-29T15:25:01",
    "content": "<p>Her insurers might have something to say if it was suggested that Cape Horn was planned. It would be interesting to find out if they would place such limits on a vessel which is presumably certified as ocean going or just charge an extra premium.</p>\n",
    "parent": 0
  },
  {
    "id": 414983,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-06-28T17:28:49",
    "content": "<p>Their planned voyages so far look to be primarily eastbound, getting to the Indian Ocean via the Suez Canal. They include a circumnavigation of Australia which brings the ship briefly into the Southern Ocean. It would be amazing to see the ship transit Cape Horn. With the squares furling hydraulically, the operating crew shouldn&#8217;t have to spend much time aloft.</p>\n",
    "parent": 414982
  },
  {
    "id": 414982,
    "author": "Chris Roche",
    "authorUrl": "http://www.capehorners.org",
    "date": "2020-06-28T16:48:37",
    "content": "<p>SEACLOUD was 191 feet 6 inches truck to keel when I sailed in her for  6 months as deck crew in 1982 it was a stiff climb to the royals and there was no Dartford crossing bridge on the Thames when she came up to just below Tower bridge in 1981. Will GOLDEN HORIZON take on Cape Horn if she is to follow traditional prevailing wind patterns. Now that would be something to behold.</p>\n",
    "parent": 0
  },
  {
    "id": 414979,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-06-27T18:59:00",
    "content": "<p>I missed out that she would need to transit at low water 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 414978,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-06-27T18:56:05",
    "content": "<p>Well, if she is UK based she won&#8217;t be visiting London, the QE2 bridge over the River Thames has an Air draught of 53.9 metres (just under 177 feet) at MHWS and spring tides are around the 6 metre range so she might scrape under if the barometer is high but would risk getting neaped.</p>\n",
    "parent": 0
  },
  {
    "id": 414977,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-06-27T15:44:09",
    "content": "<p>The Royal Clipper has a mast height of 197&#8242; will fit under the George Washington Bridge and the Verrazano Narrows. My guess is that the Golden Horizon could as well.</p>\n",
    "parent": 414976
  },
  {
    "id": 414976,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-06-27T12:32:07",
    "content": "<p>Just wondering if they designed for bridge clearance?</p>\n",
    "parent": 0
  }
]