[
  {
    "id": 413022,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-12-13T16:13:11",
    "content": "<p>It was an Australian that shot-up New Zealand and killed people, not someone from New Zealand that was pulling the trigger!</p>\n<p>Yet the N. Z. government bans guns?</p>\n<p>No, I will not apologize for the stupid N. Z. priminister for banning guns or my comments!</p>\n",
    "parent": 0
  },
  {
    "id": 413021,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log;%20no%20longer%20published",
    "date": "2019-12-13T11:29:10",
    "content": "<p>The remark by Phil and the attitude growing daily in our Nation gave food for thought this morning. I lived and worked in New Zealand Phil and I believe that you are a decent person who made a thoughtless comment, perhaps you would like to apologize.<br />\nIt seems that it is now acceptable to follow the behaviour of our current Administration in saying anything about anybody or any country regardless of common decency or diplomatic standards.  Truly a person has been taken out of the construction site but not the construction site out of the person.  The level of discourtesy has made its way down through our society and is reflected in many different ways.<br />\nAs we start to celebrate the holiday season please let us resume being  thoughtful and polite to each other, respect the differences of other persons and nations.<br />\nOur Founding Fathers wrote a unique document in our Constitution it is what has attracted millions of immigrants, including myself, to live here and ask to become Citizens.  However those Founding Fathers wrote in the context of the 1700&#8217;s using English words in the meaning at that time.  The issue of guns was the result of a Civil War which became a War of Independence.  The Second Amendment is a problem for many immigrants personal beliefs who come from Nations with very different views and laws on the personal carrying of arms.<br />\nWe must not force our standards on other Nations to get our own way as has clearly been happening nor indeed should our Citizens get involved with other Nations about which they clearly know little or nothing including not even speaking that Nations language.<br />\nIt is important that in writing comments on this highly respected Blog that they are more thoughtful than many are.  None of us are expert in everything and therefore we must think first then write our comment.<br />\nEnjoy whatever holiday you are celebrating, for me its Christmas, my 83rd. birthday ( wow how did I get here!!) and New Year 2020.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 413019,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log;%20no%20longer%20published",
    "date": "2019-12-13T09:29:43",
    "content": "<p>Rather surprised at this cruel remark Phil particularly considering why NZ banned the guns.  Sadly it is tourists who are mostly those injured and killed in these incidents.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 413010,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-12-12T16:55:31",
    "content": "<p>Hay, the idiots recently banned guns, they still need a way to keep the population down.</p>\n",
    "parent": 0
  },
  {
    "id": 412997,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner",
    "authorUrl": "http://formerly%20Nautical%20Log;%20no%20longer%20published.",
    "date": "2019-12-11T09:56:30",
    "content": "<p>In the late 1950&#8217;s I was a Deck Officer with Union Steamship Coy. of NZ.  During that time I spent a couple of weeks with the RNZN Hydrographic Service surveying between Napier and White Island.<br />\nWith regard to their tourist industry NZ has made some very poor decisions which include &#8220;bungee&#8221; jumping, white water rafting, visits to active volcanos and thermal areas in a country that has regular earthquakes.  In each case over the years this has resulted in tragic accidents with injuries and deaths.  It is past time to review this type of tourism in a reasonable and responsible manner with a view to preventing further loss of lives.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 412989,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-12-10T16:24:18",
    "content": "<p>3-days ago:</p>\n<p>New Zealand is falling apart!</p>\n<p>Published on Dec 7, 2019<br />\nA dramatic collapse of a cliff was captured by a local resident at a New Zealand south island town that declared a &#8220;state of emergency&#8221; following the flooding nearby river, Saturday, December 7.<br />\nIt happened after a local state of emergency was declared, following heavy rain. (Reuters)<br />\n<a href=\"https://youtu.be/6BDRd2-XEMQ\" rel=\"nofollow ugc\">https://youtu.be/6BDRd2-XEMQ</a></p>\n",
    "parent": 0
  }
]