[
  {
    "id": 410840,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2019-06-07T15:28:43",
    "content": "<p>Its beginning to be reported in the UK<br />\nSee &#8211; <a href=\"https://www.bbc.co.uk/news/world-us-canada-48377930\" rel=\"nofollow ugc\">https://www.bbc.co.uk/news/world-us-canada-48377930</a><br />\nIt seems that should she be raised/restored many are determined that it will stay in the local area.<br />\nAs ever some sense money is to be made in various ways.</p>\n",
    "parent": 0
  },
  {
    "id": 410725,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2019-05-27T16:08:12",
    "content": "<p>Good article, Rick. This is an important find, historically. It demonstrates the value of smuggled human cargo that the captain would burn and scuttle the ship after delivery.</p>\n",
    "parent": 0
  },
  {
    "id": 410724,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2019-05-27T10:36:35",
    "content": "<p>Yes slavery was such an evil in all its forms and still is as it still goes on today, it is worth remembering however that without Thomas Clarkson the Britton, Wilberforce would never have got his bill through the British Parliament. How many know that the British anti slavery patrol took its last slave ship in 1987 when Fogarty Fegan the grandfather of his famous descendant awarded the Victoria Cross for his valiant fight in WWII in HMS Jervis Bay, that slaver was a Dhow off Zanzibar Island, Captain Fegan of HMS Turquoise had told the Sultan of Zanzibar he would fire his city if he did not stop slaving. It is worth remembering that without the African and the Arab the Europeans could not have operated the slave trade, a trade that the Drake and Hawkins found already going on in Africa  in 1572, they and others only turned it into a successful industrial enterprise. I sailed in the Freedom Schooner Amistad remembering not particularly slavery but, slavery from the perspective of the American diaspora when I joined the schooner out of Senegal in 2008 for her Atlantic crossing. Captain Bill Pinkney of African decent used to say that there are more people in unpaid servitude than there were ever in the days we regard as slavery, he said that in 2008. Clotilda would have been typical of the Baltimore clipper style of schooner at around 80 feet just the type of vessel used in the latter day slave trade Amistad replica is of a similar length but in her case she was  an inter Island transport and NOT a slave ship in her case the Amistad incident for which there is the film by Spielberg of the name morphed into the Amistad incident it can be found on the USA government web site as Americas in 1840 first human rights case and well worth a read in her case the actual slaver was Portuguese and named Tecora. I have yet to find an African who will admit they were accomplices in the trade.</p>\n",
    "parent": 0
  }
]