[
  {
    "id": 406963,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-08-26T07:40:01",
    "content": "<p>Advice for DT<br />\n&#8220;Treat others as you would wish to be treated&#8221;</p>\n",
    "parent": 0
  },
  {
    "id": 406835,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-08-13T15:58:16",
    "content": "<p>Oh yeah, and this.</p>\n<p>The Machias story reminds me of the time I was standing on the deck of a sailboat enjoying an early morning coffee, in a cove at Patos Island (NW Washington), watching a crowd of waterfowl feasting on whatever was on hand (or beak). Serenity was interrupted by the arrival of a Border Patrol boat with its row of huge outboards blasting away on the stern, a crew of theatrically-threatening BP agents encased in various tactical drag apparel on deck. </p>\n<p>The Border Patrol boat made a big show of swerving directly into the cluster of birds feeding from the water. For us ordinary mortals, pulling such a stunt in front of other witnesses such as the Coast Guard would have resulted in holy hell but of course these guys are above the law, or outside of it as a practical matter.</p>\n<p>They brought their bad attitude and ignorance of the American Way to the side of our boat and proceeded to behave as expected. And of course, if I didn&#8217;t want a great BF hassle, I had to pretend to like it. One wry expression and who knows where we&#8217;ll end up? &#8220;Why did you plough into those birds&#8221; could turn into &#8220;he was resisting us in the performance of our duties,&#8221; with life-altering results. Like I say, these fellas apparently don&#8217;t understand the American Way. </p>\n<p>But again, we get to vote for or against this kind of display. Lucky us, truly.</p>\n",
    "parent": 0
  },
  {
    "id": 406834,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-08-13T15:46:54",
    "content": "<p>Fortunately we get to vote for how we want to behave. Let&#8217;s remember to do that. </p>\n<p>Hint: &#8220;I promise&#8221; carries huge psychological weight with us humans, for technical reasons you can look up in the literature. &#8220;I promise to vote&#8221; would be a good thing to say out loud.</p>\n",
    "parent": 0
  },
  {
    "id": 406829,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-08-12T22:16:51",
    "content": "<p>Alas we can thank the POTUS for this crud.</p>\n<p>As Smokey the bear would say&#8230;..<br />\n&#8220;Only you can put out the forest fire&#8221;</p>\n",
    "parent": 0
  }
]