[
  {
    "id": 413799,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd)",
    "authorUrl": "http://Formerly%20Nautical%20Log%20(no%20longer%20published)",
    "date": "2020-03-15T19:44:55",
    "content": "<p>Irwin Bryan:<br />\nI addressed this point in a comment to a previous Post which might be helpful to answer your question.  Perhaps you could call your Coast Guard, however good luck with that as they are politically restricted !!</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 413793,
    "author": "Irwin Bryan",
    "authorUrl": "",
    "date": "2020-03-15T15:03:02",
    "content": "<p>I&#8217;m just wondering what the cruise lines are doing with their workers aboard their ships.<br />\nAre they staying aboard ships, disembarking to quarantine while closed,<br />\nheading to their homes by ship, or flying individually around the world to their homes?<br />\nAnd to see if as a group their health and impacts of the disease are being tracked.<br />\nDoes anyone know-the news hasn&#8217;t mentioned this.</p>\n",
    "parent": 0
  },
  {
    "id": 413775,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-03-14T22:17:51",
    "content": "<p>Names with held intentionally</p>\n",
    "parent": 0
  },
  {
    "id": 413774,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-03-14T22:16:10",
    "content": "<p>Some kind soul from New York came to Maine to buy a car.  They didnt buy the car, yet 20 locals are now at home because the idjut decided to spread the virus.  Isnt life wonderful?  Who needs a ship when tourists will do it anyways.</p>\n",
    "parent": 0
  },
  {
    "id": 413766,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-03-14T16:14:53",
    "content": "<p>ALL sports suspended, even the games!<br />\nSports on TV, they are reruns.<br />\nEven NASCAR has stopped, all ball games with crowds, only stores open, in some cities are drug stores, Walmarts, and CVS. Plus a very few others.</p>\n<p>Rent the movie &#8220;Dawn Of The Dead&#8221;!<br />\n&#8220;Come on get down with the sickness Song!</p>\n",
    "parent": 0
  },
  {
    "id": 413760,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd)",
    "authorUrl": "http://Formerly%20Nautical%20Log%20(no%20longer%20published)",
    "date": "2020-03-14T11:00:53",
    "content": "<p>Finally the Hotel Persons who now manager the cruise lines instead of the Professional Seafarers have been forced to shut down operations.<br />\nThey were left with little choice considering so many Ports around the World are refusing to let cruise ships enter.  Also of course that courageous whistleblower who released the e-mails from the Sales Department claiming that the tropical climate stops COVID-19 !!  Generally one is not a fan of whistleblowers however in this case it seems well justified to save lives.<br />\nFrom time in cruise ships one knows that the most troublesome cruises were when the Sale Department hosted groups of Travel Agents aboard.  The bars were opened at boarding so when we Officers conducted the departure Boat Drill many Agents were well lubricated which did not help one conduct a Boat Drill.  From that point on things went steadily downhill !!<br />\nThe Port of Miami has cruise ships moored alongside with more arriving and no doubt Port Everglades is in the same situation.  Perhaps at least some will have to anchor off, we shall see what happens this weekend no doubt.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  }
]