[
  {
    "id": 414322,
    "author": "William Allan Sheppard Smith",
    "authorUrl": "",
    "date": "2020-04-25T21:05:31",
    "content": "<p>Well, it makes for a damn fine photo op, entering and leaving harbours.</p>\n",
    "parent": 0
  },
  {
    "id": 414320,
    "author": "ws!",
    "authorUrl": "",
    "date": "2020-04-25T19:44:24",
    "content": "<p>With all of the conflicting forecasts, It’s  better to have, and not need, than to need, and not have.. Thank you,<br />\nUSNS Comfort, and God Speed!</p>\n",
    "parent": 0
  },
  {
    "id": 414319,
    "author": "alan walton",
    "authorUrl": "",
    "date": "2020-04-25T18:44:03",
    "content": "<p>Mayby their brain dead leading ordered them out as the new york mayor wouldnt kiss ass</p>\n",
    "parent": 0
  },
  {
    "id": 414318,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2020-04-25T11:39:29",
    "content": "<p>Scrubs should not be worn to and from work at a hospital or other clinical treatment area, says this former RN working Emergency and Intensive Care. It sounds like census is down in many hospitals, as only people with flu symptoms are seeking care. Nurses are actually being laid off in many places.</p>\n",
    "parent": 0
  },
  {
    "id": 414317,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-04-25T06:39:59",
    "content": "<p>@Willy<br />\nlogically, wearing scrubs should encourage people to social distance if they fear infection.<br />\nIn the UK medical staff are more likely to be treated as heros, shouldn&#8217;t your doctors and nurses deserve the same respect as military veterans? Your country&#8217;s media should be encouraging this attitude and shaming those that are being nasty to medical workers.</p>\n",
    "parent": 0
  },
  {
    "id": 414316,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-04-25T02:23:34",
    "content": "<p>On a similar note (doctors/nurses).  A friend of mine posted on FB that his wife no longer wears her nurse scrubs to work in NY.  Seems the public isnt so positive about people in scrubs.  For that matter they are to the point that she must be infected if she wears her scrubs.</p>\n",
    "parent": 0
  },
  {
    "id": 414314,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-04-24T16:14:34",
    "content": "<p>Would bleach ingesters be eligible for the Darwin Awards team prize?</p>\n",
    "parent": 0
  },
  {
    "id": 414313,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-04-24T15:19:12",
    "content": "<p>What a waste of an amazing asset in these troubled times. As an external observer America, why do these committed and professional people get kicked in the groin?</p>\n<p>Please wake up to your modern day politicised, point scoring politics.</p>\n<p>And please. Do not inject bleach, I love you too much.</p>\n",
    "parent": 0
  }
]