[
  {
    "id": 424053,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2021-11-12T18:27:49",
    "content": "<p>My prediction: They will strip it of anything of value and then dump the toxic remains up a creek* somewhere for the taxpayers to sort out.</p>\n",
    "parent": 0
  },
  {
    "id": 424050,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2021-11-12T12:11:42",
    "content": "<p>A castle for a billionaire, or a housing project.  A sea B&amp;B, or a museum. A hospital… Don’t mind me, just dreaming.</p>\n",
    "parent": 0
  },
  {
    "id": 424049,
    "author": "weredragon",
    "authorUrl": "",
    "date": "2021-11-12T10:07:56",
    "content": "<p>For those prices, we could mothball them and keep them in case the Chinese do sink a few flattops when they take Taiwan back</p>\n",
    "parent": 0
  },
  {
    "id": 424028,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-11-11T14:50:08",
    "content": "<p>What shred of evidence do we have from the empirical record that putting this work entirely into the hands of private enterprise will result in magically lower costs?</p>\n<p>The entire point of private enterprise is to divert money from customer objectives. If a civil servant takes money from the public purse and pockets it, that&#8217;s called &#8220;embezzlement.&#8221; But we keep on hiring the financial and functional equivalent of embezzlers and expecting to be delighted. Despite all evidence to the contrary, we continue to believe that making this choice to waste money by building in waste in the form of profit will somehow make things less expensive. </p>\n<p>Meanwhile, we have complete transparency with regard to financial accountability by our government, while money in private hands becomes a much more difficult accounting challenge. Again, over and over again, we choose &#8220;cloudy&#8221; over &#8220;clear,&#8221; despite a rich track record of failure by making that choice. </p>\n<p>Baffling.</p>\n",
    "parent": 0
  },
  {
    "id": 424027,
    "author": "Rob",
    "authorUrl": "",
    "date": "2021-11-11T13:22:32",
    "content": "<p>The PLA-N are preparing to help dispose of some of the Nimitz class.</p>\n",
    "parent": 0
  }
]