[
  {
    "id": 413041,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-12-17T13:01:17",
    "content": "<p>I am sure that you are right. There have been several references to &#8220;Navy ownership&#8221; in the press. They no doubt are references to the limited control the Navy has over the use and disposition of the sub.</p>\n",
    "parent": 413040
  },
  {
    "id": 413040,
    "author": "Captain Mary",
    "authorUrl": "http://www.lilacpreservationproject.org",
    "date": "2019-12-17T10:28:18",
    "content": "<p>It is probably incorrect that the Navy still owns the submarine.  If decommissioned and given to a museum, they do, however, still have a contractual say in how a museum disposes of their former vessel.  The basis of this rule is to ensure that a museum does not allow a vessel to fall into the hands of an enemy foreign power for re-use.  The museum is also not allowed to re-power and operate the vessel.  It must be treated as a historical artifact.  So, the Navy will need to approve the transfer to another museum.  Sadly, the Navy does not provide any funding to its museum ships.</p>\n",
    "parent": 0
  },
  {
    "id": 412946,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-12-06T16:05:39",
    "content": "<p>According to a google search.</p>\n<p>The Balao (SS-285) class was a welded, riveted, and high-tensile steel submarine &#8212; 311.8 feet long overall, with a 27.3-foot extreme beam, a height of 47.2 feet, and a 15.3-foot draft at surface trim. They displaced 1,525 tons standard surfaced and 2,424 tons submerged.</p>\n<p>15&#8242; 4&#8243; draft wont help with a 11&#8242; river depth</p>\n",
    "parent": 0
  },
  {
    "id": 412945,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-12-06T14:45:16",
    "content": "<p>Get the local fire brigade to set up high pressure hoses and wash the mud away on a falling tide (if the river is tidal). Call it a training exercise.</p>\n",
    "parent": 0
  },
  {
    "id": 412942,
    "author": "ws",
    "authorUrl": "",
    "date": "2019-12-06T11:36:46",
    "content": "<p>Progress, getting rid of the water was an issue..it&#8217;s no longer an issue..<br />\nIn WWII, Manitowoc Shipbuilding built the same Balao class submarines..<br />\nThese vessels were brought down the Mississippi river utilizing floating dry-docks</p>\n",
    "parent": 0
  },
  {
    "id": 412940,
    "author": "Capt. J. Vincent Collins",
    "authorUrl": "",
    "date": "2019-12-06T07:42:37",
    "content": "<p>The channel was dredged to 11 feet in 1971, (navigation by local knowledge), tells me it probably wasn&#8217;t even that deep. (NOAA 12337).<br />\nHow they are going to get that down the river without dredging, I don&#8217;t know.<br />\nI wonder too if the swing bridge has been welded shut.</p>\n<p>It must have been a bit of a chore to even have gotten that thing so far up that skinny part of the river, the last few turns and the bridge are very tight for a 300 foot vessel under tow.</p>\n<p>What is the draft of a Balao class sub???</p>\n",
    "parent": 0
  },
  {
    "id": 412936,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-12-05T19:20:46",
    "content": "<p>I am surprised they cant seal the sub and pressurise it to blow the water out.  I mean it is a submarine right?</p>\n",
    "parent": 0
  }
]