[
  {
    "id": 406350,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-06T19:55:32",
    "content": "<p>LOL, have it sink far enough and it will be like the sinking city attraction of Seattle.  Ok different in the sense Seattle was built on sawdust for landfill</p>\n",
    "parent": 0
  },
  {
    "id": 406342,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-06-05T14:43:45",
    "content": "<p>Willy,<br />\nNo, its not built right on the old ship.<br />\nNote the date on this:</p>\n<p>New, modernized Pearl Harbor USS Arizona Memorial visitor center opening Dec. 7<br />\nBY DEREK PAIVA NOV 29, 2010</p>\n<p>The USS Arizona Memorial Visitor Center was sinking slowly into the waters of Oahu’s Pearl Harbor.</p>\n<p>Not the actual USS Arizona Memorial, which since its 1962 dedication has rested solemnly in the middle of the harbor above the sunken hull of the famed World War II battleship. But the 30-year-old visitor center on the shores of Pearl Harbor, which annually prepared 1.5 million visitors for the ferry ride to the Alfred Preis-designed memorial.</p>\n<p>The center was built on filled-in waterfront land, which engineers hoped would eventually settle just 18 inches. Instead, over the years, areas of the center’s foundation had dropped up to 30 inches, bringing it perilously close to water level. In 2003, engineers gave the visitor center a life expectancy of five to 10 years.<br />\n<a href=\"https://www.hawaiimagazine.com/blogs/hawaii_today/2010/11/29/Pearl_Harbor_new_visitor_center_opening_December_7\" rel=\"nofollow ugc\">https://www.hawaiimagazine.com/blogs/hawaii_today/2010/11/29/Pearl_Harbor_new_visitor_center_opening_December_7</a></p>\n",
    "parent": 0
  },
  {
    "id": 406338,
    "author": "ROB",
    "authorUrl": "",
    "date": "2018-06-05T10:55:00",
    "content": "<p>SAD</p>\n",
    "parent": 0
  },
  {
    "id": 406337,
    "author": "ws",
    "authorUrl": "",
    "date": "2018-06-05T09:54:01",
    "content": "<p>How can this happen:<br />\nFirst Kilauea Volcano, and Now BB-39 Arizona Memorial.</p>\n",
    "parent": 0
  },
  {
    "id": 406332,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-04T22:17:44",
    "content": "<p>Excuse my above post.  IT IS NOT attached to the boat in any way.  It is on pilings driven into the mud alongside the Arizona.</p>\n",
    "parent": 0
  },
  {
    "id": 406331,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-06-04T22:08:15",
    "content": "<p>I am gathering the museum was built on the crumbling ship.  Where it should have been built on its own seperate pilings.  It is probably what they will have to do.  It is a quick easy fix.  That way the ship can crumble with out the weight of the museum ontop of it.  Alas when the museum is on its own pilings, divers will need to seperate it from the funnel that was used as a foundation.</p>\n",
    "parent": 0
  },
  {
    "id": 406329,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-06-04T16:25:37",
    "content": "<p>Lest we forget</p>\n",
    "parent": 0
  },
  {
    "id": 406327,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-06-04T15:03:46",
    "content": "<p>1962. 56 years ago, time for a little TLC.<br />\nI hope a solution is found soon for a key memorial that allows millions to respect their history and those that sacrificed their lives.</p>\n",
    "parent": 0
  }
]