[
  {
    "id": 415434,
    "author": "David Prieto",
    "authorUrl": "",
    "date": "2020-08-14T15:51:32",
    "content": "<p>How was it concluded that the enthusiasts have not found answers to the logistical challenges of moving the submarine? Was anyone interviewed from this group?</p>\n",
    "parent": 0
  },
  {
    "id": 415389,
    "author": "Louis Kleinman",
    "authorUrl": "http://www.waterfrontalliance.org",
    "date": "2020-08-09T09:15:50",
    "content": "<p>Your article reminded me of an event about 30years ago.  When my oldest was 7 years old we had arranged a birthday party for around 20 of his classmates on the Ling.  We thought it was going to be one of the best and would be a &#8216;forever remembrance&#8217; for him and has friends.  So we arranged transport over to NJ from Manhattan for these youngsters (both boys &amp; girls) thinking that after we would have cake, ice cream, gifts etc.</p>\n<p>We had no idea of the fears 7year olds would have going into the &#8216;claustrophobic&#8217; confines of a submarine.  Half the kids refused to enter. The balance couldn&#8217;t get out of the Ling fast enough.  It took all we could do to quell the crying and of course the taunts to some of the girls by a few of the boys who were convinced they were extremely brave to actually enter the boat.  We were the talk of my son&#8217;s class for the next week and did provide the kind of memories we hadn&#8217;t bargained for.</p>\n<p>Thank you for your story and bringing back to me an almost hidden memory.</p>\n<p>Louis</p>\n",
    "parent": 0
  },
  {
    "id": 415387,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-08-09T06:50:52",
    "content": "<p>As a submariner this bothers me that we can&#8217;t find a solution.  As a realist, she needs to be cut up and put out of her misery.  Or at the very least parted out to viable submarine museums.  Too many brave men went to sea in her to allow her to rot in a New Jersey hellhole.  There has been ample time for a group to take her over, including SUBVETS, and it hasn&#8217;t happened.  Time to cut ties.</p>\n",
    "parent": 0
  },
  {
    "id": 415384,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-08-08T17:56:31",
    "content": "<p>Buoancy is the only way to get her freed.  It may mean getting other items there to lift her higher out of the mud.  Yet if the channel she was brought in on is too silted.  Getting her higher out of the water will be the least of her concerns.</p>\n",
    "parent": 0
  },
  {
    "id": 415382,
    "author": "will",
    "authorUrl": "https://tugster.wordpress.com/",
    "date": "2020-08-08T16:54:46",
    "content": "<p>Thx for the update.</p>\n",
    "parent": 0
  }
]