[
  {
    "id": 417115,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-10-25T03:44:55",
    "content": "<p>Hats off the to crew and&#8211; it&#8217;s nice to know we have some ships that still can do this without the reduction gears exploding, mysterious fractures appearing etc.</p>\n",
    "parent": 0
  },
  {
    "id": 417109,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-10-24T20:47:22",
    "content": "<p>On the return trip to Quebec, the Canadian icebreaker CCGS Des Groseilliers transited the Northwest Passage after spending more than a year locked in the Arctic ice in 1998 as part of the SHEBA program.  Although part of the science crew, I was lucky to be able to stay on the ship for this part of the passage.  </p>\n<p>Every day, I grabbed a cup of coffee and spent the morning on the bridge.  One day the captain was a little miffed when he received a message from headquarters asking if he could paint the ship on the way back since high-level gov&#8217;t officials were going to great the ship.  The captain emphatically said no.  Keep in mind that the Canadian Coast Guard operates with a crew much smaller that US Coast Guard and Navy and is more &#8220;merchant marine&#8221; like.  The next day the captain received another message asking if he would at least paint one side of the ship, i.e. the starboard side facing the dignitaries.  Again his answer was no, bear in mind we were in the Arctic in late October!</p>\n",
    "parent": 0
  },
  {
    "id": 417080,
    "author": "Cdr. Peter Quinton,USN (Ret.)",
    "authorUrl": "",
    "date": "2020-10-23T17:41:44",
    "content": "<p>I thought I had it hard with 89 consecutive days at sea, off the coast of Viet Nam!!</p>\n",
    "parent": 0
  },
  {
    "id": 417073,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-10-23T07:32:47",
    "content": "<p>As Torpedoman Mates are the sub service equivalent to a target&#8217;s Boatswains Mates (we wore many hats) I am aware of what camels are! We had a special set of them because of a classified sonar system.  It meant that just about 100% of port calls we made we had to anchor out.  And because subs were particularly inadept at using the anchor, it meant there had to be a mooring buoy, which in turn limited us to only certain ports.  So in a period of 2 years we spent 635 days of them at sea, most of them where it was real cold.  Because we had a rubberized hull coating, the paint didn&#8217;t look that bad pulling in, but our bill at the base liquor store dripped red that first day back&#8230;</p>\n<p>I can feel for the crew of the Stout.  God bless them all&#8230;</p>\n",
    "parent": 0
  },
  {
    "id": 417066,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-10-22T19:41:45",
    "content": "<p>So the ship was resupplied at sea.  Yet grey paint isnt a supply?</p>\n",
    "parent": 0
  },
  {
    "id": 417063,
    "author": "Gary Buckhannon",
    "authorUrl": "",
    "date": "2020-10-22T16:31:59",
    "content": "<p>Guess they didn`t want to break out the stages and bosun chairs since there are no camels at sea to get down low.  All my boatswains mate brothers will know what a camel is.</p>\n<p>Jean-Pierre, with every house seeming painted grey inside now, maybe it`s hard to find.  Me, I seen enough Haze Grey to last me a lifetime.</p>\n<p>Don`t want it in my house&#8230;..In spite of my wife&#8217;s harping.</p>\n<p>And what`s sad, they`ll ask the short timers to re-up when they get short?</p>\n<p>After 215 days of solid underway.</p>\n<p>They do deserve a medal and some fleet liberty.</p>\n",
    "parent": 0
  },
  {
    "id": 417062,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-10-22T15:04:34",
    "content": "<p>After how many days at sea did they run out of grey paint?</p>\n",
    "parent": 0
  },
  {
    "id": 417061,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-10-22T14:43:32",
    "content": "<p>All these guys deserve a medal.</p>\n<p>Well done!</p>\n",
    "parent": 0
  }
]