[
  {
    "id": 414039,
    "author": "Bob Koski",
    "authorUrl": "",
    "date": "2020-03-30T09:50:57",
    "content": "<p>Back when I was aboard Ike, the Hull Techs had to periodically use a special power washer to flush out the plumbing when it clogged.  Part of the problem is moving sewage effectively when you cannot use a simple gravity feed.  A lot of sewage tends to remain in certain pipes depending on the ship&#8217;s trim.  Sloshing in those same pipes during rough seas can create water hammers strong enough to rupture the pipe.</p>\n<p>Big problems need big solutions, but half-baked solutions are no solution at all.  Add the Ford&#8217;s flukey sewage system to her Catapult, arresting gear, weapons elevators, and other problems on supposedly advanced shipboard systems.</p>\n",
    "parent": 0
  },
  {
    "id": 413989,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-03-26T16:52:00",
    "content": "<p>The system is described as based on the toilet and sewage systems found on commercial airliners, just scaled up for 4,000 users.</p>\n",
    "parent": 0
  },
  {
    "id": 413988,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-03-26T16:42:19",
    "content": "<p>If clogged toilets are not in the picture, it must not be a boat. </p>\n<p>More seriously: curious to know if acid wash is due to flushing with salt water, the old urine crystallization problem? Surely not?</p>\n",
    "parent": 0
  },
  {
    "id": 413985,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2020-03-26T15:20:38",
    "content": "<p>The US Navy needs to stop contracting on a cost plus basis.  And then not take acceptance until the thing works properly.  Right now they need to give it back to Northrup Grumman and not give them another penny on future contracts until everything passes a stringent sea trials over an extended at sea period, not this out and in 2 days later and call it good.</p>\n",
    "parent": 0
  }
]