[
  {
    "id": 416558,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-10-05T05:39:00",
    "content": "<p>History should be taught more in schools, it is often perceived as not necessary but, for example, if more US citizens were aware of the similarities between the economic situation and social status in your country and that of France before the revolution you could see which direction things are headed.</p>\n",
    "parent": 0
  },
  {
    "id": 416547,
    "author": "Laurene Eldred",
    "authorUrl": "",
    "date": "2020-10-04T13:37:20",
    "content": "<p>That is a November 2018 article.  December 2018 says:  &#8220;The FBI says the Proud Boys are not an extremist group after all&#8221;.   Politics aside, thank you for the article.  I thought everyone living in this area knew this history.  Just found out many 40 year olds in this area with Kaiser Permanente Health Insurance, don&#8217;t know the background of the name.</p>\n",
    "parent": 0
  },
  {
    "id": 416484,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-10-01T13:33:10",
    "content": "<p>The FBI now classifies the far-right Proud Boys as an “extremist group with ties to white nationalism”, according to a document produced by Washington state law enforcement.</p>\n<p><a href=\"https://www.theguardian.com/world/2018/nov/19/proud-boys-fbi-classification-extremist-group-white-nationalism-report\" rel=\"nofollow ugc\">https://www.theguardian.com/world/2018/nov/19/proud-boys-fbi-classification-extremist-group-white-nationalism-report</a></p>\n",
    "parent": 0
  },
  {
    "id": 416482,
    "author": "Laurene Eldred",
    "authorUrl": "",
    "date": "2020-10-01T11:48:41",
    "content": "<p>I am not sure the &#8220;Proud Boys&#8221; can be considered a white nationalist group, when their leader is Black.<br />\nMy uncle was living at Vanport when it flooded.  It was home to some of the first integrated schools in the country, where the Black students were definitely a minority.  Vanport was made up of approximately   26,000 Whites and 6,000 Blacks and no Japanese.  Less than a mile away, the Portland Stockyards was being used as a gathering center for the Japanese residents of the Pacific Northwest who were then sent to the internment camps.<br />\n<a href=\"https://www.oregonlive.com/portland/2017/02/portland_japanese_internment.html\" rel=\"nofollow ugc\">https://www.oregonlive.com/portland/2017/02/portland_japanese_internment.html</a></p>\n",
    "parent": 0
  },
  {
    "id": 416481,
    "author": "Jan Christensen",
    "authorUrl": "",
    "date": "2020-10-01T09:42:17",
    "content": "<p>Another part of our history that spent too long in the shadows.</p>\n",
    "parent": 0
  }
]