[
  {
    "id": 419642,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2021-02-06T15:38:14",
    "content": "<p>There was an amusing story going around at the time of Ellen MacArthur&#8217;s record breaking circumnavigation that a customer of B&amp;Q (the company that sponsored her) had complained that it took longer for them to deliver an new kitchen from a store a few miles from their home than Ellen took to sail right around the world.<br />\nWell done to both of them and all the other competing women for breaking through the glass companionway.</p>\n",
    "parent": 0
  },
  {
    "id": 419641,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2021-02-06T15:21:41",
    "content": "<p>Further to Rick and thinking about the practical outcomes of Cremer&#8217;s achievement, there&#8217;s a lot of fossilized mentality still in effect and shaping possibilities for equality, acutely in need of object lessons. </p>\n<p>Here&#8217;s a good lesson to dislodge minds stuck on reefs. </p>\n<p>&#8220;Oh, a woman can&#8217;t do [thing] because [prejudicial belief]. </p>\n<p>Really? Because the empirical data in hand suggests thinking needs to be updated. Explain how the data is wrong, in the face of reality. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 419640,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2021-02-06T13:29:06",
    "content": "<p>Linda,<br />\nI agree that we shouldn&#8217;t separate women from the race. Indeed the Vendee Globe has never done so. All sailors, regardless of gender, compete on an equal basis. I do however think it is worthwhile to acknowledge women in the race. In this year&#8217;s race, there are now three times as many women sailing in the Vendee Globe than in any time in the race&#8217;s history. That alone is worth celebrating.</p>\n",
    "parent": 419626
  },
  {
    "id": 419626,
    "author": "Linda Collison",
    "authorUrl": "http://www.LindaCollison.com",
    "date": "2021-02-05T23:03:16",
    "content": "<p>Congratulations Clarisse Cremer! I don’t know why we have to separate the men from the women in the awards of this particular competition.</p>\n",
    "parent": 0
  }
]