[
  {
    "id": 418108,
    "author": "MIke",
    "authorUrl": "",
    "date": "2020-12-03T07:56:31",
    "content": "<p>This is a high risk activity. The risks are accepted by the participants as a concomitant  of glory or self fulfilment. The risks in any circumnavigation have always been there, from Magellan to Slocum to Knox Jonston. Then the risks were even greater than now. No weather info, no electronic nav. gear, self steering by string and bits of wood, no hope of rescue by any means.  To go round at any winning speed today is like the early days of any sort of flight. First to leave the ground, to cross the English Channel, the Atlantic, to fly a jet, etc. etc. No  doubt we will all benefit from the new  materials these courageous sailors are pioneering. When it`s all safe and proven, racers will be risking their lives on the next things.</p>\n",
    "parent": 0
  },
  {
    "id": 418102,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-02T18:11:29",
    "content": "<p>I thought following the race was going to be a relief from all the political stupidity that is in the news but it is causing me even more stress and worry.<br />\nThere must be a hell of a lot of flotsam an Jetsam out there. Or maybe the strange noise foiling boats make is attracting curious wildlife to investigate and get in the way.<br />\nThere is certainly going to be even more pollution with all the wreckage these boats are leaving in their wake.</p>\n",
    "parent": 0
  },
  {
    "id": 418101,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-02T17:58:21",
    "content": "<p>And now Sebastien Simon&#8217;s boat Arkea Paprec and Samantha Davies&#8217; Initiatives Coeur<br />\nhave both hit unidentified objects. Both are heading north out of the severe weather. Arkea Paprec is taking on water so I don&#8217;t imagine it will finish the race.</p>\n",
    "parent": 0
  },
  {
    "id": 418094,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-12-02T09:48:35",
    "content": "<p>There is obviously much that is not understood about the mechanics of carbon fiber laminate failure. Hugo Boss suffered keel damage last year in the Transat Jacques Vabre. The hull was extensively inspected and Non-Destructively Tested and was found to be undamaged. Nevertheless, the bow began to fracture early in the race. Was it something that the NDT missed or just inadequate scantlings? </p>\n<p>Likewise, did the PRB break in half in way of the new foils installed a few years ago?  It would be very interesting to have answers to these and related questions.</p>\n",
    "parent": 418077
  },
  {
    "id": 418093,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-12-02T09:41:11",
    "content": "<p>Le Cam did a great job, as did Escoffier. In a matter of minutes, Escoffier sent off a text message, activated his EPIRB, donned a survival suit (which can take some doing), and got into a liferaft as the PRB was sinking under him. Everyone involved in the rescue performed extremely well.</p>\n",
    "parent": 418083
  },
  {
    "id": 418084,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-02T06:13:38",
    "content": "<p>It seems that nautical architects, engineers and boat-builders are at the de Havilland Comet airliner stage of development.<br />\nSeventy years on and nothing learned from history about protecting the lives of people by proper testing.</p>\n",
    "parent": 0
  },
  {
    "id": 418083,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-12-02T06:01:23",
    "content": "<p>Regardless of the above, this was an awesome piece of seamanship by le Cam.</p>\n",
    "parent": 0
  },
  {
    "id": 418077,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-12-01T23:29:48",
    "content": "<p>Fracture mechanics of carbon are pretty unforgiving. </p>\n<p>This is an engineering trade. Weight reduction is purchased in trade for tolerance to ordinary real world events, such as deep scratches.</p>\n<p>Maybe a little too much tolerance has been traded away. The number of mysterious failures or insults that might normally be shrugged off leading to complete failure is pretty striking.</p>\n",
    "parent": 0
  },
  {
    "id": 418063,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-01T14:55:33",
    "content": "<p>Looking at the designs online.  A sailboat is designed so that the bow is supported by the water it floats in.  If anything the designs show a lack of frames that are normally in the construction.  IE the builders have removed much of the framework.  Where the prints of a normal sailboat have frames every 2 feet.  These supposed yachts are one frame for every 6 to 8 feet apart.  No diagonal bracing between the frames to help take up the stresses.  Like they expect the outside skin to take up what is missing.</p>\n",
    "parent": 0
  },
  {
    "id": 418060,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-12-01T13:03:06",
    "content": "<p>Time will tell if the rest of the foiling fleet holds together during the race. Hugo Boss was a newer boat with obvious structural issues. PRB was relatively old, at 11 years and was not built as a foiler. SHe was retro-fitted with foils in 2017. It seems likely that the addition of foils may have weakened the overall hull structure.</p>\n",
    "parent": 418059
  },
  {
    "id": 418059,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-01T12:26:31",
    "content": "<p>There is something inherently wrong with the design of these boats, this is the second one to suffer from structural failure and they are not even in the dangerous waters beyond Cape of Good Hope. I hope they black flag the race and send all those who have not yet passed the Cape into Capetown whilst there is an analysis of the stresses on the forward areas otherwise it is possible that there will be an avoidable tragedy.</p>\n",
    "parent": 0
  }
]