[
  {
    "id": 409991,
    "author": "Check the facts",
    "authorUrl": "",
    "date": "2019-03-26T17:31:43",
    "content": "<p>Wartsila has signed retrofit contract in December, so there is no Wartsila engines yet (they probably wish they would). Now she has Mak / GM engines.<br />\nCurrent setup by the owner: <a href=\"https://www.hagland.com/fleet/hagland-captain/\" rel=\"nofollow ugc\">https://www.hagland.com/fleet/hagland-captain/</a></p>\n",
    "parent": 0
  },
  {
    "id": 409987,
    "author": "ws",
    "authorUrl": "",
    "date": "2019-03-26T10:48:39",
    "content": "<p>Viking Sky: MAN Engines, Volkswagen</p>\n<p>Hagland Captain: Wartsila Battery electric Hybrid propulsion system</p>\n<p><a href=\"https://www.wartsila.com/media/news/08-02-2019-wartsila-to-deliver-world-s-first-hybrid-retrofit-for-short-sea-shipping-vessel-2376827\" rel=\"nofollow ugc\">https://www.wartsila.com/media/news/08-02-2019-wartsila-to-deliver-world-s-first-hybrid-retrofit-for-short-sea-shipping-vessel-2376827</a></p>\n",
    "parent": 0
  },
  {
    "id": 409984,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-25T23:40:27",
    "content": "<p>There is another possibility.  Where it has been mentioned that these ships are using computers.  There could have been a hacker whom made the bad decision of what would happen if&#8230;&#8230;&#8230;&#8230;</p>\n<p>I hope this isnt the case, yet with todays technology it wouldnt surprise me.</p>\n",
    "parent": 0
  },
  {
    "id": 409980,
    "author": "Kate McGuffin",
    "authorUrl": "",
    "date": "2019-03-25T21:43:04",
    "content": "<p>It seems cruise ship propulsion systems have a difficult task. The ships are floating apartment blocks. The mid and large sized ships must be very challenging to maneuver around even the largest port. Their size alone will catch every bit of breeze to be pushed around. I read last year that several shipyards are trying to get a dry dock for the larger ships built in the Caribbean so they don&#8217;t have to keep limping back to Europe for propulsion system issues. Apparently minor ground and rock hits are also common for Caribbean routed ships. Anthem of the Seas and her sisters all seem to have had problems when less than 2 years old so not just Fincantieri. </p>\n<p>Wartsila must be in a bit of panic with the two failures this last weekend. In sight of each other Viking Sky and cargo vessel Hagland Captain both lost engines. It seems Hagland Captain is Wartsila&#8217;s first hybrid retrofit short sea cargo ship. Seems she was delivered in February of this year with the fitting of battery powered engines for short 30 minute use of getting in or out of port with minimum emissions. </p>\n<p>My maritime knowledge is minimal but I hope the discussions between professionals will remain more public. Was it shifting engine fuels that triggered a shutdown. Water coming in through air vents. Some other hardware, software or seal issue because of the heavy rolling. I wondered if the heavy seas caused the propellers to be completely out of water (no tension) and then in water with the ship being wind blown (extreme tension) repeatedly and it possibly over straining the entire system. Or causing too much strain on the propeller shaft. Speculation, yes but it keeps us learning.</p>\n",
    "parent": 0
  }
]