[
  {
    "id": 413739,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-03-13T09:56:49",
    "content": "<p>Captain,</p>\n<p>Your point is well taken. If it makes sense to shut down Princess for two months to ensure the health and safety of the passengers and crew, then the same rationale would apply to Carnival&#8217;s nine other cruise line brands. Likewise, the same would apply to Royal Caribbean and its six cruise line brands.</p>\n",
    "parent": 413732
  },
  {
    "id": 413738,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (ret'd)",
    "authorUrl": "http://Formerly%20Nautical%20Log%20(no%20longer%20published)",
    "date": "2020-03-13T09:34:04",
    "content": "<p>An update to my comment above.<br />\nThe IMO has closed its London Office as a result of the corona virus.  With most operations giving maximum attention and taking helpful actions it is away past time for the cruise lines to come to their senses and shut down. Talking to passengers many are deeply concerned, are declining to sail and of course this being America land of lawsuits and lawyers filing actions against these same cruise lines.  Yet another cruise ship operated by Fred Olsen Cruises has five cases on board and is changing its routing.  Here in Florida passenger &#8220;Greeters&#8221; at Port Everglades have tested positive and of course in these position they interacted with hundreds of persons boarding several cruise ships.<br />\nOne definition of an insane person is one who repeats the same action over and over again with the hope of a different result.<br />\nYes I AM angry with my former employers for behaving with this rank carelessness.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 413732,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner.",
    "authorUrl": "http://Formerly%20Nautical%20Log'%20(no%20longer%20published)",
    "date": "2020-03-12T19:37:14",
    "content": "<p>By suspending the cruises of its Princess brand vessels the Carnival Group has set a precedent for itself.<br />\nCarnival Group brands include its original company Carnival Cruise Lines, Princess Cruises, Holland America Line, Seabourn, Cunard, AIDA Cruises, Costa Cruises, P&amp;O (UK), P&amp;O(AUS).<br />\nIt is therefore easy to understand its political influence, its influence on the IMO, and on the Maritime Rules and Regulations enforcement authorities such as the MCA, and the various Coastguards quite apart from having had the experience of see it in action first hand as a cruise ship Officer<br />\nThe Group should now rise to the occasion by suspending operations until the coronavirus passes, as we are being told it will.  Also with the travel restrictions now in place on European Union Nations the exchanging of crews for these ships have been made extremely difficult.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  }
]