[
  {
    "id": 414459,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-05-10T14:48:23",
    "content": "<p>Great story, Doug. Thanks.</p>\n",
    "parent": 414458
  },
  {
    "id": 414458,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-05-10T14:09:02",
    "content": "<p>It&#8217;s a small world.</p>\n<p>A few years ago my brother and I were anchored in Echo Bay at the Sucia island group, situated pretty far out in the anchorage where it&#8217;s quieter (this was summer). We&#8217;d set the hook sucked up to the N of North Finger Island, appropriate for the predicted overnight SE wind which in any case was supposed to be nothing special. </p>\n<p><i>Zodiac</i> pulled in after us, dropping her anchor directly east and a bit further out, still sheltered against SE winds.</p>\n<p>At about 2:30a I woke up to a lot of boat motion, lovely aeolian singing in the rigging etc. The wind was hitting 20-25 knots, straight easterly. Despite what looked like us having a firm grip in the ground based on GPS, I popped my head out of the hatch to take a look around. </p>\n<p>Lo, we&#8217;re still parked solidly but <i>Zodiac</i> is getting closer, fast! With 250&#8242; out we&#8217;ll need to slip the chain&#8211; no way is the anchor going to come up fast enough. I banged on my brother&#8217;s cabin door, threw on a PFD, ran to start the engine, grabbed a fender to buoy the rode and as my brother emerged thought I was just about to do in reality what I&#8217;d only read about. </p>\n<p>I&#8217;m delighted to say that at this point <i>Zodiac&#8217;s</i> deck lights came, crew emerged like ants from a nest poked with a stick and within a couple of minutes they had the situation squared away.</p>\n<p>I&#8217;m guessing that <i>Zodiac&#8217;s</i> regular visits to this anchorage with its excellent holding and generally benign conditions in summer caused &#8220;scope creep&#8221; to happen. Why use 4:1 when 3:1 seems perfectly good? 🙂</p>\n",
    "parent": 0
  }
]