[
  {
    "id": 443488,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2025-11-19T16:53:40",
    "content": "<p>More MAGA whataboutism. That the best you&#8217;ve got? The blog post is about the unauthorized attacks on civilian boats, killing unidentified sailors by the Trump regime. Under international and US domestic law, these attacks are nothing less than murder. (If the term regime, offends you I will be happy to refer to them as thugs or criminals, which also applies.) </p>\n<p>Your idiot would-be king Trump justifies the attacks by saying the United States is in an “armed conflict” with drug cartels and vowing to “destroy Venezuelan terrorists and trafficking networks.” Nevertheless the Trump regime has not provided any positive identification of those killed, nor evidence that the boats were carrying drugs. Neither have they sought congressional approval as constitutionally required.</p>\n<p>Your what-about drone strikes during the Obama administration, only highlights the illegality of the King Donnie&#8217;s murderous rampage. Regardless of one views Obama&#8217;s aggressive foreign policy, it was supported by congressional authorization. The strikes were established by a formal, high-level approval process, detailed in a classified 2013 Presidential Policy Guidance (PPG), to govern these operations. The Trump attacks are the actions of a criminal mob using the deaths of Venezuelan and Columbian mariners as sacrificial props to provide distractions from the pedo president&#8217;s other crimes.</p>\n",
    "parent": 443039
  },
  {
    "id": 443039,
    "author": "Katakun",
    "authorUrl": "",
    "date": "2025-09-07T15:27:31",
    "content": "<p>Where were all these arm chair lawyers wringing their hands during the Obama administration? </p>\n<p>Obama authorized 563 drone strikes on mostly Pakistan, Somalia and Yemen killing 400 to 800 civilians as &#8220;collateral damage&#8221;.  One of those specifically targeted was an American citizen in Yemen.</p>\n<p>You reveal your Trump Derangement Syndrome bias by using a pejorative when calling the democratically elected president the &#8220;Trump Regime&#8221;&#8230;.we save the term Regime for dictators we don&#8217;t like such as Assad and Sadam Hussien.</p>\n<p>Since when does the law only apply to Presidents we don&#8217;t like?</p>\n",
    "parent": 0
  },
  {
    "id": 443022,
    "author": "Craig Northacker",
    "authorUrl": "",
    "date": "2025-09-05T18:07:23",
    "content": "<p>Unnamed experts are a convenient tool.  The legal beagles are not the ones on the high seas experiencing boarding of unfriendly vessels.  They also are ignoring the use of drugs as a method to destabilize a nation.  The UN is a hypocritical bunch of opportunists and has allowed itself to be exploited for personal gain for a very long time.  They often exhibited poor financial controls when I was working for a bank that handled their accounts.  The expressions of opinion by these people need to include data on the violence in various cities including numbers and types of casualties to include addicts, loss of GNP both with social programs for drug addiction as well as loss of economic production by those impacted &#8211; including families.  And then, of course, we have the cost to families in terms of anguish, economic losses, unplanned hospital and funerals.   These experts are not &#8211; because they have failed miserably to incorporate the full context.  Sadly they are overpaid, often at universities who themselves have questionable practices running the education racket.  I&#8217;m just the old CPA who apparently been around a lot more blocks than these actors parading as &#8220;experts&#8221;.</p>\n",
    "parent": 0
  }
]