[
  {
    "id": 416408,
    "author": "Peter, retired Captain",
    "authorUrl": "",
    "date": "2020-09-26T15:39:31",
    "content": "<p>According to history among the chinese (from President Xi Jingen in thought)<br />\nTribes of red skin men, between 15,000 to 12,000 years ago, fought their way across China to the coast, built 2 mast-sail vessels and sailed across the pacific to South America. The recent study noted above provides some affirmation to President Xi&#8217;s witness.</p>\n",
    "parent": 0
  },
  {
    "id": 416407,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-09-26T15:38:27",
    "content": "<p>No, I won&#8217;t search my DNA.<br />\nNo matter what they claim, someone will always get in and find the data. Same with hair donations, they want your name! My hair is almost to my waist now, but I&#8217;d rather shave my head at home and burn my hair than give it to the Government for DNA testing!</p>\n",
    "parent": 0
  },
  {
    "id": 416404,
    "author": "Phil",
    "authorUrl": "",
    "date": "2020-09-26T14:22:35",
    "content": "<p>My grandmother on my mother&#8217;s side was 100 percent Blackfoot, that make me one quarter Blackfoot. My skin tone and high cheekbones show it.</p>\n",
    "parent": 0
  },
  {
    "id": 416403,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-09-26T13:33:07",
    "content": "<p>The term Polynesian is no doubt incorrect. There appear to be genetically related peoples in Asia and South America dating back at least 17,000 years. It appears likely that these peoples traveled across the Pacific as the Bering land bridge was blocked by glaciers during that time.</p>\n",
    "parent": 0
  },
  {
    "id": 416398,
    "author": "Kevin",
    "authorUrl": "",
    "date": "2020-09-26T00:19:13",
    "content": "<p>Joan &#8211; I don&#8217;t see where anyone is saying that there were Polynesians 17,000 years ago.  The haplogroup B2 is thought to have originated in Asia ~17,000 years ago.  The Nature article proposes a ~1200 CE contact between Polynesians and Native Americans.  There were definitely Polynesians 800 years ago.</p>\n",
    "parent": 0
  },
  {
    "id": 416395,
    "author": "Joan Druett",
    "authorUrl": "http://joan-druett.blogspot.%20com",
    "date": "2020-09-25T19:22:25",
    "content": "<p>There were no Polynesians in the Pacific 17,000 years ago.  This is Heyerdahl thinking.</p>\n",
    "parent": 0
  }
]