[
  {
    "id": 412964,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-12-08T11:39:52",
    "content": "<p>So you defend the war criminal, who intimidated witnesses not to speak against him, and defame the entire US Navy as an institution that cannot be trusted with the nation’s defense.  Gallagher&#8217;s crimes are clear regardless of the outcome of the trial. But you attack the military. I guess that says it all.</p>\n<p><a href=\"https://www.businessinsider.com/seal-accused-of-war-crimes-allegedly-threatened-to-kill-teammates-2019-4\" target=\"_blank\" rel=\"noopener noreferrer nofollow ugc\">Navy SEAL charged with war crimes accused of threatening to kill teammates if they talked, court documents show</a></p>\n",
    "parent": 412961
  },
  {
    "id": 412961,
    "author": "Richard W Comerford",
    "authorUrl": "",
    "date": "2019-12-08T02:48:47",
    "content": "<p>Gallagher was originally charged with a 22-count violation of the UCMJ. 21 of the 22 counts were either dismissed or the jury found Gallagher not guilty as charged. </p>\n<p>Gallagher was found guilty of one count of posing with the body of an unidentified male who might or might not have been a member of ISIS. Posing alongside of Gallagher in the photo were 11-Navy Seals to include two commissioned officers and the same SEALS who had sworn under oath that Gallagher had purportedly murdered three people. To date no other SEAL has been prosecuted for posing with said body.</p>\n<p>Gallagher was not found guilty of a war crime. He is not a war criminal. The misconduct of the Navy in the Gallagher case reveals a corrupt and incompetent organization that cannot be trusted with the nation&#8217;s defense.</p>\n<p>Richard W Comerford</p>\n",
    "parent": 0
  },
  {
    "id": 412879,
    "author": "Ron Wilkinson",
    "authorUrl": "",
    "date": "2019-11-26T15:13:47",
    "content": "<p>Gallagher is a war criminal. The Ford is a sign of the systemic problems with procuring and contracts between the Pentagon and contractors which has been going on for decades. That also goes for planning of those purchases by the pentagon, the types of systems a weapons needed.</p>\n",
    "parent": 0
  },
  {
    "id": 412874,
    "author": "David Ray",
    "authorUrl": "",
    "date": "2019-11-26T12:30:56",
    "content": "<p>No mention that this guy Spencer wanted to make a back door deal, his skirts are not clean. Makes you wonder about back door deals on the floating airplane barge. I for one do not trust him</p>\n",
    "parent": 0
  },
  {
    "id": 412873,
    "author": "Total",
    "authorUrl": "",
    "date": "2019-11-26T10:33:45",
    "content": "<p><i>“A “war criminal”……..or a so called one due to the widespread PC attitude now run amok in the U.S. Military after 8 years of the uberleft OHbummurr MISadministration? One just might wonder????????????</p>\n<p></i></p>\n<p>No, really one might not.</p>\n",
    "parent": 0
  },
  {
    "id": 412867,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-11-25T22:14:23",
    "content": "<p>Looking at the evolution of weapons systems evolution over the past few decades, the problems with such as these latest aircraft carriers are simply the next step in a continuing, long decline. </p>\n<p>Contractors operate in an atmosphere of effective impunity against failure to deliver. It&#8217;s especially astounding to note that the largest are able to routinely sue the only customer for particular of their products, and that customer continues to come back with tender requests.</p>\n<p>It&#8217;s another style of &#8220;too big to fail.&#8221; </p>\n<p>Re the particular crime in question, if &#8220;PC&#8221; means abiding by treaties we signed, and if &#8220;PC&#8221; means we don&#8217;t communicate to our adversaries that we&#8217;re OK with abuse of <i>our</i> soldiers and civilians, then &#8220;PC&#8221; translates into &#8220;law-abiding&#8221; and &#8220;common sense.&#8221; If we don&#8217;t want to respect the law, we should change it or declare ourselves lawless, and if we want to join barbarians in the treatment of defeated foes, we should declare that. </p>\n<p>In general, &#8220;PC&#8221; usually translates into &#8220;polite,&#8221; &#8220;respectful, &#8220;civilized.&#8221; But by using the epithet &#8220;PC,&#8221; we get to be childish and even stupid and still feel good about it.</p>\n",
    "parent": 0
  },
  {
    "id": 412866,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-11-25T20:39:09",
    "content": "<p>People are getting paid.  Politicians are getting their kick backs.</p>\n<p>Not surprised that the new worked only on paper.  Hopefully the next administration isnt so prone to corruption and greed.</p>\n",
    "parent": 0
  },
  {
    "id": 412865,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2019-11-25T19:37:37",
    "content": "<p>Further to the comment above:<br />\n&#8220;and now&#8230;&#8230;&#8230;the second HUGE dock queen???  DFO&#8221;<br />\nWhich indicates John F. Kennedy will be &#8216;christened&#8217; on 7th December?</p>\n",
    "parent": 0
  },
  {
    "id": 412864,
    "author": "DAVID RYE",
    "authorUrl": "",
    "date": "2019-11-25T15:03:28",
    "content": "<p>A comment from one closer to the action or should that be in-action?</p>\n<p>&#8220;A &#8220;war criminal&#8221;&#8230;&#8230;..or a so called one due to the widespread PC attitude now run amok in the U.S. Military after 8 years of the uberleft OHbummurr MISadministration? One just might wonder????????????</p>\n<p>Given Spencers&#8217; brags re the FORD, he&#8230;.IMhO&#8230;&#8230;.as a former U.S. MARINE deserves to get the boot out the door.</p>\n<p>So far our tax dollar$ have purchased a floating POS that still is apparently not close to functioning, and 2 more are on the way. Oh how nice&#8230;&#8230;&#8230;.. 😡 DFO&#8221;</p>\n",
    "parent": 0
  }
]