[
  {
    "id": 406133,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-05-09T14:23:19",
    "content": "<p>NDT ultrasonics have been used to QA fibreglass structures and detect delamination for a long time now. The equipment is not overly expensive but I think it should become at least an option in a marine survey.</p>\n",
    "parent": 0
  },
  {
    "id": 406130,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-05-08T16:40:24",
    "content": "<p>The problem is that with modern fin keels supported by a grillage/matrix system of stringers, it can be hard to spot the initial hull cracking and/or damage to the stringers where they are bonded to the hull. Both are easy for surveys to miss.</p>\n",
    "parent": 406106
  },
  {
    "id": 406111,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-05-06T21:18:55",
    "content": "<p>Makes me glad to think that catamaran keels are more robust by the way that they are attached.  Should I ever win the lottery and be able to get a yacht of my own.  It will be a cat instead of a traditional monohull.</p>\n",
    "parent": 0
  },
  {
    "id": 406107,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2018-05-06T05:25:52",
    "content": "<p>It happens to the best of them, this is a frightening sequence events where red flags flew continuously:</p>\n<p><a href=\"https://yachtemoceans.com/polina-star-iii-keel-loss/\" rel=\"nofollow ugc\">https://yachtemoceans.com/polina-star-iii-keel-loss/</a></p>\n<p>The Beneteau First keels originally had the keel box bonded to the hull with pads of glue rather than glassed in at construction and I know of many that were expensively rebuilt because of this problem, indeed if this rebuild has already been made your hull is more valuable than those not. Prior to this rebuild, any grounding  or collision with the keel would be detrimental and cumulative. Cheeki Raffiki had this rebuild done by a reputable, and in my opinion, best South Coast of England yard but who knows what had happened before?</p>\n<p>The Polina Star appears to be a lack of supervision at an inexperienced sub-contractor in the construction of the keelbox, the cheapest part of any project is supervision.</p>\n",
    "parent": 0
  },
  {
    "id": 406106,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2018-05-05T21:22:37",
    "content": "<p>Although design and construction of a hull (any hull of any materials) has to take into account many factors, the initial seaworthiness, and quality, of the hull depend upon careful calculations of many different types, and the quality of the materials as well as using best practices construction techniques.   Once the boat leaves the builder&#8217;s yard, maintaining the hull in tip top shape is up to the owner and the folks who maintain the boat during periodic maintenance.     Careful examination of a hull of a boat should help determine what is happening, and a boat should be hauled so that the cradle or slings are not &#8220;holding&#8221; the ballast keel tightly to the hull.    Having an occasional survey (required by many insurance companies) helps.    If a boat has been aground or in a accident, it should be carefully inspected as soon as possible.  The USCG requires this of CG inspected and certified passenger vessels.     </p>\n<p>Prudence and common sense helps.</p>\n",
    "parent": 0
  },
  {
    "id": 406103,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-05-05T16:13:36",
    "content": "<p>The same mentioned here.</p>\n<p>Why do keel failures<br />\nhappen and what can<br />\nwe do to prevent it?<br />\n<a href=\"http://www.yachtingworld.com/news/keel-failure-shocking-facts-60006\" rel=\"nofollow ugc\">http://www.yachtingworld.com/news/keel-failure-shocking-facts-60006</a></p>\n",
    "parent": 0
  }
]