[
  {
    "id": 429253,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-09-26T10:11:41",
    "content": "<p>Well is it not amazing that there is not a clear record of the incident. I rather like the story referring to South Africa.  My great-uncle on my Mothers side served as a Sergeant in the South Africa Regiment.  We have a photograph of him with his unit which was taken during the Second Boer War, this is a thing of wonder in itself.  Also amongst our collection of about a dozen are ones of Zulu warriors charging the Line.  There is one of a Zulu Kraal, tribal wedding and a tribal court with my uncle in attendance as Administrater an appointment he received after the War ended. As a good Irishman serving in the British Colonial system he learned a couple of Zulu languages and Africcans.  He went on to serve in World War 1 and was wounded while driving a truck.</p>\n",
    "parent": 0
  },
  {
    "id": 429244,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2022-09-25T16:25:09",
    "content": "<p>Here is another version of story as recounted by Princess Alice: </p>\n<p>At Windsor, when the royal coffin was loaded atop the gun carriage for the procession and the artillery horses took the weight, granddaughter of Queen Victoria Princess Alice, Countess of Athlone said the day was very cold and &#8220;nothing in the world would make them start&#8221;. An attendant Royal Guard from HMS Excellent was shortly then ordered to haul the gun carriage with ropes instead, a disruption which subsequently became state funeral tradition. She further observed that the Royal Artillery, responsible for the horses and the gun carriage, &#8220;were furious&#8230; humiliated beyond words&#8221; by the incident.</p>\n<p><a href=\"https://youtu.be/qS4hAbHLszw\" rel=\"nofollow ugc\">https://youtu.be/qS4hAbHLszw</a></p>\n",
    "parent": 0
  },
  {
    "id": 429242,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2022-09-25T15:21:52",
    "content": "<p>The Queen&#8217;s coffin was taken from Edinburgh to RAF Northolt in North London by a RAF Boeing C17 Globemaster transport. Diana&#8217;s coffin was taken from Paris to Northolt in a BAe 146 of the Queen&#8217;s flight but it was problematic getting her into the hold. Further modifications of the aircraft since then have made this impossible.</p>\n<p>Following a review of the requirements of a Royal death and repatriation, the C17 was the obvious choice to carry out the repatriation duty. This caused some embarrassment within the RAF. The C17s were used to repatriate servicemen&#8217;s bodies from Afghanistan but QEii said &#8220;If it is good enough for my boys, it is good enough for me.&#8221;</p>\n<p>What a lady?</p>\n<p>As an aside, she met servicemen from Afghanistan who had lost limbs. One serviceman who had lost two legs and an arm was asked by QEII what he would do now. He replied &#8220;It doesn&#8217;t matter. I shall help those who are worse off than myself.&#8221; Queen Elizabeth was humbled and had a tear in her eye.</p>\n<p>RIP M&#8217;am.</p>\n",
    "parent": 0
  },
  {
    "id": 429240,
    "author": "Mike Lee",
    "authorUrl": "",
    "date": "2022-09-25T12:12:54",
    "content": "<p>There are other offerings for this story. One is that teams of sailors were used to haul heavy naval guns borrowed from warships across very difficult terrain in South Africa during the Boar War where horses were unable to go. Queen Victoria wanted to thank them for this service and asked them to haul her Coffin on a gun carriage when the time came.<br />\nThe rearing hoses story is not one set in stone.</p>\n",
    "parent": 0
  }
]