[
  {
    "id": 412687,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-11-10T18:08:23",
    "content": "<p>Well, it&#8217;s incumbent on critics (in the scientific community at least) to offer a superior alternative hypothesis to one that is presented with reasonable supporting information. Until that happens, the hypothesis stands. </p>\n<p>So we could start by asking &#8220;which part of the article is conjecture?&#8221; </p>\n<p>The article&#8217;s hypothesis of course is conjecture, but conjecture comes in different qualities. I could conjecture that water boils at 50C at sea level pressure, but that conjecture wouldn&#8217;t be supported by observation or experiment. </p>\n<p>For the paper in question, conjecture starts with expectations borne of known principles, principles that lead to an expected outcome. What alternative hypothesis would explain how a <i>observed</i> promotion of lightning discharges is associated with shipping lanes and <i>observed</i> prevalence of compounds that would, a combination we can fully expect given what we already know about lightning?</p>\n<p>The thing is, at the end of the day &#8220;I doubt it&#8221; isn&#8217;t an argument. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 412677,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-09T16:17:59",
    "content": "<p>Doug,<br />\nI&#8217;ve been listening ti VLF and S/W since I was a kid some 60+ years ago, that lead to my HAM ticket in 1975.</p>\n",
    "parent": 0
  },
  {
    "id": 412670,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-11-08T20:46:27",
    "content": "<p>&#8220;We hypothesize that emissions of aerosol particles and precursors by maritime vessel traffic lead to a microphysical enhancement of convection and storm electrification in the region of the shipping lanes.&#8221;</p>\n<p>The problem with hypothesys is when people pass them off as proven fact.  A hypothesy is some ones learned guess at what is going on and may have been dismissed by the scientific community.</p>\n<p>Until then the article is mostly conjecture that shouldnt be published as fact.  As there are many other things out there that are also known as &#8220;fake news&#8221;.  At least the article <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2017GL074982\" rel=\"nofollow ugc\">https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2017GL074982</a> states it is only a hypothesy.</p>\n",
    "parent": 0
  },
  {
    "id": 412669,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-11-08T17:54:54",
    "content": "<p>Observations here are via a receiver network on VLF radio, Dick. </p>\n<p>See the research paper (which awesomely enough is open access, not paywalled):<br />\n<a href=\"https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2017GL074982\" rel=\"nofollow ugc\">https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2017GL074982</a></p>\n<p>Here&#8217;s the receiver network:<br />\n<a href=\"http://wwlln.net/\" rel=\"nofollow ugc\">http://wwlln.net/</a></p>\n",
    "parent": 0
  },
  {
    "id": 412667,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-11-08T16:21:01",
    "content": "<p>Like active volcanos, friction of the dust/Ash clouds causes static, then you get static-discharge AKA lightning.</p>\n",
    "parent": 0
  },
  {
    "id": 412666,
    "author": "Dick B",
    "authorUrl": "",
    "date": "2019-11-08T14:07:14",
    "content": "<p>I don&#8217;t suppose it could be that the people who report lighting strikes are in<br />\nthose busy shipping lanes, while the vast, vacant reaches of the open sea are lonely places, uninhabited by human watchers.</p>\n<p>Following the premise, I wonder that busy freeways and rail lines have also attracted Thor&#8217;s darts, especially back in the coal burning era and sooty diesel trucks.  Should Airports have been a playground for sparklers<br />\nwhen jets spewed their brownish trails?</p>\n<p>And again, when coal, wood and peat were primary fuels, was London a<br />\nprime spot for Lightning watchers?  I wonder.</p>\n",
    "parent": 0
  }
]