[
  {
    "id": 405522,
    "author": "COLIN Smith",
    "authorUrl": "",
    "date": "2018-02-23T02:36:00",
    "content": "<p>Usual chaotic response to a very minor incident. Everybody behaved badly. “Security” putting in the boot should be fired. Attempts to stop filming also a bad move. Nobody seemed to be in control. I don’t know whether the Master turned up, or whether he would have been effective. Situation was allowed to get out of control bypoor mahagement. Brain ken up fights like these on crowded ferry. The Master’s reserve, bearing andbehaviour are everything. If he cannot stamp his authority in a situation like this he should n’t be on the ship.</p>\n",
    "parent": 0
  },
  {
    "id": 405509,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-02-19T17:02:32",
    "content": "<p>Made it on national news in US.<br />\nNever ask for scotch tape in the UK: if you&#8217;re lucky, they will correct you nicely.</p>\n",
    "parent": 0
  },
  {
    "id": 405507,
    "author": "D. Peter Boucher, Kt. SMOM, Dipl. L A, International Master Mariner",
    "authorUrl": "http://formerly%20NAUTICAL%20LOG",
    "date": "2018-02-19T09:35:43",
    "content": "<p>Thongs, flip-flops, rubber slipper, go-aheads, whatever they really do not seem fighting over even by Aussies.  As a former cruise ship Officer &#8211; definitely NOT with Carnival Cruises &#8211; the behavior of the uniformed crew member was not justified.  This Barkho family seem to have a major social problem always a touchy issue with Aussies. One would point out however that as far as lawsuits are concerned, (I taught Maritime Law for a couple of years at College level when I came ashore after 50 years at sea), the Law that applies always even in Port  &#8211; unless the Company chooses to call in local law enforcement &#8211; is that of the Flag State which is currently Malta.  The MS Carnival Legend is a Spirit-class cruise ship which from 2002-2014 was registered in Panama and from 2014-present Malta.  It would seem that as usual with Carnival they over did the spirit and partying.  Their first vessel was named SS Mardi Gras and known as &#8220;Party Grass&#8221; in the Port of Miami, FL and it was well nicknamed !!<br />\nOne doubts if very much will happen since the Company handed these passengers over to the NSW Police jurisdiction was waived from Malta.</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 405505,
    "author": "Ron Wilkinson",
    "authorUrl": "",
    "date": "2018-02-18T14:29:09",
    "content": "<p>Soon to come, caged fights on cruise ships. Any passenger can join in on a MMA brawl.</p>\n",
    "parent": 0
  },
  {
    "id": 405504,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-18T07:30:44",
    "content": "<p>Ah, I&#8217;d better explain, Sellotape is clear single sided adhesive tape and Durex are men&#8217;s contraceptives in the UK.</p>\n",
    "parent": 0
  },
  {
    "id": 405503,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-18T07:23:58",
    "content": "<p>And apparently they call Sellotape Durex, caused much hilarity when an Australian chap yelled out &#8220;anyone got any Durex&#8221; in a London art studio where I was working.</p>\n",
    "parent": 0
  },
  {
    "id": 405502,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2018-02-17T18:54:38",
    "content": "<p>I was wrong. I thought that the &#8220;thong&#8221; in question was a style of bikini bottom. My friend Google, however, corrected me.</p>\n<p>Thongs are not skimpy underwear in the land down under, they are what our Aussie friends call flip-flops, a staple piece of footwear for every citizen. &#8230; Although thongs in Australia are, well, not as sexy as the thongs in America – they mean so much more there.</p>\n",
    "parent": 0
  },
  {
    "id": 405501,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-02-17T18:52:18",
    "content": "<p>Sounds like the &#8220;drunken Russian wedding&#8221; YouTube&#8221; videos I&#8217;ve watched.</p>\n<p>And they are all related?<br />\nHave fun next holiday!</p>\n",
    "parent": 0
  },
  {
    "id": 405500,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-17T16:42:52",
    "content": "<p>Can somebody clarify whether the thong was an item of footwear or a lady&#8217;s undergarment 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 405499,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "",
    "date": "2018-02-17T16:36:24",
    "content": "<p>I am shocked to see security putting the boot in. Not good policing. They are no better than the idiots brawling. Could be a few lawsuits against the company following.</p>\n",
    "parent": 0
  },
  {
    "id": 405498,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-02-17T16:36:13",
    "content": "<p>Addendum: will the &#8220;legal team&#8221; produce a photo of the injured victim, in court?</p>\n",
    "parent": 0
  },
  {
    "id": 405497,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-02-17T16:35:27",
    "content": "<p>Carnage ensues after thong is trod upon.</p>\n<p>Truly fiction can&#8217;t stand up to truth. As comedic invention this would barely play because it&#8217;s so broad.</p>\n",
    "parent": 0
  }
]