[
  {
    "id": 407113,
    "author": "Phil",
    "authorUrl": "",
    "date": "2018-09-15T17:43:59",
    "content": "<p>There are 9- storms in the Tropics across the world.</p>\n<p>Typhoons, tropical<br />\nstorms and hurricanes<br />\nare sweeping across<br />\nthe tropics<br />\n20:31, Sep 13 2018<br />\n<a href=\"https://i.stuff.co.nz/world/107069048/typhoons-tropical-storms-and-hurricanes-are-sweeping-across-the-tropics?rm=m\" rel=\"nofollow ugc\">https://i.stuff.co.nz/world/107069048/typhoons-tropical-storms-and-hurricanes-are-sweeping-across-the-tropics?rm=m</a></p>\n",
    "parent": 0
  },
  {
    "id": 407106,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2018-09-15T13:09:40",
    "content": "<p>Ideally, politicians are those we appoint to behave as our &#8220;adults in the room,&#8221; those whom we agree may tell us &#8220;no&#8221; in order to check impulse that can&#8217;t really be termed &#8220;worst&#8221; as they&#8217;re only human nature. We want things we can&#8217;t have, are inclined to thoughtless expedience, so we formalize the process of being told &#8220;no you may not,&#8221; make it acceptable by being a matter of consensus.</p>\n<p>This is how we have developed a pretty reliable system of ensuring that&#8211; for instance&#8211; our neighbor&#8217;s sewer pipe does not empty at our property line, nor ours at their&#8217;s. Other examples abound. It&#8217;s why we use the term &#8220;governance.&#8221; An engine without a governor may explode messily, and a society without effective governance is guaranteed to do so.</p>\n<p>North Carolina and Florida represent an almost complete inversion of the ideal scenario. Instead of helping us behave as adults, so-called &#8220;leadership&#8221; is doing the parental equivalent of heading to Las Vegas with the family savings while handing the kids keys to the cars and the liquor cabinet. </p>\n<p>It can end nicely or nastily. That outcome is entirely in our control as we&#8217;re blessed with ability to replace our agreed &#8220;parents&#8221; at any time, by voting.</p>\n",
    "parent": 0
  },
  {
    "id": 407091,
    "author": "Jean-pierre Declemy",
    "authorUrl": "",
    "date": "2018-09-14T11:29:38",
    "content": "<p>What they know and what they say are probably not related as long as the status quo is profitable to them.<br />\nDoes anyone check the small print on realty (property sale) contracts?<br />\nWhen we were getting a licence to rebuild our sailing club jetty we made sure the contract would protect us from rising sea levels preventing its use, even adding what is called south-east land tilt (England is sinking whilst Scotland is rising as a consequence of the glaciers melting after the last ice age).</p>\n",
    "parent": 0
  }
]