[
  {
    "id": 409871,
    "author": "glenwood weather",
    "authorUrl": "https://www.glenwoodwashington.info",
    "date": "2019-03-16T12:24:39",
    "content": "<p>On her voyage to San Francisco, the Flying Cloud carried 100 sacks of coffee, 50 tons of coal, 60 cases of Havana Cigars&#8230;..<br />\nPassengers on the 1851 trip were the Lemuel Lyon family of Roxbury, Mass.  While in port in San Francisco, Miss Ellen Lyon married Reuben Boise of Portland, Oregon Territory.<br />\n<a href=\"https://www.maritimeheritage.org/captains/creesy.html\" rel=\"nofollow ugc\">https://www.maritimeheritage.org/captains/creesy.html</a></p>\n<p>Reuben Boise was prominent in Oregon history, serving as an attorney,  judge and politician.  He was on the board of several Oregon universities.</p>\n",
    "parent": 0
  },
  {
    "id": 409868,
    "author": "Capt. J. 'Collins",
    "authorUrl": "",
    "date": "2019-03-16T11:46:23",
    "content": "<p>For those interested in 19th century economic trade, clipper ships, China opium wars and prominent New England family dynasties, the book &#8220;Barons of the Seas&#8221; by Steven Ujifusa is a pretty good read. The Creesy&#8217;s were well versed in understanding the ocean currents, dominant pressure systems relating to doldrums or horse latitudes on the way &#8217;round the horn. Taking the east&#8217;ard track across the south Atlantic then running back down to the horn proved invaluable in the quest for record setting passages to California and China.</p>\n<p>Being a Marbleheader and having a father who educated his young daughter was not at all the norm. She quickly grasped the mathematical concepts of navigation. </p>\n<p>I being a widower raised in New England and being professional seaman I have taught both my daughters the art of navigation. They are both gifted with the math &#8220;gene&#8221; and one is an engineering student and the younger tutors pre-calc at her high school, a program she designed and implemented for engineering track students. She is going to intern at the Harvard genetics lab this summer and is on track as a Bio Engineer student.<br />\nWomen are by nature very practical navigators, if I can use the words of Bowditch.<br />\nThe Creesy&#8217;s record setting passage  from New York to San Francisco aboard Flying Cloud was not broken again until 1989! </p>\n<p>Eleanor Creesy is without doubt the finest navigators of that era.<br />\nI wish kids today were taught proper history of this amazing era of commerce and how much strong influence women played in the development of this great country.</p>\n",
    "parent": 0
  },
  {
    "id": 409859,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-03-15T16:23:01",
    "content": "<p>Linda, from what I read, Josiah entered the Navy as an officer and there was no place for a woman in the Navy.</p>\n",
    "parent": 0
  },
  {
    "id": 409858,
    "author": "Linda Collison",
    "authorUrl": "http://www.lindacollison.com",
    "date": "2019-03-15T16:14:04",
    "content": "<p>Thanks for posting, Rick. Eleanor Creesy was an accomplished navigator, and as a team she and Capt. Josiah were winners. How specifically, were they separated by the war, I wonder?</p>\n",
    "parent": 0
  },
  {
    "id": 409846,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-15T02:16:08",
    "content": "<p>What a great story.  Thankyou Rick</p>\n",
    "parent": 0
  }
]