[
  {
    "id": 409919,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2019-03-20T18:00:26",
    "content": "<p>I have been following both City of Adelaide ex Carrick ex City of Adelaide and Falls of Clyde over the intermediate years and have visited both at various times. Such ships are precious relics of an illustrious past, it is as has been said by others not that there is a shortage of money just that it is in the wrong hands. While on my recent trip in Portugal I came across at Ilahvo the schooner Polynesia ex Argus where she has lay ten years or more she is boarded up with plates welded over all the accesses.  I did manage to get photographs of her above decks, she is in a parlous state and is I gather now owned by the son of one of her former captains. Built in 1939 she is one of only two Grand bank 4 posters the other being Creola 1937. Argus had sailed as Polynesia when the late Mike Burke had her in his Barefoot fleet and that is how I saw he when I was crewing Sea Cloud in the Caribbean in 1982. It has to be hoped that her owner who can afford it if he wants has the will to restore the schooner to her past glory. I was surprised to see that her four masts were still towering over the quayside held up by extremely rotten rigging.</p>\n",
    "parent": 0
  },
  {
    "id": 409763,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-03-08T16:19:58",
    "content": "<p>The City of Adelaide spent $8 million to build an enclosure to house two pandas on loan from China. They also are spending about $1 million per year for each of the last ten years to care for the borrowed pandas. The pandas are due to be returned to China is about a year&#8217;s time.</p>\n<p>Money is not the issue. How the money is allocated is.</p>\n",
    "parent": 409761
  },
  {
    "id": 409761,
    "author": "David Riddle",
    "authorUrl": "http://eeyore.org",
    "date": "2019-03-08T15:09:03",
    "content": "<p>Surely the reality is that, no matter how desirable the preservation of these ships may be, the available money, knowledge and resources can only sustain a very few projects, even on a worldwide basis. It is simply not feasible to save everything, especially when decay has reached a certain point.</p>\n",
    "parent": 0
  },
  {
    "id": 409740,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-03-05T13:28:51",
    "content": "<p>It is a uphill battle to restore.  Alas there are many things that need restoration that alot of people are restorationed out.</p>\n<p>There is a locomotive in town here that only needs 100 grand to make it operational.  So far the locals have only raised 14 grand.  Then again where we live is a depressed society.</p>\n",
    "parent": 0
  },
  {
    "id": 409739,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-03-05T08:47:16",
    "content": "<p>Promises promises&#8230; a verbal agreement is only as good as the paper it is written on. City governors who let this situation come about need naming and shaming on public TV.</p>\n",
    "parent": 0
  },
  {
    "id": 409736,
    "author": "Ginny",
    "authorUrl": "",
    "date": "2019-03-04T23:36:37",
    "content": "<p>What more forward thinking projects can there be &#8212; for a billionaire with plenty of cash to spare?    They could save these historic and worthy vessles and have an amazing private sailing vessel.</p>\n<p>Our maritime heritage is very much at stake, and I hope that these boats don&#8217;t get scrapped, or bastardized as the CUTTY SARK has been.</p>\n",
    "parent": 0
  },
  {
    "id": 409735,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2019-03-04T21:18:54",
    "content": "<p>This is so sad. I have a long association with the &#8220;Carrick&#8221; as she was called in Scotland and watched her decay with a great sense of frustration. I was convinced that Adelaide would be her saviour but the runes on this are not good.</p>\n<p>We are also looking at bringing the &#8220;Falls of Clyde&#8221; back to Scotland but I am concerned that she will suffer the same fate. Both vessels are in advanced states of decay and the conservation will be rebuilds. In the UK this rings alarm bells with the recent disastrous cost increases for the &#8220;Cutty Sark&#8221; in Greenwich and the Glasgow School of Art, two iconic structures with large wooden contents that have had three major fires between them. On the Clyde, we have recently restored the &#8220;Glenlee,&#8221; a beautiful three masted barque (  <a href=\"https://en.wikipedia.org/wiki/Glenlee_(ship)\" rel=\"nofollow ugc\">https://en.wikipedia.org/wiki/Glenlee_(ship)</a>  )  whose state of preservation was good after being looked after as a training ship for the Spanish Navy.As a trust she struggles and depends on volunteers, many of them grey haired. To add the &#8220;Falls of Clyde&#8221; will stretch enthusiasm and resources to the limit. Further, two recent restoration projects have come to fruition, the original &#8220;Queen Mary&#8221; and the &#8220;Maid of the Loch.&#8221; Both will require extensive stripping out and rebuilding after years of neglect.</p>\n<p>Perhaps we could become a centre of excellence for ship restoration and museums but that will require extensive funding and that is like hens teeth in this modern day and age. I live in hope.</p>\n",
    "parent": 0
  }
]