[
  {
    "id": 427651,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-06-21T10:42:36",
    "content": "<p>Further to my first comment after further research I found , to my horror, that these vessels MS Global Dream &amp; Global Dream 2 were planned for 9000 passengers.  To mann  them they would most likely need at a ratio of 1 to 3 so 3000 crew.  No problem for the PRC as they would operate from China and around South-East Asia.  One can only imagine being on a ship with 12,000 persons.</p>\n<p>Further thinking led me to the possibility that the PRC will acquire these vessels and follow their example of acquiring and building aircraft carriers use them for some PRC purpose.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 427650,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2022-06-21T09:27:36",
    "content": "<p>Excellent comment with which I entirely agree.  </p>\n<p>Having spent nearly three decades in the cruise industry from 1968 onwards I was involved from the beginning of development.  Never once did Management ever listen to us seamen operating their ships.  Once the &#8220;hotel managers&#8221; began the overexpansion it got out of control.  In addition the USCG became the &#8220;yes service&#8221; to the industry and cruise ships became floating resorts. </p>\n<p>I had contact with Genting during their planning to operate from Miami to Bimini but never followed up as it was time for me to retire after 50 years</p>\n<p>As I have said and written many times before sadly one day there is going to be a dreadful tragedy when one of these vessels is lost at sea.  It is quite impossible to evacuate all the thousands of multi-national personnel on board to prevent this happening.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 427647,
    "author": "Jean-Pierre",
    "authorUrl": "",
    "date": "2022-06-21T06:38:55",
    "content": "<p>The idea of a cruise is to get away from it all which doesn&#8217;t actually pan out with 8,999 other passengers. The cruise industry lost its way through greed. The pandemic only helped to burst the bubble.</p>\n",
    "parent": 0
  }
]