[
  {
    "id": 441781,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2025-04-23T10:17:07",
    "content": "<p>Good points Rick.</p>\n<p>I remember those heavy lift derricks and having to go out on the Bridge wings to check for traffic.  Of course no computerized Radars in those days. Now they have gone to the other extreme keeping watch sitting in armchairs pressing buttons, if they are even awake !!</p>\n<p>Good Watch.</p>\n",
    "parent": 0
  },
  {
    "id": 441771,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2025-04-22T13:43:02",
    "content": "<p>Visibility is a serious issue but is not limited to sails. I recall the challenges in meeting IMO Reg 22 standards on geared container ships as well as Stulcken heavy lift derricks on break bulk cargo liners. Both suction sails and Flettner rotors are narrow enough to likely meet the blind spot criteria in the rules.</p>\n",
    "parent": 441710
  },
  {
    "id": 441710,
    "author": "D. Peter Boucher, Kt. SMOM, International Master Mariner (retd.)",
    "authorUrl": "http://not%20applicable",
    "date": "2025-04-19T10:39:10",
    "content": "<p>Well now here we go again. The IMO allowing blocking the forward visibility with sails. Match this with say a Russian captain and stand-by for a repeat of recent nautical action.  Once again the Rules of the Road are violated with impunity.</p>\n<p>One can watch the new cruise ships at the Port of Miami with unbelievable junk on their decks, the latest have swings which swing guests tempting providence for an accident which will happen one voyage. Together with thousands of &#8220;guests&#8221;, as passengers are now called, all waiting for an enormous tragedy to happen.</p>\n<p>As a retired Safety Officer one does not envy the current ones.</p>\n<p>Good Watch</p>\n",
    "parent": 0
  },
  {
    "id": 441694,
    "author": "ws",
    "authorUrl": "",
    "date": "2025-04-18T13:35:44",
    "content": "<p>I’ve seen a lot,  remember SNAME &amp; the proposed rotary sails on ships after the 78 oil embargo..<br />\nToday, these systems are getting real world testing in the inhospitable Marine environment..</p>\n<p>Today’s Doppler radar &amp; computers enable ships to avoid hurricanes &amp; nor’easters</p>\n",
    "parent": 0
  },
  {
    "id": 441693,
    "author": "ws",
    "authorUrl": "",
    "date": "2025-04-18T13:30:51",
    "content": "<p>Nice! </p>\n<p>Many thanks this is a great use of the Bernoulli equation!</p>\n",
    "parent": 0
  }
]