[
  {
    "id": 410777,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2019-05-31T16:56:43",
    "content": "<p>Jean-Pierre, good question. Google maps show the gulf as the Gulf of Lion between the Balearic and Ligurian Seas. I have seen it on charts as the Gulf de Lyons, which is not a direct translation. From Wikipedia:</p>\n<p>The current name of the gulf appeared at least during the 13th century (in medieval Latin sinus Leonis, mare Leonis) and could come from comparison with a lion: it would simply suggest that this part of the sea is as dangerous as a lion because it has very violent, surprising winds that threaten boats (sailors and fishermen know these dangers very well[1]). This comparison with a lion is suggested by various converging sources: Deroy and Mulon&#8217;s dictionary of French place names,[2] Mistral&#8217;s comprehensive Occitan dictionary,[3] Diderot and D&#8217;Alembert&#8217;s famous French encyclopedia[4] and several texts in Latin since the 13th century.[5][6]</p>\n<p>These sources, especially Deroy and Mulon, Diderot and D&#8217;Alembert, reject the hypothesis according to which the name would be related to the city of Lyon, since it is too far from the gulf.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Gulf_of_Lion#/media/File:Gulf_of_Lion_map.png\" rel=\"nofollow ugc\">https://en.wikipedia.org/wiki/Gulf_of_Lion#/media/File:Gulf_of_Lion_map.png</a></p>\n",
    "parent": 410775
  },
  {
    "id": 410775,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2019-05-31T16:49:27",
    "content": "<p>@Willy<br />\nPresumably they thought sending it as deck cargo would be safer than sailing the yacht between races.<br />\nAlso I believe that such racing vessels use smaller rigs and sails for delivery trips which on a yacht of that size would be quite a logistics exercise as they would still need the rig to be shipped separately.<br />\n@Rick<br />\nWould that be the Gulf of Lyon, of the south of France, not the Gulf of Lion?<br />\nPresumably the yacht was only part of the cargo and the ship was calling at various ports.</p>\n",
    "parent": 0
  },
  {
    "id": 410768,
    "author": "Phil",
    "authorUrl": "",
    "date": "2019-05-30T15:33:45",
    "content": "<p>Was the yacht, My Song, bought with drug money?</p>\n",
    "parent": 0
  },
  {
    "id": 410765,
    "author": "Willy",
    "authorUrl": "",
    "date": "2019-05-30T08:55:20",
    "content": "<p>So here is the interesting thing I see in all this.  There is a sailboat that can sail a fast race.  Yet the sailboat cant be sailed to the next race.  Anyone else think there is something wrong here?  I mean it should have been cheaper to hire a crew to sail it casually to its next race.  Its not like the seas are so littered with debris to sink any ship afloat.</p>\n<p>Whats the addage?  The fool and their money are easily parted?  Have a mega yacht with sails, yet have it carried to the next race instead of sailing it?  So now he gets his money back n a insurance claim</p>\n",
    "parent": 0
  },
  {
    "id": 410753,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2019-05-29T14:01:10",
    "content": "<p><i>I wail when a screwdriver goes over the side. </i></p>\n<p>My favorite flat blade that I&#8217;d owned for 40 years went over the side last year. A bad moment.</p>\n",
    "parent": 0
  },
  {
    "id": 410750,
    "author": "Allan S",
    "authorUrl": "",
    "date": "2019-05-29T10:51:59",
    "content": "<p>As a guy living on a 10 ton, 38&#8242; boat with a 35&#8242; mast, I feel the pain. I mean, I wail when a screwdriver goes over the side. Yup, we are in different leagues for sure but I have empathy.</p>\n",
    "parent": 0
  }
]