[
  {
    "id": 438410,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2024-04-19T17:41:13",
    "content": "<p>One primitive weapon against U-boats that I&#8217;m told actually worked was charmingly simple: a few meters of chain.  The idea was for a boarding party to arrive aboard the U-boat as its crew was either about to embark or had just returned below.  The boarding party was to drop the chain down the open hatch.  Since it is notoriously difficult to push chain, the ploy kept the hatch open, making diving impractical. Unable either to fight or submerge, the U-boat then presumably surrenderedI don&#8217;t know if this ploy was ever used in combat, but I believe it seemed sufficiently plausible that some ships waging anti-submarine warfare were kitted out with chain of an  appropriate length and weight.</p>\n",
    "parent": 0
  },
  {
    "id": 438409,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2024-04-19T14:29:56",
    "content": "<p>During tensions between Sweden and Russia during the 80s following a Russian sub running aground on Swedish rocks a huge surveillance exercise ensued. Frequently, a sonar target would be investigated as a suspected Russian sub but all that was found on the target site were small bubbles. The Swedes thought that they were evasion tactics. On many occasions it came close to diplomatic incidents. For 15 years the Swedes followed target after frustrating target until an offhand remark by a fisherman gave the solution. The Baltic herring have a swim bladder connected to their anus and in an emergency shoal dive the air from the swimbladder was evacuated causing the sonar &#8220;target.&#8221; Essentially, they were chasing fish farts!</p>\n",
    "parent": 0
  },
  {
    "id": 438398,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2024-04-18T12:04:04",
    "content": "<p>The American designed V&amp;W class destroyers that arrived in 1917 were game changers, some were built in British yards.</p>\n<p>After WW1, they were mostly laid up, a lot of them in Port Edgar near Edinburgh but they were remobilised in WW2 with great effect. Some were modiified by removing a boiler and replacing it with a fuel tank making it a very effective long range escort for Atlantic and Afriican convoys.</p>\n<p>My father served on HMS Vesper which was involved in extracting the Dutch Royal Family, and on Atlantic and African convoys. It carried a depth charge that was so powerful she had to launch it at 30kts (38mph) or she would have broken her own back.</p>\n",
    "parent": 0
  },
  {
    "id": 438397,
    "author": "Peter Wr",
    "authorUrl": "",
    "date": "2024-04-18T11:56:44",
    "content": "<p>Sweden was worried about Russian sub infiltration in the early 1980s when sonar picked up loud sound and on investigation, only small bubbles were found on the surface above the target. It was predominant for 15 yeras and it nearly caused a diplomatic incident until the Swedes discovered that Baltic Herring had a swim bladder connected to their anus which they would empty to dive as a shoal when itimmidated.</p>\n<p>It was effectively fish farting that brought a major incident close to conflict.</p>\n",
    "parent": 0
  }
]