[
  {
    "id": 418626,
    "author": "Jean-Pierre Declemy",
    "authorUrl": "http://Hadlow%20Marine%20Services",
    "date": "2020-12-21T16:36:45",
    "content": "<p>I&#8217;m sure that if they had used chips (french fries) or ice cream they would have had far more success with training the seagulls.</p>\n",
    "parent": 0
  },
  {
    "id": 418622,
    "author": "Seymour Hamilton",
    "authorUrl": "http://SeymourHamilton.com",
    "date": "2020-12-21T09:53:02",
    "content": "<p>One element to come out of these barmy schemes was brilliantly simple: a length of chain with a hook on one end.  Should a U-Boat surface to fight, there was a brief period while its sailors were coming up the hatch one by one to get onto the deck to man the gun and repel boarders. If the RN proved to be too close, or the gun ineffective, then the U-Boat could submerge, provided it was was still capable. However, if the RN could a) launch a boat that b) could come alongside the U-Boat just as its crew were clambering up onto the deck, they could c) board the U-Boat and d) drop the chain through the conning tower, thus making it impossible for the U-Boat to submerge.  The elegant simplicity of this solution depended on the well-known fact that you can&#8217;t push a chain.  I&#8217;m told that this strategy was actually employed, although I can&#8217;t give time, place, and circumstances.  However, there was a standing order for the issuing of &#8220;chain, one fathom, with hook attached,&#8221; to one lucky member of any boarding party about to challenge a surfaced U-Boat.</p>\n",
    "parent": 0
  },
  {
    "id": 418621,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-12-21T05:47:43",
    "content": "<p>When one considers the expertise of gulls around fishing boats, the periscope-spotting idea doesn&#8217;t seem so crazy. 🙂</p>\n<p>In the <i>next</i> league level war, the US built and tested gliding bombs guided by pigeons pecking at &#8220;camera obscura&#8221; projections of target ships on ground glass, the pigeons having been trained for this duty. A three-pigeon &#8220;autopilot&#8221; crew provided all the intelligence necessary.The method worked in the technical sense but wasn&#8217;t really practical for deployment.</p>\n",
    "parent": 0
  },
  {
    "id": 418609,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-12-20T21:15:07",
    "content": "<p>What!?  They diidnt consider using ball and chain of muzzle loading (mast cutters) as a way to bend a periscope????  If it worked on sail, it would have been easy enough to fire from a deck gun.  </p>\n<p>Tho I dont know what that would have done to the barrel.  Yet if you bent the periscope, it certainly would have made it harder to use.  Yes the idea is far fetched.  Tho easier to implement than the gunny sack and hammer.</p>\n",
    "parent": 0
  },
  {
    "id": 418607,
    "author": "Ginny Jones",
    "authorUrl": "",
    "date": "2020-12-20T18:39:10",
    "content": "<p>Holy Smokes:   Rube Goldberg at work!</p>\n",
    "parent": 0
  }
]