[
  {
    "id": 406941,
    "author": "Chris Roche",
    "authorUrl": "http://wwwcapehorners.org",
    "date": "2018-08-22T08:30:30",
    "content": "<p>Hi from England here we are no better at conservation of our maritime and industrial past the bean counters are a truly sad bunch, we lost the grade I listed Brighton pier some years ago when at the behest of developers but blamed on vandals it was burnt to the waterline. I have a great deal of sympathy with the people in Scotland who have not given up trying to save Falls of Clyde the last sailing oil tanker. For my part I am connected to submarine boats through a great uncle who trained in Holland 4 and died in A8 long ago 8th June 1905. I wish all well in saving Ling a valuable part of our collective past, as I say often this side of the pond there is no shortage of money it is just that it is in the WRONG HANDS</p>\n",
    "parent": 0
  },
  {
    "id": 406897,
    "author": "Doug",
    "authorUrl": "",
    "date": "2018-08-18T10:51:46",
    "content": "<p>We usually think of vandals as teenagers who spray paint graffiti not cut bolts to purposely sink a submarine which is in a location valued for its real estate re-development.  I&#8217;m sure anyone with 1/2 a brain can figure out that these so-called vandals wanted the submarine unsalvageable so it could be cut up and disposed of with minimal cost rather than spend millions to salvage it and maybe add it to Camden where the USS New Jersey is located.  But this is New Jersey where I was born &#8211; are folks really going to raise an issue?  Doubtful &#8211; expect it to chopped up and trucked off to the dump in the name of saving the environment&#8230;..</p>\n",
    "parent": 0
  },
  {
    "id": 406859,
    "author": "Fred",
    "authorUrl": "",
    "date": "2018-08-16T08:05:27",
    "content": "<p>This is such sad news. I live very close to the Ling and in years past my children had birthday celebrations on this venerable vessel.</p>\n",
    "parent": 0
  },
  {
    "id": 406858,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-08-16T07:12:48",
    "content": "<p>More than likely some one just opened all of the valves with out a clue what had been done.</p>\n",
    "parent": 0
  },
  {
    "id": 406857,
    "author": "Willy",
    "authorUrl": "",
    "date": "2018-08-16T07:11:13",
    "content": "<p>If the bottom is only 10 feet and the boat has a 17 foot draft.  She cant have sunk far.  Maybe a couple of inches at best.  However the interior would be flooded.  Presuming that the boat is still airtight.  It shouldnt be that hard to pressurize the hull to force the water back out.  No one needs to be inside as rudder use would be moot.  So a indutrial compressor could be rented and two tugs would be able to move her at the right time (after dredging).</p>\n",
    "parent": 0
  },
  {
    "id": 406856,
    "author": "Tim McFeely",
    "authorUrl": "",
    "date": "2018-08-16T06:47:01",
    "content": "<p>I find the vandalism as nothing more than a byproduct of not having a good home for the vessel.  As a submariner, she is in deplorable condition, now even more so with the bilges full of brackish water.  The loss of the plaques is more a sentimental loss of a memorial than a financial loss of a salable good.  The salable good is sitting on the bottom, likely until she is cut up.  Too many historic vessels (structures, locomotives, aircraft, etc) waste away to good intentions.  Neither funding nor meaning, as in the sailors that served on her and saved her have all probably passed, will save this once proud vessel; unfortunately.</p>\n",
    "parent": 0
  }
]