[
  {
    "id": 413291,
    "author": "Doug Bostrom",
    "authorUrl": "",
    "date": "2020-01-13T23:15:56",
    "content": "<p>I only wish sailboat racers knew to follow rules of the road. Or at least, not traipse back and forth across harbor entrances (pet peeve of Squalicum Harbor). </p>\n<p>As to the rest, if some fraction of things that racers commission to design and build trickle down to reproducible technology the rest of us can employ, terrific. Fin keel with a hefty bulb? Antiquated in the elite racing world but at my level, I <i>like</i>.  Buying one attached to a boat at an affordable price? Even better. And somebody else paid to cut all of that brush. 🙂</p>\n",
    "parent": 0
  },
  {
    "id": 413263,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-01-10T16:18:17",
    "content": "<p>You can have a boat or you can have money. You cannot have both.P</p>\n",
    "parent": 0
  },
  {
    "id": 413253,
    "author": "Rick Spilman",
    "authorUrl": "http://www.oldsaltblog.com",
    "date": "2020-01-09T16:14:21",
    "content": "<p>The Comanche cost a reported $15 million to build. That doesn&#8217;t include outfitting, upkeep or crew costs. I have no doubt that the other four maxis in race cost more. To my mind, that is a rich man&#8217;s sport. This doesn&#8217;t mean that anyone with a boat is rich or that the thousands of those employed in the industry are rich either. This is also the case in all other &#8220;rich men&#8217;s sports&#8221; from horse racing to grand prix racing.</p>\n",
    "parent": 413245
  },
  {
    "id": 413245,
    "author": "Peter Wright",
    "authorUrl": "",
    "date": "2020-01-08T16:04:21",
    "content": "<p>I get so pissed off with &#8220;the rich man sport&#8221; bit. The sport employs tens of thousands of people worldwide in an industry which is nothing short of philanthropy. </p>\n<p>This is a quote from my soon to be published book: </p>\n<p>&#8220;Often associated with privilege and class, the reality could not be further from the truth. In it we participate in a dangerous sport in a confined space working with all creeds, colours, religions, ages, backgrounds and any other box that one might be put into and who you may or may not like. Regardless you must perform physically and mentally demanding choreographed manoeuvres, problem solve, work as a team and as an individual.<br />\nMore importantly, of an evening, you must socialise with your crew of all creeds, colours, religions, ages, backgrounds and who you may or may not like. As a sport, sailing creates young people with sound team working, man management and social skills of the highest level.&#8221;</p>\n<p>It is the guys low down that the generosity of the guys at the top makes possible creates some of the best sport in the world.</p>\n",
    "parent": 0
  },
  {
    "id": 413234,
    "author": "Willy",
    "authorUrl": "",
    "date": "2020-01-07T19:38:09",
    "content": "<p>Boat is a accronym.<br />\nBring<br />\nOn<br />\nAnother<br />\nThousand</p>\n",
    "parent": 0
  }
]